[
    {
        "id": "tk10_451",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Intravenous bisphosphonates are very effective in treating severe hypercalcemia because they help the incorporation of excess calcium into the bone within 1-2 days.",
        "question_text_hu": "Az intravénás biszfoszfonátok nagyon hatékonyak a súlyos hiperkalcémia kezelésében, mert 1-2 napon belül segítik a felesleges kalcium beépülését a csontokba.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Bisphosphonates inhibit osteoclasts and shift the mineral balance towards deposition.",
        "explanation_hu": "A biszfoszfonátok gátolják az oszteoklasztokat, és az ásványianyag-egyensúlyt a lerakódás irányába tolják el."
    },
    {
        "id": "tk10_452",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Glucocorticoids are useful in the treatment of humoral hypercalcemia of malignancy (HHM) because they suppress the production of cytokines and other parathormone-like substances by tumor cells.",
        "question_text_hu": "A glükokortikoidok hasznosak a daganatos eredetű humorális hiperkalcémia (HHM) kezelésében, mert elnyomják a citokinek és más parathormon-szerű anyagok termelését a daganatsejtekben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Steroids have anti-inflammatory and anti-secretory effects on ectopic factor production.",
        "explanation_hu": "A szteroidok gyulladáscsökkentő és szekréciót gátló hatással bírnak az ektopiás faktortermelésre."
    },
    {
        "id": "tk10_453",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Administration of phosphates to treat hypercalcemia is considered dangerous because it may lead to widespread calcium-phosphate precipitation (metastatic calcification) in various tissues.",
        "question_text_hu": "A foszfátok alkalmazása a hiperkalcémia kezelésére veszélyesnek tekinthető, mert széles körű kalcium-foszfát kicsapódáshoz (metasztatikus kalcifikációhoz) vezethet a különböző szövetekben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "If the [Ca] x [P] solubility product is exceeded, insoluble salts form in soft tissues (kidney, vessels, joints).",
        "explanation_hu": "Ha a [Ca] x [P] oldhatósági szorzót túllépik, oldhatatlan sók képződnek a lágyszövetekben (vese, erek, ízületek)."
    },
    {
        "id": "tk10_454",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hyperventilation triggered by anxiety can lead to acute hypocalcemic symptoms because the resulting respiratory alkalosis increases the binding of ionized Calcium to plasma proteins.",
        "question_text_hu": "A szorongás által kiváltott hiperventiláció akut hipokalcémiás tünetekhez vezethet, mert az eredményül kapott respirációs alkalózis fokozza az ionizált kalcium plazmafehérjékhez való kötődését.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Loss of CO2 makes the blood alkaline; proteins release H+ and take up Ca++ on available sites, lowering the active fraction.",
        "explanation_hu": "A CO2-vesztés lúgosítja a vért; a fehérjék H+-t adnak le és Ca++-t vesznek fel a szabad helyekre, csökkentve az aktív hányadot."
    },
    {
        "id": "tk10_455",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In diabetic ketoacidosis, Kussmaul-type hyperventilation does not typically lead to hypocalcemic tetany because the underlying metabolic acidosis prevents the displacement of H+ from plasma proteins by calcium.",
        "question_text_hu": "Diabéteszes ketoacidózisban a Kussmaul-típusú hiperventiláció jellemzően nem vezet hipokalcémiás tetániához, mert a háttérben álló metabolikus acidózis megakadályozza a H+ kalcium általi kiszorítását a plazmafehérjékről.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Acidosis increases ionized calcium even if total levels are low, providing a protective effect against tetany.",
        "explanation_hu": "Az acidózis növeli az ionizált kalcium szintjét még alacsony összkalciumszint mellett is, védőhatást biztosítva a tetánia ellen."
    },
    {
        "id": "tk10_456",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Acute pancreatitis frequently causes hypocalcemia because the formation of calcium soaps during retroperitoneal fat necrosis depletes the serum of free ionized calcium.",
        "question_text_hu": "Az akut pancreatitis gyakran okoz hipokalcémiát, mert a retroperitoneális zsírnekrózis során képződő kalciumszappanok elvonják a szérumból a szabad ionizált kalciumot.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Saponification of fatty acids released by lipase uses up circulating calcium (sequestration).",
        "explanation_hu": "A lipáz által felszabadított zsírsavak elszappanosítása felemészti a keringő kalciumot (szekvesztráció)."
    },
    {
        "id": "tk10_457",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Dietary consumption of spinach can interfere with calcium absorption because the high oxalate and phytate content of plant food forms non-absorbable calcium complexes in the gut.",
        "question_text_hu": "A spenót étrendi fogyasztása zavarhatja a kalcium felszívódását, mert a növényi táplálék magas oxalát- és fitáttartalma nem felszívódó kalcium-komplexeket képez a bélben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Chelating agents in certain vegetables bind calcium, making it unavailable for enterocyte uptake.",
        "explanation_hu": "Bizonyos zöldségekben található kelátképző anyagok megkötik a kalciumot, elérhetetlenné téve azt az enterociták számára."
    },
    {
        "id": "tk10_458",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Severe diarrhea can lead to hypocalcemia via multiple mechanisms because besides direct malabsorption, the induced hypomagnesemia inhibits the effect of PTH on the bones.",
        "question_text_hu": "A súlyos hasmenés több mechanizmus révén is hipokalcémiához vezethet, mert a közvetlen felszívódási zavar mellett a kiváltott hipomagnezémia gátolja a PTH csontokra gyakorolt hatását.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Magnesium is a necessary cofactor for PTH receptor signaling and activation (post-receptor blockade in Mg deficiency).",
        "explanation_hu": "A magnézium szükséges kofaktora a PTH-receptor szignalizációnak és aktivációnak (posztreceptor-blokád Mg-hiányban)."
    },
    {
        "id": "tk10_459",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "'Hungry bone syndrome' occurs after the surgical removal of a parathyroid adenoma because the previously demineralized bones suddenly incorporate large amounts of calcium from the blood.",
        "question_text_hu": "Az 'éhező csont szindróma' a mellékpajzsmirigy-adenóma sebészi eltávolítása után lép fel, mert a korábban demineralizálódott csontok hirtelen nagy mennyiségű kalciumot építenek be a vérből.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Stopping the massive PTH-driven resorption leads to an 'anabolic sink' in the remineralizing skeleton.",
        "explanation_hu": "A masszív, PTH-vezérelt reszorpció leállása 'anabolikus elnyelőt' eredményez a remineralizálódó csontvázban."
    },
    {
        "id": "tk10_460",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Pseudohypoparathyroidism is characterized by low serum calcium and high PTH levels because it is caused by peripheral end-organ resistance involving disorders of G-proteins or the cAMP second messenger system.",
        "question_text_hu": "A pszeudohipoparatireózist alacsony szérum kalcium és magas PTH szint jellemzi, mert perifériás célszerv-rezisztencia okozza, amely a G-fehérjék vagy a cAMP másodlagos hírvivő rendszer zavaraival jár.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The parathyroid glands function normally but the kidneys and bones fail to respond to the hormonal signal.",
        "explanation_hu": "A mellékpajzsmirigyek normálisan működnek, de a vesék és a csontok nem válaszolnak a hormonális jelzésre."
    },
    {
        "id": "tk10_461",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which clinical interventions are available for the treatment of severe hypercalcemia? Select all that apply.",
        "question_text_hu": "Mely klinikai beavatkozások állnak rendelkezésre a súlyos hiperkalcémia kezelésére? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Rehydration with NaCl and water replacement",
                "Forced diuresis using furosemide",
                "Intravenous bisphosphonate administration",
                "Supplementation with high doses of Vitamin D",
                "Glucocorticoids (for HHM cases)"
            ],
            "hu": [
                "Rehidrálás NaCl- és vízpótlással",
                "Forszírozott diurézis furoszemid alkalmazásával",
                "Intravénás biszfoszfonát-kezelés",
                "Nagy dózisú D-vitamin-pótlás",
                "Glükokortikoidok (HHM-esetekben)"
            ]
        },
        "correct_answer": "Rehidrálás NaCl- és vízpótlással, Forszírozott diurézis furoszemid alkalmazásával, Intravénás biszfoszfonát-kezelés, Glükokortikoidok (HHM-esetekben)",
        "explanation_en": "High dose Vitamin D would worsen hypercalcemia.",
        "explanation_hu": "A nagy dózisú D-vitamin súlyosbítaná a hiperkalcémiát."
    },
    {
        "id": "tk10_462",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which conditions are categorized as chronic causes of hypocalcemia in adults? Select all that apply.",
        "question_text_hu": "Mely állapotok tartoznak a felnőttkori hipokalcémia krónikus okai közé? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Vitamin D deficiency (malabsorption, lack of UV)",
                "Chronic renal failure (1-alpha-hydroxylase deficiency)",
                "Autoimmune hypoparathyroidism (e.g. APECED)",
                "Malabsorption (celiac disease, lipase deficiency)",
                "Transient hypoparathyroidism of the newborn"
            ],
            "hu": [
                "D-vitamin-hiány (felszívódási zavar, UV-hiány)",
                "Krónikus veseelégtelenség (1-alfa-hidroxiláz hiány)",
                "Autoimmun hipoparatireózis (pl. APECED)",
                "Malabszorpció (lisztérzékenység, lipázhiány)",
                "Az újszülött átmeneti hipoparatireózisa"
            ]
        },
        "correct_answer": "D-vitamin-hiány (felszívódási zavar, UV-hiány), Krónikus veseelégtelenség (1-alfa-hidroxiláz hiány), Autoimmun hipoparatireózis (pl. APECED), Malabszorpció (lisztérzékenység, lipázhiány)",
        "explanation_en": "Neonatal forms are not adult causes.",
        "explanation_hu": "Az újszülöttkori formák nem felnőttkori okok."
    },
    {
        "id": "tk10_463",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which findings belong to the APECED (Autoimmune Polyglandular Endocrinopathy) syndrome? Select all that apply.",
        "question_text_hu": "Mely megállapítások tartoznak az APECED (autoimmun poliglanduláris endokrinopátia) szindrómához? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Hypoparathyroidism",
                "Addison's disease (adrenal insufficiency)",
                "Type 1 Diabetes Mellitus (pancreas insufficiency)",
                "Candida albicans infection",
                "Toxic goiter and hyperthyroidism"
            ],
            "hu": [
                "Hipoparatireózis",
                "Addison-kór (mellékvese-elégtelenség)",
                "1-es típusú diabetes mellitus (pankreász-elégtelenség)",
                "Candida albicans fertőzés",
                "Toxikus golyva és hipertireózis"
            ]
        },
        "correct_answer": "Hipoparatireózis, Addison-kór (mellékvese-elégtelenség), 1-es típusú diabetes mellitus (pankreász-elégtelenség), Candida albicans fertőzés",
        "explanation_en": "Hyperthyroidism is not a classical component of APECED; it involves multiple endocrine insufficiencies.",
        "explanation_hu": "A hipertireózis nem klasszikus eleme az APECED-nek; ez a szindróma több endokrin szerv elégtelenségével jár."
    },
    {
        "id": "tk10_464",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "How can malabsorption (e.g. chronic pancreatitis, celiac disease) lead to hypocalcemia? Select all that apply.",
        "question_text_hu": "Milyen módon vezethet a malabszorpció (pl. krónikus pancreatitis, celiac disease) hipokalcémiához? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Lipase deficiency causing steatorrhoea and Ca-soap formation",
                "Lack of Vitamin D absorption in the gut",
                "Direct inhibition of PTH secretion by gluten",
                "Interference by oxalates and phytates of plant food",
                "Excessive calcium loss through the kidneys"
            ],
            "hu": [
                "Lipázhiány, ami steatorrhoeát és Ca-szappan-képződést okoz",
                "A D-vitamin bélrendszeri felszívódásának hiánya",
                "A PTH-szekréció glutén általi közvetlen gátlása",
                "A növényi táplálék oxalátjainak és fitátjainak interferenciája",
                "Túlzott kalciumvesztés a veséken keresztül"
            ]
        },
        "correct_answer": "Lipázhiány, ami steatorrhoeát és Ca-szappan-képződést okoz, A D-vitamin bélrendszeri felszívódásának hiánya, A növényi táplálék oxalátjainak és fitátjainak interferenciája",
        "explanation_en": "Gluten doesn't inhibit hormone secretion directly; results are due to tissue damage and secondary mineral loss.",
        "explanation_hu": "A glutén nem gátolja közvetlenül a hormonszekréciót; az eredmények a szöveti károsodás és a másodlagos ásványianyag-vesztés következményei."
    },
    {
        "id": "tk10_465",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following can trigger acute hypocalcemic tetany in adults? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyek válthatnak ki akut hipokalcémiás tetániát felnőttekben? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Hyperventilation (respiratory alkalosis)",
                "Severe vomiting (metabolic alkalosis / gastric tetany)",
                "Polytransfusion of citrate-treated blood",
                "Acute pancreatitis",
                "Prolonged exposure to UV light"
            ],
            "hu": [
                "Hiperventiláció (respirációs alkalózis)",
                "Súlyos hányás (metabolikus alkalózis / gyomor-tetánia)",
                "Citráttal kezelt vér poli-transzfúziója",
                "Akut pancreatitis",
                "Hosszabb ideig tartó UV-sugárzás"
            ]
        },
        "correct_answer": "Hiperventiláció (respirációs alkalózis), Súlyos hányás (metabolikus alkalózis / gyomor-tetánia), Citráttal kezelt vér poli-transzfúziója, Akut pancreatitis",
        "explanation_en": "UV light facilitates D-vitamin production and would generally help maintain calcium levels.",
        "explanation_hu": "Az UV-fény elősegíti a D-vitamin termelődését, és általában segíti a kalciumszint fenntartását."
    },
    {
        "id": "tk10_466",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which syndrome includes neonatal hypoparathyroidism and thymus deficiency (T lymphopenia)?",
        "question_text_hu": "Melyik szindróma foglalja magában az újszülöttkori hipoparatireózist és a tímusz-hiányt (T-limfopénia)?",
        "options": {
            "en": [
                "DiGeorge syndrome",
                "MEN II syndrome",
                "Addison disease",
                "Hashimoto thyroiditis"
            ],
            "hu": [
                "DiGeorge-szindróma",
                "MEN II szindróma",
                "Addison-kór",
                "Hashimoto-tireoiditisz"
            ]
        },
        "correct_answer": "DiGeorge-szindróma",
        "explanation_en": "It results from the developmental failure of the 3rd and 4th branchial arches.",
        "explanation_hu": "A 3. és 4. kopoltyúív fejlődési zavarából adódik."
    },
    {
        "id": "tk10_467",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why does respiratory alkalosis cause a decrease in ionized calcium?",
        "question_text_hu": "Miért okoz a respirációs alkalózis szabad ionizált kalciumszint-csökkenést?",
        "options": {
            "en": [
                "Proteins release H+ and bind more Ca++",
                "The kidneys excrete all calcium to compensate the pH",
                "CO2 directly binds to calcium in the plasma",
                "Alkaline pH inhibits PTH secretion"
            ],
            "hu": [
                "A fehérjék H+-t adnak le és több Ca++-t kötnek meg",
                "A vesék minden kalciumot kiválasztanak a pH kompenzálására",
                "A CO2 közvetlenül kötődik a kalciumhoz a plazmában",
                "A lúgos pH gátolja a PTH-szekréciót"
            ]
        },
        "correct_answer": "A fehérjék H+-t adnak le és több Ca++-t kötnek meg",
        "explanation_en": "The loss of competitive H+ binding on proteins allows calcium to occupy those sites.",
        "explanation_hu": "A fehérjéken lévő kompetitív H+-kötődés megszűnése lehetővé teszi a kalcium számára ezeknek a helyeknek az elfoglalását."
    },
    {
        "id": "tk10_468",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "In the end-stage of chronic renal failure, which enzyme deficiency leads to secondary Vitamin D deficiency?",
        "question_text_hu": "A krónikus veseelégtelenség végstádiumában melyik enzim hiánya vezet szekunder D-vitamin-hiányhoz?",
        "options": {
            "en": [
                "1-alpha-hydroxylase",
                "Thyroid peroxidase",
                "Glucokinase",
                "Lipase"
            ],
            "hu": [
                "1-alfa-hidroxiláz",
                "Pajzsmirigy-peroxidáz",
                "Glükokináz",
                "Lipáz"
            ]
        },
        "correct_answer": "1-alfa-hidroxiláz",
        "explanation_en": "Widespread parenchymal damage destroys the specialized cells that activate Vitamin D.",
        "explanation_hu": "A kiterjedt parenchimális károsodás elpusztítja a D-vitamint aktiváló specializált sejteket."
    },
    {
        "id": "tk10_469",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "How does hypomagnesemia contribute to hypocalcemia in severe diarrhea?",
        "question_text_hu": "Hogyan járul hozzá a hipomagnezémia a hipokalcémiához súlyos hasmenésben?",
        "options": {
            "en": [
                "It inhibits the bone effect of PTH",
                "It increases phosphate loss in the urine",
                "It triggers the release of calcitonin",
                "It blocks Vitamin D absorption in the stomach"
            ],
            "hu": [
                "Gátolja a PTH csontra gyakorolt hatását",
                "Növeli a foszfátvesztést a vizeletben",
                "Kiváltja a kalcitonin felszabadulását",
                "Blokkolja a D-vitamin felszívódását a gyomorban"
            ]
        },
        "correct_answer": "Gátolja a PTH csontra gyakorolt hatását",
        "explanation_en": "Magnesium deficiency causes a state of pseudohypoparathyroidism (hormone is present but ineffective).",
        "explanation_hu": "A magnéziumhiány pszeudohipoparatireózis állapotát idézi elő (a hormon jelen van, de hatástalan)."
    },
    {
        "id": "tk10_470",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What characterizes 'gastric tetany'?",
        "question_text_hu": "Mi jellemzi a 'gyomor-tetániát'?",
        "options": {
            "en": [
                "Hypocalcemic symptoms due to metabolic alkalosis from vomiting",
                "Severe stomach cramps caused by primary hypercalcemia",
                "Vomiting caused by an insulin-producing tumor",
                "Blockade of the esophagus by a goiter"
            ],
            "hu": [
                "Hányásból eredő metabolikus alkalózis miatti hipokalcémiás tünetek",
                "Primer hiperkalcémia okozta súlyos gyomorgörcsök",
                "Inzulin-termelő daganat okozta hányás",
                "A nyelőcső golyva általi elzáródása"
            ]
        },
        "correct_answer": "Hányásból eredő metabolikus alkalózis miatti hipokalcémiás tünetek",
        "explanation_en": "Loss of gastric HCl causes alkalosis, which suppresses Ca ionization.",
        "explanation_hu": "A gyomorsav (HCl) vesztése alkalózist okoz, ami elnyomja a kalcium ionizációját."
    },
    {
        "id": "tk10_471",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why can bisphosphonates decrease serum calcium so effectively?",
        "question_text_hu": "Miért képesek a biszfoszfonátok ilyen hatékonyan csökkentni a szérum kalciumszintet?",
        "options": {
            "en": [
                "They help incorporate excess calcium back into the bones",
                "They bind directly to ionized calcium in the plasma",
                "They inhibit the production of PTH in the parathyroid glands",
                "They increase calcium loss through the lungs"
            ],
            "hu": [
                "Segítik a felesleges kalcium visszaépülését a csontokba",
                "Közvetlenül az ionizált kalciumhoz kötődnek a plazmában",
                "Gátolják a PTH termelését a mellékpajzsmirigyekben",
                "Növelik a kalciumvesztést a tüdőn keresztül"
            ]
        },
        "correct_answer": "Segítik a felesleges kalcium visszaépülését a csontokba",
        "explanation_en": "By inhibiting osteoclastic resorption, they tip the balance towards mineral deposition.",
        "explanation_hu": "Az oszteoklasztos reszorpció gátlásával az egyensúlyt az ásványianyag-lerakódás irányába billentik."
    },
    {
        "id": "tk10_472",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which part of the body allows the regeneration of parathyroid tissue after surgery?",
        "question_text_hu": "A test melyik része teszi lehetővé a mellékpajzsmirigy-szövet regenerációját műtét után?",
        "options": {
            "en": [
                "The capsule of the glands",
                "The thymus epithelial cells",
                "The follicular cells of the thyroid",
                "The pituitary stalk"
            ],
            "hu": [
                "A mirigyek tokja (kapszulája)",
                "A tímusz hámsejtjei",
                "A pajzsmirigy follikuláris sejtjei",
                "A hipofízis-nyél"
            ]
        },
        "correct_answer": "A mirigyek tokja (kapszulája)",
        "explanation_en": "The text states parathyroids can regenerate even from their capsule if at least one is saved.",
        "explanation_hu": "A szöveg szerint a mellékpajzsmirigyek még a tokjukból is képesek regenerálódni, ha legalább egyet megmentenek."
    },
    {
        "id": "tk10_473",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "In 'Hungry bone syndrome', what triggers the acute hypocalcemia?",
        "question_text_hu": "Az 'éhező csont szindrómában' mi váltja ki az akut hipokalcémiát?",
        "options": {
            "en": [
                "Sudden drop in PTH levels after surgery",
                "Massive discharge of calcitonin from the thyroid",
                "Sudden intake of high amounts of phytates",
                "Destruction of the kidneys by anesthesia"
            ],
            "hu": [
                "A PTH-szint hirtelen leesése műtét után",
                "Nagy mennyiségű kalcitonin kiáramlása a pajzsmirigyből",
                "Nagy mennyiségű fitát hirtelen bevitele",
                "A vesék pusztulása az anesztézia miatt"
            ]
        },
        "correct_answer": "A PTH-szint hirtelen leesése műtét után",
        "explanation_en": "The rapid removal of the drive for bone resorption leads to overwhelming mineral uptake by the 'hungry' skeleton.",
        "explanation_hu": "A csontreszorpció hajtóerejének hirtelen megszűnése a 'kiéhezett' csontváz túlzott ásványianyag-felvételéhez vezet."
    },
    {
        "id": "tk10_474",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the biochemical hallmark of Pseudohypoparathyroidism in terms of hormone levels?",
        "question_text_hu": "Mi a pszeudohipoparatireózis biokémiai jellemzője a hormonszintek tekintetében?",
        "options": {
            "en": [
                "Low Ca++ and high PTH",
                "Low Ca++ and low PTH",
                "High Ca++ and low PTH",
                "Normal Ca++ and low PTH"
            ],
            "hu": [
                "Alacsony Ca++ és magas PTH",
                "Alacsony Ca++ és alacsony PTH",
                "Magas Ca++ és alacsony PTH",
                "Normális Ca++ és alacsony PTH"
            ]
        },
        "correct_answer": "Alacsony Ca++ és magas PTH",
        "explanation_en": "The body tries to compensate for the resistance by overproducing PTH, but targets don't respond.",
        "explanation_hu": "A szervezet a rezisztenciát a PTH túltermelésével igyekszik kompenzálni, de a célszervek nem reagálnak."
    },
    {
        "id": "tk10_475",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Citrate used in blood polytransfusion causes hypocalcemia by which mechanism?",
        "question_text_hu": "Milyen mechanizmussal okoz hipokalcémiát a transzfúzió során használt citrát?",
        "options": {
            "en": [
                "Chelating (binding) free calcium ions",
                "Inhibiting 1-alpha-hydroxylase",
                "Dissolving thyroid C-cells",
                "Triggering respiratory alkalosis"
            ],
            "hu": [
                "A szabad kalcium-ionok kelátképző megkötésével",
                "Az 1-alfa-hidroxiláz gátlásával",
                "A pajzsmirigy C-sejtjeinek feloldásával",
                "Respirációs alkalózis kiváltásával"
            ]
        },
        "correct_answer": "A szabad kalcium-ionok kelátképző megkötésével",
        "explanation_en": "Citrate binds ionized calcium, reducing the physiologically active fraction in the recipient's blood.",
        "explanation_hu": "A citrát megköti az ionizált kalciumot, csökkentve az élettanilag aktív hányadot a recipiens vérében."
    },
    {
        "id": "tk10_476",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Forced diuresis with furosemide treatment increases calcium excretion through the kidneys.",
        "question_text_hu": "A furoszemid-kezeléssel végzett forszírozott diurézis növeli a kalcium-kiválasztást a veséken keresztül.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Loop diuretics inhibit the reabsorption of divalent cations in the Thick Ascending Limb.",
        "explanation_hu": "A kacsdiuretikumok gátolják a kétértékű kationok visszaszívódását a felszálló vastag szegmensben."
    },
    {
        "id": "tk10_477",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Respiratory alkalosis decreases total serum calcium levels while leaving ionized levels unchanged.",
        "question_text_hu": "A respirációs alkalózis csökkenti a teljes szérum kalciumszintet, miközben az ionizált szintet változatlanul hagyja.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Total calcium remains unchanged, but ionized calcium decreases significantly.",
        "explanation_hu": "A teljes kalciumszint változatlan marad, de az ionizált kalciumszint jelentősen csökken."
    },
    {
        "id": "tk10_478",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "In celiac disease, malabsorption of both calcium and Vitamin D can lead to osteoporosis.",
        "question_text_hu": "Lisztérzékenységben (celiac disease) mind a kalcium, mind a D-vitamin felszívódási zavara oszteoporózishoz vezethet.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Long-term mineral and vitamin deficiency compromises bone mineral density.",
        "explanation_hu": "A hosszan tartó ásványianyag- és vitaminhiány rontja a csontsűrűséget."
    },
    {
        "id": "tk10_479",
        "type": "matching",
        "bloom_level": 2,
        "question_text_en": "Match the clinical condition with its primary calcium-related mechanism.",
        "question_text_hu": "Párosítsa a klinikai állapotot annak elsődleges kalciummal kapcsolatos mechanizmusával.",
        "options": {
            "en": [
                "A) Hyperventilation",
                "B) Acute pancreatitis",
                "C) Celiac disease",
                "D) DiGeorge syndrome"
            ],
            "hu": [
                "A) Hiperventiláció",
                "B) Akut pancreatitis",
                "C) Celiac disease",
                "D) DiGeorge-szindróma"
            ]
        },
        "items": {
            "en": [
                "1) Respiratory alkalosis",
                "2) Retroperitoneal fat saponification",
                "3) Vitamin D and Ca malabsorption",
                "4) Congenital parathyroid dysgenesis"
            ],
            "hu": [
                "1) Respirációs alkalózis",
                "2) Retroperitoneális zsírszappanosodás",
                "3) D-vitamin- és Ca-malabszorpció",
                "4) Kongenitális mellékpajzsmirigy-diszgenezis"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Understanding the primary etiology is key to treating hypocalcemia.",
        "explanation_hu": "Az elsődleges etiológia megértése kulcsfontosságú a hipokalcémia kezelésében."
    },
    {
        "id": "tk10_480",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the therapy for hypercalcemia with its primary effect.",
        "question_text_hu": "Párosítsa a hiperkalcémia terápiáját annak elsődleges hatásával.",
        "options": {
            "en": [
                "A) Furosemide",
                "B) Bisphosphonates",
                "C) EDTA",
                "D) Glucocorticoids"
            ],
            "hu": [
                "A) Furoszemid",
                "B) Biszfoszfonátok",
                "C) EDTA",
                "D) Glükokortikoidok"
            ]
        },
        "items": {
            "en": [
                "1) Enhances renal Ca excretion",
                "2) Helps Ca incorporation into bone",
                "3) Chelate-forming Ca binding",
                "4) Suppress tumor-origin cytokine/PTHrP production"
            ],
            "hu": [
                "1) Fokozza a vesén keresztüli Ca-kiválasztást",
                "2) Segíti a Ca beépülését a csontba",
                "3) Kelátképző Ca-megkötés",
                "4) Elnyomják a tumor-eredetű citokin/PTHrP termelést"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Different therapies target different aspects of calcium overflow.",
        "explanation_hu": "A különböző terápiák a kalcium-túlszaporodás különböző aspektusait célozzák meg."
    }
]