[
    {
        "id": "tk10_391",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Glucocorticoids often induce secondary hyperparathyroidism because they both decrease intestinal calcium absorption and increase renal calcium excretion, leading to a compensatory rise in PTH.",
        "question_text_hu": "A glükokortikoidok gyakran szekunder hiperparatireózist indukálnak, mert egyszerre csökkentik a bél kalcium-abszorpcióját és fokozzák a vese kalcium-exkrécióját, ami a PTH kompenzatórikus emelkedéséhez vezet.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The systemic drop in calcium levels triggered by steroids forces the parathyroid glands to overproduce PTH to maintain homeostasis.",
        "explanation_hu": "A szteroidok által kiváltott szisztémás kalciumszint-csökkenés arra kényszeríti a mellékpajzsmirigyeket, hogy a homeosztázis fenntartása érdekében túltermeljék a PTH-t."
    },
    {
        "id": "tk10_392",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Sarcoidosis can cause severe hypercalcemia because the macrophages within sarcoidotic granulomas possess 1-alpha-hydroxylase activity that increases the production of active Vitamin D.",
        "question_text_hu": "A szarkoidózis súlyos hiperkalcémiát okozhat, mert a szarkoidotikus granulómákban lévő makrofágok 1-alfa-hidroxiláz aktivitással rendelkeznek, ami fokozza az aktív D-vitamin termelődését.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "This extra-renal production of calcitriol bypasses the normal physiological feedback control exerted over the kidney.",
        "explanation_hu": "A kalcitriol ezen extrarenális termelése megkerüli a vese felett gyakorolt normális élettani visszacsatolási kontrollt."
    },
    {
        "id": "tk10_393",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Procalcitonin (PCT) is considered a reliable diagnostic indicator for septic conditions because its serum levels significantly elevate in response to severe systemic bacterial infections.",
        "question_text_hu": "A prokalcitonin (PCT) megbízható diagnosztikai indikátornak tekinthető szeptikus állapotokban, mert szérumszintje jelentősen megemelkedik a súlyos szisztémás bakteriális fertőzésekre válaszul.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Unlike mature calcitonin, the prohormone is released into the circulation during broad inflammation, particularly of bacterial origin.",
        "explanation_hu": "A kész kalcitoninnal ellentétben a prohormon kiterjedt gyulladás – különösen bakteriális eredetű – esetén szabadul fel a keringébe."
    },
    {
        "id": "tk10_394",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In pancreatic beta-cells, the closure of ATP-dependent K-channels leads to insulin secretion because the resulting depolarization opens voltage-dependent Ca++ channels, allowing calcium entry into the cytoplasm.",
        "question_text_hu": "A pankreász béta-sejtjeiben az ATP-függő K-csatornák záródása inzulinszekrécióhoz vezet, mert az eredményül kapott depolarizáció kinyitja a feszültségfüggő Ca++-csatornákat, lehetővé téve a kalcium bejutását a citoplazmába.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Intracellular Ca++ increase is the ultimate trigger for the exocytosis of insulin granules via calmodulin-mediated mechanisms.",
        "explanation_hu": "Az intracelluláris Ca++-szint emelkedése az inzulin-granulumok exocitózisának végső kiváltója kalmodulin-közvetített mechanizmusokon keresztül."
    },
    {
        "id": "tk10_395",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Glucocorticoids contribute to osteoporosis by inhibiting bone formation because they directly decrease the proliferation and matrix synthesis of osteoblasts while also reducing the local secretion of IGF-I.",
        "question_text_hu": "A glükokortikoidok hozzájárulnak az oszteoporózis kialakulásához a csontképzés gátlásával, mert közvetlenül csökkentik az oszteoblasztok proliferációját és mátrix-szintézisét, miközben mérséklik a lokális IGF-I szekréciót is.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Steroids impair both the number and function of bone-building cells, leading to a state of low-turnover bone loss.",
        "explanation_hu": "A szteroidok mind a csontépítő sejtek számát, mind funkcióját rontják, ami alacsony fordulatszámú csontvesztéshez vezet."
    },
    {
        "id": "tk10_396",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Tumor patients may develop hypercalcemia even in the absence of bone metastases because certain tumors produce Parathyroid Hormone-related Peptide (PTHrP) which binds to and activates PTH receptors.",
        "question_text_hu": "A daganatos betegeknél csontmetasztázisok hiányában is kialakulhat hiperkalcémia, mert bizonyos tumorok parathormon-rokon peptidet (PTHrP) termelnek, amely kötődik a PTH-receptorokhoz és aktiválja azokat.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Humoral hypercalcemia of malignancy (HHM) is frequently caused by ectopic PTHrP production from squamous cell carcinomas.",
        "explanation_hu": "A malignus humoreális hiperkalcémiát (HHM) gyakran a laphámsejtes karcinómák ektopiás PTHrP-termelése okozza."
    },
    {
        "id": "tk10_397",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Calcitonin is essential for adult calcium homeostasis and must be substituted after complete thyroidectomy because its absence leads to life-threatening hypercalcemia and excessive bone loss.",
        "question_text_hu": "A kalcitonin elengedhetetlen a felnőttkori kalcium-homeosztázishoz, és pótolni kell teljes pajzsmirigy-eltávolítás után, mert hiánya életveszélyes hiperkalcémiához és túlzott csontvesztéshez vezet.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. hamis",
        "explanation_en": "The first statement is false. The lack of calcitonin (e.g., after thyroid removal) causes no significant changes, and substitution is not necessary.",
        "explanation_hu": "Az első állítás hamis. A kalcitonin hiánya (pl. pajzsmirigy-eltávolítás után) nem okoz jelentős elváltozásokat, és pótlása nem szükséges."
    },
    {
        "id": "tk10_398",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Milk-alkali syndrome is becoming less frequent in modern medicine because the transition from antacids and milk-heavy diets to proton pump inhibitors for ulcer treatment has eliminated the primary cause of severe hypercalcemia and nephrocalcinosis.",
        "question_text_hu": "A tej-alkáli szindróma egyre ritkábbá válik a modern orvoslásban, mert a fekélykezelésben az antacidokról és a tej-orientált étrendről a protonpumpa-gátlókra való áttérés megszüntette a súlyos hiperkalcémia és nephrocalcinosis elsődleges okát.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Old ulcer protocols required massive calcium and alkali intake which frequently damaged the kidneys.",
        "explanation_hu": "A régi fekély-protokollok masszív kalcium- és alkáli-bevitelt igényeltek, ami gyakran károsította a veséket."
    },
    {
        "id": "tk10_399",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following hormones or substances elevate serum calcium levels? Select all that apply.",
        "question_text_hu": "Az alábbi hormonok vagy anyagok közül melyek emelik a szérum kalciumszintet? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Parathyroid Hormone (PTH)",
                "Vitamin D3 (Calcitriol)",
                "Growth Hormone (GH)",
                "Calcitonin",
                "Glucocorticoids"
            ],
            "hu": [
                "Parathormon (PTH)",
                "D3-vitamin (kalcitriol)",
                "Növekedési hormon (GH)",
                "Kalcitonin",
                "Glükokortikoidok"
            ]
        },
        "correct_answer": "Parathormon (PTH), D3-vitamin (kalcitriol), Növekedési hormon (GH)",
        "explanation_en": "Calcitonin and glucocorticoids lower serum calcium levels.",
        "explanation_hu": "A kalcitonin és a glükokortikoidok csökkentik a szérum kalciumszintet."
    },
    {
        "id": "tk10_400",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "By what mechanisms do glucocorticoids (steroids) suppress serum calcium and damage bone tissue? Select all that apply.",
        "question_text_hu": "Milyen mechanizmusokkal csökkentik a glükokortikoidok (szteroidok) a szérum kalciumszintet és károsítják a csontszövetet? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Decreased Ca++ absorption from the bowel",
                "Increased Ca++ excretion in the kidney",
                "Direct inhibition of osteoblast proliferation",
                "Enhanced collagenase activity and matrix degradation",
                "Stimulation of 1-alpha-hydroxylase in the kidney"
            ],
            "hu": [
                "Csökkent kalcium-felszívódás a bélből",
                "Fokozott kalcium-exkréció a vesében",
                "Az oszteoblaszt-proliferáció közvetlen gátlása",
                "Fokozott kollagenáz-aktivitás és mátrix-degradáció",
                "Az 1-alfa-hidroxiláz serkentése a vesében"
            ]
        },
        "correct_answer": "Csökkent kalcium-felszívódás a bélből, Fokozott kalcium-exkréció a vesében, Az oszteoblaszt-proliferáció közvetlen gátlása, Fokozott kollagenáz-aktivitás és mátrix-degradáció",
        "explanation_en": "Glucocorticoids actually block 1-alpha-hydroxylase, leading to lower active Vitamin D levels.",
        "explanation_hu": "A glükokortikoidok valójában blokkolják az 1-alfa-hidroxilázt, ami alacsonyabb aktív D-vitamin-szinthez vezet."
    },
    {
        "id": "tk10_401",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following are intracellular effects of Calcium ions? Select all that apply.",
        "question_text_hu": "Melyek az alábbiak közül a kalcium-ionok intracelluláris hatásai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Regulating the production and secretion of neurotransmitters",
                "Acting as a second messenger for hormones like ADH and ACTH",
                "Influencing enzyme activities (e.g., PFK, isocitrate dehydrogenase)",
                "Stabilizing blood coagulation factors (II, VII, IX, X)",
                "Potentiating catecholamine effects on cardiac contractility"
            ],
            "hu": [
                "A neurotranszmitterek termelésének és szekréciójának szabályozása",
                "Másodlagos hírvivőként való működés olyan hormonoknál, mint az ADH és az ACTH",
                "Enzimaktivitások befolyásolása (pl. PFK, izocitrát-dehidrogenáz)",
                "A véralvadási faktorok (II, VII, IX, X) stabilizálása",
                "A katekolaminok szív kontraktilitására gyakorolt hatásának potencírozása"
            ]
        },
        "correct_answer": "A neurotranszmitterek termelésének és szekréciójának szabályozása, Másodlagos hírvivőként való működés olyan hormonoknál, mint az ADH és az ACTH, Enzimaktivitások befolyásolása (pl. PFK, izocitrát-dehidrogenáz)",
        "explanation_en": "Coagulation and contractility are considered extracellular/membranous effects of the Ca gradient.",
        "explanation_hu": "Az alvadás és a kontraktilitás a Ca-gradiens extracelluláris/membrán hatásainak számítanak."
    },
    {
        "id": "tk10_402",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What substances can tumors produce that lead to hypercalcemia? Select all that apply.",
        "question_text_hu": "Milyen anyagokat termelhetnek a daganatok, amik hiperkalcémiához vezetnek? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "PTH-related peptide (PTHrP)",
                "Interleukin-1 (IL-1)",
                "Tumor Necrosis Factor (TNF)",
                "Prostaglandin E (PGE)",
                "Calcitonin"
            ],
            "hu": [
                "Parathormon-rokon peptid (PTHrP)",
                "Interleukin-1 (IL-1)",
                "Tumornekrózis-faktor (TNF)",
                "Prosztaglandin E (PGE)",
                "Kalcitonin"
            ]
        },
        "correct_answer": "Parathormon-rokon peptid (PTHrP), Interleukin-1 (IL-1), Tumornekrózis-faktor (TNF), Prosztaglandin E (PGE)",
        "explanation_en": "Salmon calcitonin is used to lower calcium; tumors producing it (medullary) don't typically cause hypercalcemia via this peptide.",
        "explanation_hu": "A lazac-kalcitonint a kalciumszint csökkentésére használják; a daganatok (medulláris), amik ezt termelik, jellemzően nem okoznak hiperkalcémiát ezen peptid révén."
    },
    {
        "id": "tk10_403",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following can lead to enhanced calcium absorption from the gut and hypercalcemia? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyek vezethetnek fokozott bélrendszeri kalcium-felszívódáshoz és hiperkalcémiához? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "D-hypervitaminosis (excessive supplementation)",
                "Sarcoidosis (macrophage 1-alpha-hydroxylase activity)",
                "Milk-alkali syndrome",
                "Salmon calcitonin therapy",
                "Primary hypoparathyroidism"
            ],
            "hu": [
                "D-hipervitaminózis (túlzott pótlás)",
                "Szarkoidózis (makrofág 1-alfa-hidroxiláz aktivitás)",
                "Tej-alkáli szindróma",
                "Lazac-kalcitonin terápia",
                "Primer hipoparatireózis"
            ]
        },
        "correct_answer": "D-hipervitaminózis (túlzott pótlás), Szarkoidózis (makrofág 1-alfa-hidroxiláz aktivitás), Tej-alkáli szindróma",
        "explanation_en": "Milk-alkali combines intake with alkalosis; sarcoidosis increases active Vit D. Hypoparathyroidism lowers calcium.",
        "explanation_hu": "A tej-alkáli szituáció a bevitelt alkalózissal ötvözi; a szarkoidózis növeli az aktív D-vitamint. A hipoparatireózis csökkenti a kalciumszintet."
    },
    {
        "id": "tk10_404",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which hormone's primary stimulus for secretion is high serum calcium levels?",
        "question_text_hu": "Melyik hormon szekréciójának elsődleges ingere a magas szérum kalciumszint?",
        "options": {
            "en": [
                "Calcitonin",
                "PTH",
                "Glucocorticoids",
                "Growth Hormone"
            ],
            "hu": [
                "Kalcitonin",
                "PTH",
                "Glükokortikoidok",
                "Növekedési hormon"
            ]
        },
        "correct_answer": "Kalcitonin",
        "explanation_en": "Calcitonin acts to lower serum calcium, hence it is triggered by hypercalcemia.",
        "explanation_hu": "A kalcitonin a szérum kalciumszintjének csökkentésére hat, ezért a hiperkalcémia váltja ki."
    },
    {
        "id": "tk10_405",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Procalcitonin (PCT) is used as a reliable marker for which condition?",
        "question_text_hu": "A prokalcitonint (PCT) melyik állapot megbízható markerének tekintik?",
        "options": {
            "en": [
                "Sepsis",
                "Osteoporosis",
                "Iodine deficiency",
                "Hypopituitarism"
            ],
            "hu": [
                "Szepszis",
                "Oszteoporózis",
                "Jódhiány",
                "Hipopituitarizmus"
            ]
        },
        "correct_answer": "Szepszis",
        "explanation_en": "PCT levels rise significantly in systemic bacterial infections/sepsis.",
        "explanation_hu": "A PCT-szint jelentősen megemelkedik szisztémás bakteriális fertőzésekben/szepszisben."
    },
    {
        "id": "tk10_406",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "How do salmon calcitonin pharmacological doses affect Paget's disease patients?",
        "question_text_hu": "Hogyan hatnak a lazac-kalcitonin farmakológiai dózisai a Paget-kóros betegekre?",
        "options": {
            "en": [
                "By inhibiting osteoclast activity",
                "By stimulating osteoblast proliferation",
                "By blocking TRH receptors",
                "By increasing intestinal calcium absorption"
            ],
            "hu": [
                "Az oszteoklaszt-aktivitás gátlásával",
                "Az oszteoblaszt-proliferáció serkentésével",
                "A TRH-receptorok blokkolásával",
                "A bélből történő kalcium-felszívódás fokozásával"
            ]
        },
        "correct_answer": "Az oszteoklaszt-aktivitás gátlásával",
        "explanation_en": "Calcitonin directly inhibits the cells responsible for bone resorption.",
        "explanation_hu": "A kalcitonin közvetlenül gátolja a csontreszorpcióért felelős sejteket."
    },
    {
        "id": "tk10_407",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which glucose-induced event in pancreatic beta-cells triggers the potential change needed for insulin release?",
        "question_text_hu": "Melyik glükóz-indukált esemény váltja ki a pankreász béta-sejtjeiben az inzulinfelszabaduláshoz szükséges potenciálváltozást?",
        "options": {
            "en": [
                "ATP production closes K-channels leading to depolarization",
                "Calmodulin binding opens Na-channels in the nucleus",
                "T3-mediated inhibition of glucokinase",
                "Opening of the K-channels by increased cAMP"
            ],
            "hu": [
                "Az ATP-termelés zárja a K-csatornákat, ami depolarizációhoz vezet",
                "A kalmodulin-kötődés Na-csatornákat nyit meg a sejtmagban",
                "A glükokináz T3-közvetített gátlása",
                "K-csatornák megnyitása a megnövekedett cAMP által"
            ]
        },
        "correct_answer": "Az ATP-termelés zárja a K-csatornákat, ami depolarizációhoz vezet",
        "explanation_en": "Glucose metabolism raises ATP, which specifically closes Kir6.2 (ATP-dependent K+ channels).",
        "explanation_hu": "A glükóz-anyagcsere növeli az ATP-szintet, ami specifikusan zárja a Kir6.2 (ATP-függő K+-csatornákat)."
    },
    {
        "id": "tk10_408",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why can hypocalcemia-related coagulation failure 'never happen in a living human'?",
        "question_text_hu": "Miért nem fordulhat elő soha 'élő emberben' kalciumhiányhoz köthető alvadási zavar?",
        "options": {
            "en": [
                "Because neuromuscular excitability failure would kill the patient long before reaching such low Ca levels",
                "Because Vitamin K can substitute for calcium in the clotting cascade",
                "Because intracellular calcium stores are always sufficient for clotting",
                "Because the liver bypasses calcium requirement during severe deficiency"
            ],
            "hu": [
                "Mert a neuromuszkuláris ingerlékenység zavara jóval hamarabb megölné a beteget, mint ilyen alacsony Ca-szintnél",
                "Mert a K-vitamin helyettesítheti a kalciumot az alvadási kaszkádban",
                "Mert az intracelluláris kalciumraktárak mindig elégségesek az alvadáshoz",
                "Mert a máj súlyos hiány esetén megkerüli a kalcium-szükségletet"
            ]
        },
        "correct_answer": "Mert a neuromuszkuláris ingerlékenység zavara jóval hamarabb megölné a beteget, mint ilyen alacsony Ca-szintnél",
        "explanation_en": "Lethal tetany or arrhythmia occurs at calcium levels that are still high enough for coagulation enzymes to function.",
        "explanation_hu": "Halálos tetánia vagy aritmiák már olyan kalciumszinteknél is fellépnek, amik még bőven eleget tesznek az alvadási enzimek működésének."
    },
    {
        "id": "tk10_409",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the primary effect of PTHrP (PTH-related peptide) in tumor patients?",
        "question_text_hu": "Mi a PTHrP (parathormon-rokon peptid) elsődleges hatása daganatos betegekben?",
        "options": {
            "en": [
                "It binds to PTH receptors and elevates serum calcium",
                "It inhibits Vitamin D synthesis in the liver",
                "It induces severe hypocalcemia by activating C-cells",
                "It blocks the intestinal absorption of phosphate"
            ],
            "hu": [
                "PTH-receptorokhoz kötődik és emeli a szérum kalciumszintet",
                "Gátolja a D-vitamin szintézisét a májban",
                "Súlyos hipokalcémiát vált ki a C-sejtek aktiválásával",
                "Gátolja a foszfát bélrendszeri felszívódását"
            ]
        },
        "correct_answer": "PTH-receptorokhoz kötődik és emeli a szérum kalciumszintet",
        "explanation_en": "PTHrP mimics the hormone action on bone and kidney, leading to malignant hypercalcemia.",
        "explanation_hu": "A PTHrP utánozza a hormon hatását a csontokon és a vesében, ami malignus hiperkalcémiához vezet."
    },
    {
        "id": "tk10_410",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "In what way can sarcoidosis lead to hypercalcemia?",
        "question_text_hu": "Milyen módon vezethet a szarkoidózis hiperkalcémiához?",
        "options": {
            "en": [
                "Granuloma macrophages possess 1-alpha-hydroxylase activity",
                "High TSH levels stimulate the parathyroid glands",
                "Iodine deficiency in the granulomas triggers PTH release",
                "The nodes produce large amounts of osteocalcin"
            ],
            "hu": [
                "A granulóma-makrofágok 1-alfa-hidroxiláz aktivitással bírnak",
                "A magas TSH-szint serkenti a mellékpajzsmirigyeket",
                "A granulómákban fellépő jódhiány kiváltja a PTH-felszabadulást",
                "A csomók nagy mennyiségű oszteokalcint termelnek"
            ]
        },
        "correct_answer": "A granulóma-makrofágok 1-alfa-hidroxiláz aktivitással bírnak",
        "explanation_en": "Macrophages in sarcoidotic tissue inappropriately activate Vitamin D to calcitriol.",
        "explanation_hu": "A szarkoidotikus szövet makrofágjai nem megfelelő módon aktiválják a D-vitamint kalcitriollá."
    },
    {
        "id": "tk10_411",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Milk-alkali syndrome was historically a side effect of treating which disease?",
        "question_text_hu": "A tej-alkáli szindróma történetileg melyik betegség kezelésének mellékhatása volt?",
        "options": {
            "en": [
                "Peptic ulcer",
                "Cretinism",
                "Diabetes mellitus",
                "Hyperthyroidism"
            ],
            "hu": [
                "Peptikus fekély",
                "Kretinizmus",
                "Diabetes mellitus",
                "Hipertireózis"
            ]
        },
        "correct_answer": "Peptikus fekély",
        "explanation_en": "High intake of milk (calcium) and alkaline antacids created this toxic combination before PPIs existed.",
        "explanation_hu": "A nagy mennyiségű tej (kalcium) és alkalikus antacidok bevitele hozta létre ezt a toxikus kombinációt a PPI-k megjelenése előtt."
    },
    {
        "id": "tk10_412",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the normal relationship between calcium and neuromuscular excitability?",
        "question_text_hu": "Mi a normális kapcsolat a kalcium és a neuromuszkuláris ingerlékenység között?",
        "options": {
            "en": [
                "Low extracellular Ca++ increases neuromuscular excitability",
                "Low extracellular Ca++ decreases neuromuscular excitability",
                "High extracellular Ca++ always causes tetany",
                "Calcium concentration has no effect on nerves"
            ],
            "hu": [
                "Az alacsony extracelluláris Ca++ fokozza a neuromuszkuláris ingerlékenységet",
                "Az alacsony extracelluláris Ca++ csökkenti a neuromuszkuláris ingerlékenységet",
                "A magas extracelluláris Ca++ mindig tetániát okoz",
                "A kalcium-koncentrációnak nincs hatása az idegekre"
            ]
        },
        "correct_answer": "Az alacsony extracelluláris Ca++ fokozza a neuromuszkuláris ingerlékenységet",
        "explanation_en": "Hypocalcemia lowers the threshold for action potential firing (depolarization), leading to tetany.",
        "explanation_hu": "A hipokalcémia csökkenti az akciós potenciál kiváltásának küszöbét (depolarizáció), mi tetániához vezet."
    },
    {
        "id": "tk10_413",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Why can Vitamin D3 inhibit tumor growth in certain cases?",
        "question_text_hu": "Miért tudja a D3-vitamin bizonyos esetekben gátolni a tumornövekedést?",
        "options": {
            "en": [
                "Because receptors are present in many tissues and it can inhibit cell-proliferation",
                "Because it directly destroys metabolic enzymes inside the tumor",
                "Because it prevents the tumor from taking up glucose",
                "Because it increases intracellular potassium to toxic levels"
            ],
            "hu": [
                "Mert receptorai számos szövetben jelen vannak, és gátolni tudja a sejtproliferációt",
                "Mert közvetlenül elpusztítja a tumoron belüli anyagcsere-enzimeket",
                "Mert megakadályozza, hogy a tumor glükózt vegyen fel",
                "Mert toxikus szintre emeli az intracelluláris káliumot"
            ]
        },
        "correct_answer": "Mert receptorai számos szövetben jelen vannak, és gátolni tudja a sejtproliferációt",
        "explanation_en": "Vitamin D signaling has anti-proliferative effects in various non-classical tissues.",
        "explanation_hu": "A D-vitamin szignálút anti-proliferatív hatással bír különböző nem klasszikus szövetekben."
    },
    {
        "id": "tk10_414",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "How does Growth Hormone (GH) influence serum calcium?",
        "question_text_hu": "Hogyan befolyásolja a növekedési hormon (GH) a szérum kalciumszintet?",
        "options": {
            "en": [
                "It elevates serum Ca++ by increasing intestinal absorption",
                "It lowers serum Ca++ by promoting renal loss",
                "It has no effect on mineral metabolism",
                "It only acts via the parathyroid glands"
            ],
            "hu": [
                "Emeli a szérum Ca++-szintet a bélrendszeri felszívódás fokozásával",
                "Csökkenti a szérum Ca++-szintet a vesén keresztüli veszteség növelésével",
                "Nincs hatása az ásványianyag-anyagcserére",
                "Kizárólag a mellékpajzsmirigyeken keresztül hat"
            ]
        },
        "correct_answer": "Emeli a szérum Ca++-szintet a bélrendszeri felszívódás fokozásával",
        "explanation_en": "GH supports net calcium gain to facilitate bone growth.",
        "explanation_hu": "A GH támogatja a nettó kalcium-felvételt a csontnövekedés elősegítése érdekében."
    },
    {
        "id": "tk10_415",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Intracellular Ca++ concentration is how many times lower than plasma levels?",
        "question_text_hu": "Az intracelluláris Ca++-koncentráció hányszor alacsonyabb a plazmaszintnél?",
        "options": {
            "en": [
                "10,000-fold (10^4)",
                "10-fold",
                "1,000,000-fold",
                "It is equal"
            ],
            "hu": [
                "10 000-szeres (10^4)",
                "10-szeres",
                "1 000 000-szoros",
                "Megegyeznek"
            ]
        },
        "correct_answer": "10 000-szeres (10^4)",
        "explanation_en": "The extreme gradient is maintained to allow Ca++ to function as a sensitive signaling molecule.",
        "explanation_hu": "A rendkívüli gradienst azért tartják fenn, hogy a Ca++ érzékeny szignálmolekulaként működhessen."
    },
    {
        "id": "tk10_416",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Vitamin-D indirectly enhances bone formation by providing free bone surface needed for regeneration.",
        "question_text_hu": "A D-vitamin közvetve fokozza a csontképződést azáltal, hogy a regenerációhoz szükséges szabad csontfelületet biztosít.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Initial resorption by Vitamin D 'cleans' old bone to allow for new remodeling.",
        "explanation_hu": "A D-vitamin általi kezdeti reszorpció 'megtisztítja' a régi csontot, hogy lehetővé tegye az újabb remodellinget."
    },
    {
        "id": "tk10_417",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Glucocorticoids increase serum calcium levels by enhancing gut absorption.",
        "question_text_hu": "A glükokortikoidok növelik a szérum kalciumszintet a bélrendszeri felszívódás fokozásával.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Glucocorticoids suppress calcium levels and inhibit absorption.",
        "explanation_hu": "A glükokortikoidok csökkentik a kalciumszintet és gátolják a felszívódást."
    },
    {
        "id": "tk10_418",
        "type": "true_false",
        "bloom_level": 3,
        "question_text_en": "In septic conditions, procalcitonin (PCT) levels typically remain undisturbed.",
        "question_text_hu": "Szeptikus állapotokban a prokalcitonin (PCT) szintje jellemzően változatlan marad.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "PCT is a widely used marker precisely because it rises during sepsis.",
        "explanation_hu": "A PCT széles körben használt marker pont azért, mert megemelkedik szepszis során."
    },
    {
        "id": "tk10_419",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the factor with its effect on serum calcium levels.",
        "question_text_hu": "Párosítsa a tényezőt a szérum kalciumszintre gyakorolt hatásával.",
        "options": {
            "en": [
                "A) PTHrP",
                "B) Glucocorticoids",
                "C) Growth Hormone",
                "D) Calcitonin"
            ],
            "hu": [
                "A) PTHrP",
                "B) Glükokortikoidok",
                "C) Növekedési hormon",
                "D) Kalcitonin"
            ]
        },
        "items": {
            "en": [
                "1) Elevation",
                "2) Suppression",
                "3) Elevation",
                "4) Suppression"
            ],
            "hu": [
                "1) Emelés",
                "2) Csökkentés",
                "3) Emelés",
                "4) Csökkentés"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Understanding the net mineral effect of various hormones is key to clinical endocrinology.",
        "explanation_hu": "A különböző hormonok nettó ásványianyag-hatásának megértése kulcsfontosságú a klinikai endokrinológiában."
    },
    {
        "id": "tk10_420",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the cause of hypercalcemia with its pathomechanism.",
        "question_text_hu": "Párosítsa a hiperkalcémia okát annak patomechanizmusával.",
        "options": {
            "en": [
                "A) Milk-alkali syndrome",
                "B) Sarcoidosis",
                "C) Squamous cell carcinoma",
                "D) D-hypervitaminosis"
            ],
            "hu": [
                "A) Tej-alkáli szindróma",
                "B) Szarkoidózis",
                "C) Laphámsejtes karcinóma",
                "D) D-hipervitaminózis"
            ]
        },
        "items": {
            "en": [
                "1) High intake + Alkalosis",
                "2) Ectopic Vitamin D activation",
                "3) Humoral PTHrP production",
                "4) Excessive dietary absorption"
            ],
            "hu": [
                "1) Magas bevitel + alkalózis",
                "2) Ektopiás D-vitamin aktiváció",
                "3) Humorális PTHrP-termelés",
                "4) Túlzott étrendi felszívódás"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Hypercalcemia has diverse etiologies ranging from nutritional to paraneoplastic.",
        "explanation_hu": "A hiperkalcémiának sokféle etiológiája van, a táplálkozásitól a paraneopláziásig."
    }
]