[
    {
        "id": "tk10_31",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Phosphoinositide-specific phospholipase-C (PI-PLC) activation triggers intracellular calcium release because it cleaves PIP2 into IP3 which subsequently interacts with the endoplasmic reticulum.",
        "question_text_hu": "A foszfoinozitid-specifikus foszfolipáz-C (PI-PLC) aktiválása intracelluláris kalcium-felszabadulást vált ki, mert a PIP2-t IP3-ra hasítja, amely ezt követően interakcióba lép az endoplazmatikus retikulummal.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "PI-PLC cleaves PIP2 to produce IP3 and DAG. IP3 then opens calcium channels in the endoplasmic reticulum.",
        "explanation_hu": "A PI-PLC a PIP2-t IP3-ra és DAG-ra hasítja. Az IP3 ezután kalciumcsatornákat nyit meg az endoplazmatikus retikulumban."
    },
    {
        "id": "tk10_32",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "The signali generated by G-protein associated receptors eventually fades over time because the GTP bound to the G-protein is hydrolyzed to GDP by the protein's own GTP-ase activity.",
        "question_text_hu": "A G-protein asszociált receptorok által generált szignál idővel elhalványul, mert a G-proteinhez kötött GTP-t a fehérje saját GTP-áz aktivitása GDP-vé hidrolizálja.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "G-protein signaling is self-terminating via the intrinsic GTPase activity of the alpha subunit.",
        "explanation_hu": "A G-protein szignáltranszdukció önszabályozó módon fejeződik be az alfa-alegység intrinsic GTPáz aktivitása révén."
    },
    {
        "id": "tk10_33",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Steroid and thyroid hormones are identified as ligand-induced transcription factors because they exert their primary action by directly influencing gene transcription after binding to intracellular receptors.",
        "question_text_hu": "A szteroid- és pajzsmirigyhormonok ligand-indukált transzkripciós faktorként azonosíthatók, mert elsődleges hatásukat a géntranszkripció közvetlen befolyásolásával fejtik ki az intracelluláris receptorokhoz való kötődés után.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "These hormone-receptor complexes bind to DNA response elements to promote or inhibit mRNA synthesis.",
        "explanation_hu": "Ezek a hormon-receptor komplexek a DNS válaszelemeihez kötődnek, hogy serkentsék vagy gátolják az mRNS-szintézist."
    },
    {
        "id": "tk10_34",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "The same concentration of a hormone can elicit distinct cellular responses at different times because signal transduction can be modified by up-regulation, down-regulation, or simultaneous alternate hormonal actions.",
        "question_text_hu": "Ugyanazon hormonkoncentráció különböző időpontokban eltérő sejtes válaszokat válthat ki, mert a szignáltranszdukciót az up-reguláció, down-reguláció vagy egyidejű váltakozó hormonális hatások módosíthatják.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The biological response depends not just on hormone levels but on receptor density and the intracellular signaling context.",
        "explanation_hu": "A biológiai válasz nemcsak a hormonszintektől, hanem a receptorsűrűségtől és az intracelluláris szignálkörnyezettől is függ."
    },
    {
        "id": "tk10_35",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Glucocorticoid receptors preferentially form homodimers to bind to DNA because members of the steroid-thyroid superfamily use zinc-finger structures to stabilize their loops by chelating a zinc ion.",
        "question_text_hu": "A glükokortikoid receptorok preferenciálisan homodimereket alkotnak a DNS-hez való kötődéshez, mert a szteroid-pajzsmirigy szupercsalád tagjai cink-ujj szerkezeteket használnak hurokjaik stabilizálására cinkion kelátképzésével.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + nem magyarázat",
        "explanation_en": "Both statements are true, but the use of zinc-fingers for DNA binding is a general feature of the superfamily and does not specifically explain why glucocorticoids prefer homodimerization.",
        "explanation_hu": "Mindkét állítás igaz, de a cink-ujjak DNS-kötésre való használata a szupercsalád általános jellemzője, és nem magyarázza meg konkrétan, miért preferálják a glükokortikoidok a homodimerizációt."
    },
    {
        "id": "tk10_36",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Thyroid receptors frequently bind to SRE sequences as heterodimers because their most typical partner in this process is the retinoid X receptor (RXR).",
        "question_text_hu": "A pajzsmirigy-receptorok gyakran heterodimerként kötődnek az SRE szekvenciákhoz, mert ebben a folyamatban a legtipikusabb partnerük a retinoid X receptor (RXR).",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Thyroid receptors (TR) form functional heterodimers with RXR to enhance DNA binding and transcriptional control.",
        "explanation_hu": "A pajzsmirigy-receptorok (TR) funkcionális heterodimereket alkotnak az RXR-rel a DNS-kötés és a transzkripciós kontroll fokozása érdekében."
    },
    {
        "id": "tk10_37",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following molecules act as components or second messengers in the PI-PLC signaling pathway? Select all that apply.",
        "question_text_hu": "Melyek az alábbi molekulák közül a PI-PLC szignálút összetevői vagy másodlagos hírvivői? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "IP3 (Inositol-triphosphate)",
                "DAG (Diacylglycerol)",
                "PIP2 (Phosphatidyl-inositol 4,5-bis-phosphate)",
                "Ca++",
                "cAMP",
                "Calmodulin"
            ],
            "hu": [
                "IP3 (Inozitol-trifoszfát)",
                "DAG (Diacil-glicerin)",
                "PIP2 (Foszfatidil-inozitol-4,5-biszfoszfát)",
                "Ca++",
                "cAMP",
                "Kalmodulin"
            ]
        },
        "correct_answer": "IP3 (Inozitol-trifoszfát), DAG (Diacil-glicerin), PIP2 (Foszfatidil-inozitol-4,5-biszfoszfát), Ca++, Kalmodulin",
        "explanation_en": "cAMP is a second messenger of the adenyl-cyclase pathway, not the PI-PLC pathway.",
        "explanation_hu": "A cAMP az adenil-cikláz útvonal másodlagos hírvivője, nem a PI-PLC útvonalé."
    },
    {
        "id": "tk10_38",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following receptors belong to the steroid-thyroid hormone receptor superfamily? Select all that apply.",
        "question_text_hu": "Melyek az alábbi receptorok közül a szteroid-pajzsmirigy hormon receptor szupercsalád tagjai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Vitamin D receptor (VDR)",
                "Retinoid receptors (RAR & RXR)",
                "Glucocorticoid receptor",
                "Insulin receptor",
                "Growth factor receptors",
                "Progesterone receptor"
            ],
            "hu": [
                "D-vitamin receptor (VDR)",
                "Retinoid receptorok (RAR és RXR)",
                "Glükokortikoid receptor",
                "Inzulin receptor",
                "Növekedési faktor receptorok",
                "Progeszteron receptor"
            ]
        },
        "correct_answer": "D-vitamin receptor (VDR), Retinoid receptorok (RAR és RXR), Glükokortikoid receptor, Progeszteron receptor",
        "explanation_en": "Insulin and growth factor receptors are transmembrane tyrosine kinases, not members of the nuclear receptor superfamily.",
        "explanation_hu": "Az inzulin- és növekedésifaktor-receptorok transzmembrán tirozin-kinázok, nem a nukleáris receptor szupercsalád tagjai."
    },
    {
        "id": "tk10_39",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which events are part of the activation of transmembrane tyrosine kinase receptors (e.g., insulin receptor)? Select all that apply.",
        "question_text_hu": "Mely események részei a transzmembrán tirozin-kináz receptorok (pl. inzulin receptor) aktiválásának? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Hormone binding",
                "Dimerization",
                "Auto-phosphorylation",
                "Phosphorylation of substrates",
                "Translocation of the receptor into the nucleus",
                "GTP-GDP exchange"
            ],
            "hu": [
                "Hormonkötés",
                "Dimerizáció",
                "Autofoszforiláció",
                "Szubsztrátok foszforilációja",
                "A receptor sejtmagba történő transzlokációja",
                "GTP-GDP csere"
            ]
        },
        "correct_answer": "Hormonkötés, Dimerizáció, Autofoszforiláció, Szubsztrátok foszforilációja",
        "explanation_en": "Tyrosine kinase receptors do not translocate to the nucleus and do not use G-protein exchange (GTP-GDP).",
        "explanation_hu": "A tirozin-kináz receptorok nem transzlokálódnak a sejtmagba, és nem használnak G-protein cserét (GTP-GDP)."
    },
    {
        "id": "tk10_40",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following are examples of non-genomic steroid hormone effects? Select all that apply.",
        "question_text_hu": "Melyek az alábbiak közül a szteroidhormonok nem-genomiális hatásai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Changes of membrane potential",
                "Quick restructuring of the cytoskeleton",
                "Progesterone effect on GABA receptors",
                "Ligand-induced transcription factor activation",
                "Zinc-finger binding to SRE sequences"
            ],
            "hu": [
                "Membránpotenciál változásai",
                "A citoszkeleton gyors átstrukturálása",
                "A progeszteron hatása a GABA-receptorokra",
                "Ligand-indukált transzkripciós faktor aktiválása",
                "Cink-ujj kötődése SRE szekvenciákhoz"
            ]
        },
        "correct_answer": "Membránpotenciál változásai, A citoszkeleton gyors átstrukturálása, A progeszteron hatása a GABA-receptorokra",
        "explanation_en": "Ligand-induced transcription factors and SRE binding are genomic effects involving gene expression.",
        "explanation_hu": "A ligand-indukált transzkripciós faktorok és az SRE-kötés génexpresszióval járó genomiális hatások."
    },
    {
        "id": "tk10_41",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following conditions can cause insufficient hormone action despite normal hormone levels? Select all that apply.",
        "question_text_hu": "Melyek az alábbi feltételek közül okozhatnak elégtelen hormonhatást a normális hormonszint ellenére? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Injured receptors",
                "Antagonists bound to receptors",
                "Reduced tissue responsiveness (e.g. histotoxic hypoxia)",
                "Increased receptor sensitivity",
                "Pulsatile hormone release"
            ],
            "hu": [
                "Sérült receptorok",
                "Receptorokhoz kötött antagonisták",
                "Csökkent szöveti válaszkészség (pl. hisztotoxikus hipoxia)",
                "Fokozott receptor-érzékenység",
                "Pulzáló hormonfelszabadulás"
            ]
        },
        "correct_answer": "Sérült receptorok, Receptorokhoz kötött antagonisták, Csökkent szöveti válaszkészség (pl. hisztotoxikus hipoxia)",
        "explanation_en": "Increased sensitivity would enhance hormone action, and pulsatile release is often a normal physiological pattern.",
        "explanation_hu": "A fokozott érzékenység fokozná a hormonhatást, a pulzáló felszabadulás pedig gyakran normális élettani mintázat."
    },
    {
        "id": "tk10_42",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which enzyme cascade is typically initiated by hormones binding to receptors for things like insulin or growth factors?",
        "question_text_hu": "Melyik enzimkaszkádot indítják el jellemzően az olyan receptorokhoz kötődő hormonok, mint az inzulin vagy a növekedési faktorok?",
        "options": {
            "en": [
                "Intracellular tyrosine kinase cascade",
                "Adenyl-cyclase cascade",
                "Phospholipase-C cascade",
                "Zinc-finger translocation cascade"
            ],
            "hu": [
                "Intracelluláris tirozin-kináz kaszkád",
                "Adenil-cikláz kaszkád",
                "Foszfolipáz-C kaszkád",
                "Cink-ujj transzlokációs kaszkád"
            ]
        },
        "correct_answer": "Intracelluláris tirozin-kináz kaszkád",
        "explanation_en": "Insulin and growth factor receptors use internal tyrosine kinase activity.",
        "explanation_hu": "Az inzulin- és növekedésifaktor-receptorok belső tirozin-kináz aktivitást használnak."
    },
    {
        "id": "tk10_43",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "The second messenger cGMP (cyclic Guanosine Monophosphate) directly activates which of the following?",
        "question_text_hu": "A cGMP (ciklikus guanozin-monofoszfát) másodlagos hírvivő közvetlenül mit aktivál az alábbiak közül?",
        "options": {
            "en": [
                "Protein kinase-G (PK-G)",
                "Protein kinase-A (PK-A)",
                "Protein kinase-C (PK-C)",
                "Calmodulin-sensitive kinases"
            ],
            "hu": [
                "Protein-kináz G (PK-G)",
                "Protein-kináz A (PK-A)",
                "Protein-kináz C (PK-C)",
                "Kalmodulin-érzékeny kinázok"
            ]
        },
        "correct_answer": "Protein-kináz G (PK-G)",
        "explanation_en": "cGMP activates PK-G, while cAMP activates PK-A and DAG activates PK-C.",
        "explanation_hu": "A cGMP a PK-G-t, míg a cAMP a PK-A-t, a DAG pedig a PK-C-t aktiválja."
    },
    {
        "id": "tk10_44",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the specific membrane component cleaved by PI-PLC to generate the second messengers IP3 and DAG?",
        "question_text_hu": "Mi az a specifikus membránösszetevő, amelyet a PI-PLC hasít fel az IP3 és DAG másodlagos hírvivők generálása érdekében?",
        "options": {
            "en": [
                "Phosphatidyl-inositol 4,5-bis-phosphate (PIP2)",
                "Adenosine triphosphate (ATP)",
                "Guanosine triphosphate (GTP)",
                "Phosphatidyl-serine"
            ],
            "hu": [
                "Foszfatidil-inozitol-4,5-biszfoszfát (PIP2)",
                "Adenozin-trifoszfát (ATP)",
                "Guanozin-trifoszfát (GTP)",
                "Foszfatidil-szerin"
            ]
        },
        "correct_answer": "Foszfatidil-inozitol-4,5-biszfoszfát (PIP2)",
        "explanation_en": "PIP2 is the substrate for PI-PLC in the generation of IP3 and DAG.",
        "explanation_hu": "A PIP2 a PI-PLC szubsztrátja az IP3 és a DAG előállításában."
    },
    {
        "id": "tk10_45",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following transcription factors is promoted by pituitary trophormones via cAMP-mediated phosphorylation to result in glandular hypertrophy?",
        "question_text_hu": "Melyik transzkripciós faktort serkentik a hipofízis trofhormonjai cAMP-közvetített foszforiláció útján, ami mirigyes hipertrófiához vezet?",
        "options": {
            "en": [
                "CREB (cAMP Response Element Binding protein)",
                "SRE (Steroid Response Element)",
                "RXR (Retinoid X Receptor)",
                "Calmodulin"
            ],
            "hu": [
                "CREB (cAMP Response Element Binding protein)",
                "SRE (Steroid Response Element)",
                "RXR (Retinoid X Receptor)",
                "Kalmodulin"
            ]
        },
        "correct_answer": "CREB (cAMP Response Element Binding protein)",
        "explanation_en": "CREB phosphorylation is the classical pathway for trophormone-induced growth in glands like the thyroid or adrenal cortex.",
        "explanation_hu": "A CREB foszforilációja a trofhormon-indukált növekedés klasszikus útja az olyan mirigyekben, mint a pajzsmirigy vagy a mellékvesekéreg."
    },
    {
        "id": "tk10_46",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Renal diabetes insipidus serves as a clinical example of insufficient hormone action caused by what?",
        "question_text_hu": "A renális diabetes insipidus milyen okból eredő elégtelen hormonhatás klinikai példája?",
        "options": {
            "en": [
                "Injured ADH receptors",
                "Antibody antagonists",
                "Reduced ADH production",
                "Auto-phosphorylation failure"
            ],
            "hu": [
                "Sérült ADH receptorok",
                "Antitest antagonisták",
                "Csökkent ADH termelés",
                "Autofoszforilációs hiba"
            ]
        },
        "correct_answer": "Sérült ADH receptorok",
        "explanation_en": "In renal diabetes insipidus, the kidney cannot respond to ADH because the receptors are non-functional.",
        "explanation_hu": "Renális diabetes insipidusban a vese nem tud válaszolni az ADH-ra, mert a receptorok nem működnek."
    },
    {
        "id": "tk10_47",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Continuous exposure to GnRH (Gonadotropin Releasing Hormone) leads to which of the following outcomes?",
        "question_text_hu": "A GnRH-val (gonadotropin-felszabadító hormon) való folyamatos expozíció az alábbi eredmények közül melyikhez vezet?",
        "options": {
            "en": [
                "Suppression of LH and FSH release",
                "Increased pulsatile LH production",
                "Stimulation of follicle maturation",
                "Hypertrophy of the pituitary gland"
            ],
            "hu": [
                "Az LH és FSH felszabadulás gátlása",
                "Fokozott pulzáló LH-termelés",
                "A tüszőérés serkentése",
                "A hipofízis hipertrófiája"
            ]
        },
        "correct_answer": "Az LH és FSH felszabadulás gátlása",
        "explanation_en": "Contrastingly, normal pulsatile GnRH stimulates LH and FSH release.",
        "explanation_hu": "Ezzel szemben a normális pulzáló GnRH stimulálja az LH és FSH felszabadulását."
    },
    {
        "id": "tk10_48",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the structural feature of nuclear receptors that allows them to chelate a zinc ion and bind specifically to DNA?",
        "question_text_hu": "Mi a nukleáris receptorok azon szerkezeti jellemzője, amely lehetővé teszi számukra a cinkion kelátképzését és a DNS-hez való specifikus kötődést?",
        "options": {
            "en": [
                "Double zinc-finger structure",
                "Heterotrimeric G-protein subunit",
                "Tyrosine kinase domain",
                "Leucine zipper motif"
            ],
            "hu": [
                "Kettős cink-ujj szerkezet",
                "Heterotrimer G-protein alegység",
                "Tirozin-kináz domén",
                "Leucin-cipzár motívum"
            ]
        },
        "correct_answer": "Kettős cink-ujj szerkezet",
        "explanation_en": "Zinc fingers are DNA-binding motifs stabilized by zinc ions chelating with cysteine residues.",
        "explanation_hu": "A cink-ujjak DNS-kötő motívumok, amelyeket a cisztein-maradékokkal kelátot képező cinkionok stabilizálnak."
    },
    {
        "id": "tk10_49",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which of the following second messengers is responsible for releasing Ca++ from the endoplasmic reticulum into the cytoplasm?",
        "question_text_hu": "Melyik másodlagos hírvivő felelős a Ca++ endoplazmatikus retikulumból a citoplazmába történő felszabadításáért?",
        "options": {
            "en": [
                "IP3 (Inositol-triphosphate)",
                "DAG (Diacylglycerol)",
                "cAMP",
                "cGMP"
            ],
            "hu": [
                "IP3 (Inozitol-trifoszfát)",
                "DAG (Diacil-glicerin)",
                "cAMP",
                "cGMP"
            ]
        },
        "correct_answer": "IP3 (Inozitol-trifoszfát)",
        "explanation_en": "IP3 binds to receptors on the ER to trigger calcium release.",
        "explanation_hu": "Az IP3 az ER receptoraihoz kötődik, kiváltva a kalcium-felszabadulást."
    },
    {
        "id": "tk10_50",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the biological result of a hormone binding to a homodimerizing nuclear receptor like the glucocorticoid receptor?",
        "question_text_hu": "Mi a biológiai eredménye annak, ha egy hormon homodimerizálódó nukleáris receptorhoz, például a glükokortikoid receptorhoz kötődik?",
        "options": {
            "en": [
                "Translocation into the nucleus and gene transcription",
                "Immediate membrane potential oscillation",
                "Extracellular albumin degradation",
                "Suppression of pulsatile GnRH release"
            ],
            "hu": [
                "Transzlokáció a sejtmagba és géntranszkripció",
                "Azonnali membránpotenciál-oszcilláció",
                "Extracelluláris albumindegradáció",
                "A pulzáló GnRH-felszabadulás gátlása"
            ]
        },
        "correct_answer": "Transzlokáció a sejtmagba és géntranszkripció",
        "explanation_en": "Glucocorticoid receptors move from the cytoplasm to the nucleus to act as transcription factors.",
        "explanation_hu": "A glükokortikoid receptorok a citoplazmából a sejtmagba vándorolnak, hogy transzkripciós faktorként hatjanak."
    },
    {
        "id": "tk10_51",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Both cAMP and cGMP pathways utilize protein kinases to mediate their intracellular effects.",
        "question_text_hu": "Mind a cAMP-, mind a cGMP-útvonal fehérje-kinázokat használ intracelluláris hatásainak közvetítésére.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "cAMP activates PK-A and cGMP activates PK-G.",
        "explanation_hu": "A cAMP a PK-A-t, a cGMP pedig a PK-G-t aktiválja."
    },
    {
        "id": "tk10_52",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The IP3/DAG pathway primarily results in the inactivation of intracellular enzymes.",
        "question_text_hu": "Az IP3/DAG útvonal elsősorban az intracelluláris enzimek inaktiválását eredményezi.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "This pathway usually activates kinases (PKC) and calmodulin-sensitive enzymes.",
        "explanation_hu": "Ez az útvonal általában kinázokat (PKC) és kalmodulin-érzékeny enzimeket aktivál."
    },
    {
        "id": "tk10_53",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Thyroid hormones bind to their receptors directly within the nucleus of the target cell.",
        "question_text_hu": "A pajzsmirigyhormonok közvetlenül a célsejt magjában kötődnek receptoraikhoz.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Contrastingly, glucocorticoid receptors translocate from the cytoplasm after binding.",
        "explanation_hu": "Ezzel szemben a glükokortikoid receptorok a kötődés után vándorolnak át a citoplazmából."
    },
    {
        "id": "tk10_54",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "A decrease in tissue responsiveness can result in insufficient hormone effects even if levels and receptors are normal.",
        "question_text_hu": "A szöveti válaszkészség csökkenése elégtelen hormonhatást eredményezhet akkor is, ha a szintek és a receptorok normálisak.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "The text cites histotoxic hypoxia as an example of this phenomenon.",
        "explanation_hu": "A szöveg a hisztotoxikus hipoxiát említi példaként erre a jelenségre."
    },
    {
        "id": "tk10_55",
        "type": "matching",
        "bloom_level": 2,
        "question_text_en": "Match the second messenger with its corresponding protein kinase activator.",
        "question_text_hu": "Párosítsa a másodlagos hírvivőt a megfelelő fehérje-kináz aktivátorával.",
        "options": {
            "en": [
                "A) cAMP",
                "B) cGMP",
                "C) DAG",
                "D) IP3"
            ],
            "hu": [
                "A) cAMP",
                "B) cGMP",
                "C) DAG",
                "D) IP3"
            ]
        },
        "items": {
            "en": [
                "1) PK-A",
                "2) PK-G",
                "3) PK-C",
                "4) Indirect via Ca++ release"
            ],
            "hu": [
                "1) PK-A",
                "2) PK-G",
                "3) PK-C",
                "4) Indirekt a Ca++ felszabaduláson keresztül"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Each messenger has a specific primary target kinase.",
        "explanation_hu": "Minden hírvivőnek van egy specifikus elsődleges célkináza."
    },
    {
        "id": "tk10_56",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical condition with the pathophysiological cause mentioned in the text.",
        "question_text_hu": "Párosítsa a klinikai állapotot a szövegben említett patofiziológiai okkal.",
        "options": {
            "en": [
                "A) Renal diabetes insipidus",
                "B) Insulin-resistance",
                "C) Vitamin-D resistant rickets",
                "D) Hepatic failure"
            ],
            "hu": [
                "A) Renális diabetes insipidus",
                "B) Inzulinrezisztencia",
                "C) D-vitamin-rezisztens angolkór",
                "D) Májelégtelenség"
            ]
        },
        "items": {
            "en": [
                "1) Injured ADH receptor",
                "2) Injured insulin receptor",
                "3) Injured VDR receptor",
                "4) Antagonists (false transmitters) bound to receptors"
            ],
            "hu": [
                "1) Sérült ADH receptor",
                "2) Sérült inzulin receptor",
                "3) Sérült VDR receptor",
                "4) Receptorokhoz kötött antagonisták (hamis transzmitterek)"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Clinical manifestations often arise from receptor failure at the target tissue.",
        "explanation_hu": "A klinikai megnyilvánulások gyakran a célszövet receptorelégtelenségéből adódnak."
    },
    {
        "id": "tk10_57",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the receptor family with its typical signal transduction mechanism.",
        "question_text_hu": "Párosítsa a receptorcsaládot a jellemző szignáltranszdukciós mechanizmusával.",
        "options": {
            "en": [
                "A) G-protein assoc.",
                "B) Tyrosine kinase",
                "C) Steroid-Thyroid superfamily",
                "D) Ion channels"
            ],
            "hu": [
                "A) G-protein asszoc.",
                "B) Tirozin-kináz",
                "C) Szteroid-pajzsmirigy szupercsalád",
                "D) Ioncsatornák"
            ]
        },
        "items": {
            "en": [
                "1) Nucleotide exchange and second messengers",
                "2) Auto-phosphorylation and substrate dimerization",
                "3) Ligand-induced transcription in the nucleus",
                "4) Direct change in membrane permeability"
            ],
            "hu": [
                "1) Nukleotid-csere és másodlagos hírvivők",
                "2) Autofoszforiláció és szubsztrát-dimerizáció",
                "3) Ligand-indukált transzkripció a sejtmagban",
                "4) A membránpermeabilitás közvetlen megváltozása"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Transduction pathways differ fundamentally between surface and nuclear receptors.",
        "explanation_hu": "A transzdukciós utak alapvetően különböznek a felszíni és a nukleáris receptorok között."
    },
    {
        "id": "tk10_58",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "The complex formed by four calcium ions and a specific binding protein that activates certain kinases is known as:",
        "question_text_hu": "A négy kalciumion és egy specifikus kötőfehérje által alkotott komplexet, amely bizonyos kinázokat aktivál, úgy ismerik mint:",
        "options": {
            "en": [
                "(Ca++)4-calmodulin (CaM)",
                "cAMP-Response Element",
                "Zinc-finger chelate",
                "Heterotrimeric GTP-protein"
            ],
            "hu": [
                "(Ca++)4-kalmodulin (CaM)",
                "cAMP-válaszelem",
                "Cink-ujj kelát",
                "Heterotrimer GTP-protein"
            ]
        },
        "correct_answer": "(Ca++)4-kalmodulin (CaM)",
        "explanation_en": "Calmodulin senses calcium levels to mediate cellular responses.",
        "explanation_hu": "A kalmodulin érzékeli a kalciumszinteket a sejtes válaszok közvetítése érdekében."
    },
    {
        "id": "tk10_59",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What specifically allows a ligand-induced transcription factor to bind to the 'Steroid Response Element' (SRE) of DNA?",
        "question_text_hu": "Mi teszi lehetővé konkrétan egy ligand-indukált transzkripciós faktor számára, hogy a DNS 'szteroid válaszeleméhez' (SRE) kötődjön?",
        "options": {
            "en": [
                "Dimerization and zinc-finger loops",
                "GDP to GTP exchange",
                "Binding to extracellular transport proteins",
                "Pulsatile release of the ligand"
            ],
            "hu": [
                "Dimerizáció és cink-ujj hurkok",
                "GDP-GTP csere",
                "Extracelluláris transzportfehérjékhez való kötődés",
                "A ligand pulzáló felszabadulása"
            ]
        },
        "correct_answer": "Dimerizáció és cink-ujj hurkok",
        "explanation_en": "Active nuclear receptors usually dimerize to interact correctly with tandem repeat sequences on the DNA.",
        "explanation_hu": "Az aktív nukleáris receptorok általában dimerizálódnak, hogy megfelelően interakcióba lépjenek a DNS tandem ismétlődő szekvenciáival."
    },
    {
        "id": "tk10_60",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Clinical administration of GnRH in a continuous fashion fails to stimulate follicle development because the normal hormonal activation of the pituitary-gonadal axis specifically requires pulsatile patterns of the releasing hormone.",
        "question_text_hu": "A GnRH folyamatos klinikai alkalmazása nem stimulálja a tüszőfejlődést, mert a hipofízis-gonád tengely normális hormonális aktiválása kifejezetten a felszabadító hormon pulzáló mintázatát igényli.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Pulsatility is essential for maintaining receptor sensitivity and signaling rhythm in many endocrine axes.",
        "explanation_hu": "A pulzativitás alapvető fontosságú a receptor-érzékenység és a szignálritmus fenntartásához számos endokrin tengelyben."
    }
]