[
    {
        "id": "tk10_841",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Metformin can normalize both metabolic and gonadal dysfunction in Polycystic Ovary Syndrome (PCOS), because hyperinsulinemia and insulin resistance play a central roles in the pathogenesis of this syndrome.",
        "question_text_hu": "A metformin normalizálhatja mind az anyagcsere-, mind az ivarmirigy-diszfunkciót policisztás ovárium szindrómában (PCOS), mert a hiperinzulinémia és az inzulinrezisztencia központi szerepet játszik ezen szindróma patogenezisében.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "By lowering insulin levels, metformin reduces the abnormal insulin-mediated stimulation of ovarian androgen production.",
        "explanation_hu": "Az inzulinszint csökkentésével a metformin mérsékli a petefészek androgéntermelésének kóros, inzulin-mediált stimulációját."
    },
    {
        "id": "tk10_842",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In Polycystic Ovary Syndrome (PCOS), LH levels may become persistently elevated, because the absence of post-ovulatory progesterone production leads to a lack of negative feedback inhibition on LH secretion.",
        "question_text_hu": "Policisztás ovárium szindrómában (PCOS) az LH-szint tartósan emelkedetté válhat, mert az ovuláció utáni progeszterontermelés hiánya miatt elmarad az LH-szekréció negatív visszacsatolásos gátlása.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Cyclic progesterone is required to suppress LH; chronic anovulation prevents this inhibitory signal.",
        "explanation_hu": "Ciklikus progeszteronra van szükség az LH gátlásához; a krónikus anovuláció megakadályozza ezt a gátló jelzést."
    },
    {
        "id": "tk10_843",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Morris syndrome (complete androgen insensitivity) presents with a female phenotype despite a 46,XY genotype, because the absence of functional androgen receptors prevents the development of male internal and external genitalia.",
        "question_text_hu": "A Morris-szindróma (teljes androgén-inszenzitivitás) női fenotípussal jelentkezik a 46,XY genotípus ellenére, mert a funkcionális androgénreceptorok hiánya megakadályozza a férfi belső és külső nemiszervrendszer fejlődését.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "In the absence of androgen signaling, the body follows the default female developmental pathway despite high testosterone levels.",
        "explanation_hu": "Androgén jelátvitel hiányában a szervezet az alapértelmezett női fejlődési utat követi a magas tesztoszteronszint ellenére."
    },
    {
        "id": "tk10_844",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Kallmann syndrome is characterized by hypogonadotropic hypogonadism associated with anosmia, because the hypothalamic GnRH-secreting neurons fail to migrate from the olfactory placode during embryonic development.",
        "question_text_hu": "A Kallmann-szindrómát hipogonadotrop hipogonadizmus és anozmia (szaglásvesztés) társulása jellemzi, mert a hipotalamikus GnRH-szekretáló neuronok az embrionális fejlődés során nem vándorolnak át az olfaktoros plakódból.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The shared developmental migration pathway of olfactory and GnRH neurons explains the association with impaired sense of smell.",
        "explanation_hu": "Az olfaktoros és a GnRH-neuronok közös fejlődési vándorlási útvonala magyarázza a szaglászavarral való társulást."
    },
    {
        "id": "tk10_845",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In male patients with liver cirrhosis, secondary hypogonadism often develops, because impaired hepatic clearance of estrogen precursors leads to their accumulation and subsequent suppression of pituitary gonadotropin release.",
        "question_text_hu": "Májcirrózisban szenvedő férfiaknál gyakran szekunder hipogonadizmus alakul ki, mert az öztrogén-prekurzorok károsodott hepatikus clearance-e azok felhalmozódásához és a hipofízis gonadotropin-felszabadulásának gátlásához vezet.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Hyperestrogenism in liver failure provides negative feedback that suppresses the hypothalamic-pituitary-testicular axis.",
        "explanation_hu": "Májelégtelenségben a hiperösztrogenizmus olyan negatív visszacsatolást biztosít, amely gátolja a hipotalamusz-hipofízis-herék tengelyt."
    },
    {
        "id": "tk10_846",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Facial hirsutism can occur in postmenopausal women, because the elevated levels of gonadotropins (LH/FSH) resulting from ovarian failure can stimulate residual androgen production in the ovarian interstitial (theca-like) cells.",
        "question_text_hu": "Arci hirzutizmus előfordulhat posztmenopauzás nőkben, mert a petefészek-elégtelenség miatti emelkedett gonadotropinszint (LH/FSH) stimulálhatja a maradék androgéntermelést a petefészek intersticiális (theca-szerű) sejtjeiben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "While follicles are depleted, the ovarian stroma remains responsive to extreme LH signals by producing androgens.",
        "explanation_hu": "Míg a tüszők kimerülnek, a petefészek stómája az extrém LH-jelzésre androgéntermeléssel válaszolhat."
    },
    {
        "id": "tk10_847",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Klinefelter syndrome leads to a eunuchoid habitus with tall stature and disproportionately long extremities, because high FSH and LH levels directly accelerate the linear growth of the long bones.",
        "question_text_hu": "A Klinefelter-szindróma eunuchoid alkathoz, magas termethez és aránytalanul hosszú végtagokhoz vezet, mert a magas FSH- és LH-szint közvetlenül gyorsítja a hosszú csöves csontok hosszirányú növekedését.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. igaz, a II. hamis",
        "explanation_en": "The tall stature is due to the lack of testosterone-derived estrogen, which results in delayed closure of the epiphyseal growth plates.",
        "explanation_hu": "A magas termet a tesztoszteronból származó öztrogén hiányának köszönhető, ami az epifízisfúgák késleltetett záródását eredményezi."
    },
    {
        "id": "tk10_848",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Primary ovarian failure is characterized by significantly elevated levels of LH and FSH, because the insufficiency of ovarian steroids and inhibin removes the negative feedback on the pituitary and hypothalamus.",
        "question_text_hu": "A primer petefészek-elégtelenséget jelentősen emelkedett LH- és FSH-szint jellemzi, mert a petefészek-szteroidok és az inhibin hiánya megszünteti a hipofízisre és a hipotalamuszra gyakorolt negatív visszacsatolást.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "This regulatory pattern (hypergonadotropic hypogonadism) is typical when the primary defect lies in the gonad itself.",
        "explanation_hu": "Ez a szabályozási mintázat (hipergonadotrop hipogonadizmus) jellemző, amikor az elsődleges hiba magában az ivarmirigyben van."
    },
    {
        "id": "tk10_849",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which clinical findings are characteristic features of Polycystic Ovary Syndrome (PCOS)? Select all that apply.",
        "question_text_hu": "Mely klinikai leletek a policisztás ovárium szindróma (PCOS) jellemző vonásai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Anovulation and subfertility",
                "Elevated LH levels with a high LH/FSH ratio",
                "Ovarian enlargement and hyperthecosis",
                "Symptoms of androgen excess (e.g. hirsutism, acne)",
                "Insulin resistance and hyperinsulinemia"
            ],
            "hu": [
                "Anovuláció és szubfertilitás",
                "Emelkedett LH-szint magas LH/FSH aránnyal",
                "Petefészek-megnagyobbodás és hiperthecosis",
                "Androgén-túlsúly tünetei (pl. hirzutizmus, akne)",
                "Inzulinrezisztencia és hiperinzulinémia"
            ]
        },
        "correct_answer": "Anovuláció és szubfertilitás, Emelkedett LH-szint magas LH/FSH aránnyal, Petefészek-megnagyobbodás és hiperthecosis, Androgén-túlsúly tünetei (pl. hirzutizmus, akne), Inzulinrezisztencia és hiperinzulinémia",
        "explanation_en": "PCOS is a complex endocrine-metabolic disorder involving dysfunctional communication between the HPG axis and the ovary.",
        "explanation_hu": "A PCOS egy összetett endokrin-metabolikus zavar, amely a HPG-tengely és a petefészek közötti hibás kommunikációval jár."
    },
    {
        "id": "tk10_850",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which factors can trigger secondary amenorrhea or anovulatory cycles? Select all that apply.",
        "question_text_hu": "Mely tényezők válthatnak ki szekunder amenorrheát vagy anovulációs ciklusokat? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Severe psychological stress or extreme weight loss",
                "Uncontrolled hypothyroidism",
                "Prolactinoma (hyperprolactinemia)",
                "Liver cirrhosis with impaired hormone metabolism",
                "Excessive exercise/training"
            ],
            "hu": [
                "Súlyos pszichológiai stressz vagy extrém súlyvesztés",
                "Kezeletlen pajzsmirigy-alulműködés",
                "Prolaktinóma (hiperprolaktinémia)",
                "Májcirrózis károsodott hormonmetabolizmussal",
                "Túlzott fizikai megterhelés/sport"
            ]
        },
        "correct_answer": "Súlyos pszichológiai stressz vagy extrém súlyvesztés, Kezeletlen pajzsmirigy-alulműködés, Prolaktinóma (hiperprolaktinémia), Májcirrózis károsodott hormonmetabolizmussal, Túlzott fizikai megterhelés/sport",
        "explanation_en": "Systemic disruptions can interfere with the pulsatile release of GnRH and subsequent gonadotropin secretion.",
        "explanation_hu": "A szisztémás zavarok megzavarhatják a GnRH pulzatilis felszabadulását és az azt követő gonadotropin-szekréciót."
    },
    {
        "id": "tk10_851",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which symptoms and conditions commonly accompany the transition into menopause? Select all that apply.",
        "question_text_hu": "Mely tünetek és állapotok kísérik gyakran a menopauzába való átmenetet? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Vasomotor symptoms (hot flashes, night sweats)",
                "Accelerated loss of bone density (osteoporosis)",
                "Urogenital atrophy and dryness",
                "Mood changes and irritability",
                "Decreased cardiovascular risk"
            ],
            "hu": [
                "Vazomotoros tünetek (hőhullámok, éjszakai izzadás)",
                "Gyorsult csontsűrűség-vesztés (oszteoporózis)",
                "Urogenitális atrófia és szárazság",
                "Hangulatváltozások és ingerlékenység",
                "Csökkent kardiovaszkuláris kockázat"
            ]
        },
        "correct_answer": "Vazomotoros tünetek (hőhullámok, éjszakai izzadás), Gyorsult csontsűrűség-vesztés (oszteoporózis), Urogenitális atrófia és szárazság, Hangulatváltozások és ingerlékenység",
        "explanation_en": "The loss of estrogen's protective and regulatory effects leads to diverse somatic and psychological manifestations.",
        "explanation_hu": "Az öztrogén védő és szabályozó hatásainak elvesztése különféle szomatikus és pszichológiai manifesztációkhoz vezet."
    },
    {
        "id": "tk10_852",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which features are characteristically found in Klinefelter syndrome? Select all that apply.",
        "question_text_hu": "Mely jellemzők találhatóak meg jellegzetesen Klinefelter-szindrómában? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "47,XXY karyotype",
                "Atrophic, firm testicles and azoospermia",
                "Gynecomastia",
                "Elevated serum gonadotropins (LH/FSH)",
                "Reduced body hair and eunuchoid stature"
            ],
            "hu": [
                "47,XXY kariotípus",
                "Atrófiás, feszes herék és azoospermia",
                "Gynecomastia",
                "Emelkedett szérum gonadotropok (LH/FSH)",
                "Ritkult testszőrzet és eunuchoid alkat"
            ]
        },
        "correct_answer": "47,XXY kariotípus, Atrófiás, feszes herék és azoospermia, Gynecomastia, Emelkedett szérum gonadotropok (LH/FSH), Ritkult testszőrzet és eunuchoid alkat",
        "explanation_en": "The syndrome is a classic example of primary hypergonadotropic hypogonadism in males.",
        "explanation_hu": "A szindróma a primer hipergonadotrop hipogonadizmus klasszikus példája férfiaknál."
    },
    {
        "id": "tk10_853",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What are recognized risks or considerations associated with estrogen-only replacement therapy? Select all that apply.",
        "question_text_hu": "Melyek az ösztrogén-monoterápiával kapcsolatos elismert kockázatok vagy megfontolások? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Increased risk of venous thromboembolism (VTE)",
                "Potential for worsening hypertension",
                "Increased risk of endometrial hyperplasia/carcinoma (if uterus is present)",
                "Increased risk of breast cancer in certain regimens",
                "Significant reduction in height"
            ],
            "hu": [
                "A vénás tromboembólia (VTE) fokozott kockázata",
                "A hipertónia súlyosbodásának lehetősége",
                "Az endometrium-hiperplázia/karcinóma fokozott kockázata (ha a méh jelen van)",
                "Az emlőrák fokozott kockázata bizonyos adagolásoknál",
                "Jelentős testmagasság-csökkenés"
            ]
        },
        "correct_answer": "A vénás tromboembólia (VTE) fokozott kockázata, A hipertónia súlyosbodásának lehetősége, Az endometrium-hiperplázia/karcinóma fokozott kockázata (ha a méh jelen van), Az emlőrák fokozott kockázata bizonyos adagolásoknál",
        "explanation_en": "Hormone replacement therapy (HRT) requires individual risk-benefit assessment due to these complications.",
        "explanation_hu": "A hormonpótló terápia (HRT) ezen mellékhatások miatt egyéni kockázat-haszon mérlegelést igényel."
    },
    {
        "id": "tk10_854",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which clinical entity is defined by a 46,XY genotype presenting with a female phenotype due to complete androgen receptor resistance?",
        "question_text_hu": "Melyik klinikai entitás jellemezhető 46,XY genotípussal és női fenotípussal a teljes androgénreceptor-rezisztencia miatt?",
        "options": {
            "en": [
                "Morris syndrome (Testicular feminization)",
                "Klinefelter syndrome",
                "Kallmann syndrome",
                "Stein-Leventhal syndrome"
            ],
            "hu": [
                "Morris-szindróma (Testicularis feminizáció)",
                "Klinefelter-szindróma",
                "Kallmann-szindróma",
                "Stein-Leventhal-szindróma"
            ]
        },
        "correct_answer": "Morris-szindróma (Testicularis feminizáció)",
        "explanation_en": "Although testes produce androgens, target tissues cannot respond, leading to external female development.",
        "explanation_hu": "Bár a herék termelnek androgéneket, az alapvető szövetek nem tudnak válaszolni, ami külső női nemiszervek kifejlődéséhez vezet."
    },
    {
        "id": "tk10_855",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the pathophysiological significance of hyperinsulinemia in PCOS patients?",
        "question_text_hu": "Mi a hiperinzulinémia patofiziológiai jelentősége PCOS-ben szenvedő betegeknél?",
        "options": {
            "en": [
                "It acts as a co-gonadotropin that stimulates excessive ovarian androgen production",
                "It directly triggers the formation of ovarian cysts",
                "It prevents the liver from synthesizing steroid hormones",
                "It converts estrogens into testosterone within the bloodstream"
            ],
            "hu": [
                "Társhormonként hat, amely serkenti a petefészek túlzott androgéntermelését",
                "Közvetlenül kiváltja a petefészek-ciszták képződését",
                "Megakadályozza a májat a szteroidhormonok szintézisében",
                "Az öztrogéneket tesztoszteronná alakítja a véráramban"
            ]
        },
        "correct_answer": "Társhormonként hat, amely serkenti a petefészek túlzott androgéntermelését",
        "explanation_en": "Insulin sensitizes theca cells to LH, amplifying the production of androgens in the ovary.",
        "explanation_hu": "Az inzulin érzékenyíti a theca-sejteket az LH-ra, felerősítve az androgéntermelést a petefészekben."
    },
    {
        "id": "tk10_856",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the typical average age for the onset of menopause in the developed world?",
        "question_text_hu": "Mennyi a menopauza kezdetének tipikus átlagéletkora a fejlett világban?",
        "options": {
            "en": [
                "Approximately 51-52 years",
                "Around 40 years",
                "Around 60 years",
                "Approximately 45 years"
            ],
            "hu": [
                "Körülbelül 51-52 év",
                "40 év körül",
                "60 év körül",
                "Körülbelül 45 év"
            ]
        },
        "correct_answer": "Körülbelül 51-52 év",
        "explanation_en": "The biological transition usually occurs between the ages of 45 and 55, with the average being 51.",
        "explanation_hu": "A biológiai átmenet általában 45 és 55 éves kor között következik be, az átlag 51 év."
    },
    {
        "id": "tk10_857",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which clinical condition is typically characterized by primary hypogonadism associated with anosmia (loss of smell) due to defective GnRH neuron migration?",
        "question_text_hu": "Melyik klinikai állapotra jellemző a primer hipogonadizmus és az anozmia (szaglásvesztés) társulása a GnRH-neuronok vándorlási zavara miatt?",
        "options": {
            "en": [
                "Kallmann syndrome",
                "Turner syndrome",
                "Conn syndrome",
                "McCune-Albright syndrome"
            ],
            "hu": [
                "Kallmann-szindróma",
                "Turner-szindróma",
                "Conn-szindróma",
                "McCune-Albright-szindróma"
            ]
        },
        "correct_answer": "Kallmann-szindróma",
        "explanation_en": "Kallmann syndrome is a form of hypogonadotropic hypogonadism with distinct neurological features.",
        "explanation_hu": "A Kallmann-szindróma a hipogonadotrop hipogonadizmus egy formája, jellegzetes neurológiai vonásokkal."
    },
    {
        "id": "tk10_858",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the expected outcome if a genetic male (46,XY) fetus lacks functional testicular development or androgen signaling in utero?",
        "question_text_hu": "Mi a várható kimenetel, ha egy genetikailag férfi (46,XY) magzatnál hiányzik a funkcionális herék fejlődése vagy az androgén jelátvitel in utero?",
        "options": {
            "en": [
                "The phenotype will develop according to the default female pathway",
                "The fetus will develop ambiguous genitalia with both sets of internal ducts",
                "Spontaneous abortion will occur in the first trimester",
                "The phenotype will remain male but with severe micro-phallus"
            ],
            "hu": [
                "A fenotípus az alapértelmezett női útvonal szerint fejlődik ki",
                "A magzat mindkét típusú belső vezetékkel kétértelmű nemiszerveket fejleszt",
                "Spontán abortusz következik be az első trimeszterben",
                "A fenotípus férfi marad, de súlyos mikrophallusszal"
            ]
        },
        "correct_answer": "A fenotípus az alapértelmezett női útvonal szerint fejlődik ki",
        "explanation_en": "In humans, female development is the passive default; active androgen signaling is required for masculinization.",
        "explanation_hu": "Emberben a női fejlődés a passzív alapértelmezett útvonal; az androgén jelátvitel szükséges a maszkulinizációhoz."
    },
    {
        "id": "tk10_859",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which hormone, produced by the testicular Sertoli cells, exerts negative feedback primary on the pituitary production of FSH?",
        "question_text_hu": "Melyik, a herék Sertoli-sejtjei által termelt hormon fejt ki negatív visszacsatolást elsődlegesen az FSH hipofízeális termelésére?",
        "options": {
            "en": [
                "Inhibin",
                "Testosterone",
                "Aldosterone",
                "Anti-Müllerian hormone (AMH)"
            ],
            "hu": [
                "Inhibin",
                "Tesztoszteron",
                "Aldoszteron",
                "Anti-Müllerian hormon (AMH)"
            ]
        },
        "correct_answer": "Inhibin",
        "explanation_en": "Inhibin B provides selective feedback inhibition only on FSH, whereas testosterone inhibitis both LH and FSH.",
        "explanation_hu": "Az inhibin B szelektív visszacsatolásos gátlást biztosít csak az FSH-ra, míg a tesztoszteron gátolja az LH-t és az FSH-t is."
    },
    {
        "id": "tk10_860",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the morphological basis for the term 'polycystic' in Polycystic Ovary Syndrome (PCOS)?",
        "question_text_hu": "Mi a morfológiai alapja a 'policisztás' kifejezésnek a policisztás ovárium szindrómában (PCOS)?",
        "options": {
            "en": [
                "The presence of numerous small, arrested subcapsular follicles",
                "The development of large, benign endometriotic cysts",
                "The cystic transformation of the fallopian tubes",
                "Multiple fluid-filled neoplastic growths within the ovarian stroma"
            ],
            "hu": [
                "Számos kisméretű, megrekedt szubkapszuláris tüsző jelenléte",
                "Nagy, jóindulatú endometrioticus ciszták kialakulása",
                "A petevezetékek cisztás átalakulása",
                "Többszörös, folyadékkal telt daganatos növedékek a petefészek-sztrómában"
            ]
        },
        "correct_answer": "Számos kisméretű, megrekedt szubkapszuláris tüsző jelenléte",
        "explanation_en": "The 'cysts' are actually immature follicles that fail to ovulate due to the abnormal hormonal environment.",
        "explanation_hu": "A 'ciszták' valójában éretlen tüszők, amelyek a kóros hormonális környezet miatt nem jutnak el az ovulációig."
    },
    {
        "id": "tk10_861",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Secondary oligo-amenorrhea can be triggered by severe psychological stress or extreme nutritional deficiency (e.g., cachexia).",
        "question_text_hu": "Szekunder oligo-amenorrheát válthat ki súlyos pszichológiai stressz vagy extrém tápanyaghiány (pl. kachexia).",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Severe metabolic or psychological stress leads to functional hypothalamic amenorrhea by suppressing GnRH pulsatility.",
        "explanation_hu": "A súlyos metabolikus vagy pszichológiai stressz funkcionális hipotalamikus amenorrheához vezet a GnRH-pulzatilitás gátlása révén."
    },
    {
        "id": "tk10_862",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Diagnostic findings for Klinefelter syndrome characteristically include small, firm testicles and hyalinization/fibrosis of the seminiferous tubules.",
        "question_text_hu": "A Klinefelter-szindróma diagnosztikus leletei közé jellegzetesen a kis, feszes herék és az ondócsatornák hialinizációja/fibrózisa tartozik.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Progressive tubular damage leads to the characteristic testicular findings and subsequent azoospermia.",
        "explanation_hu": "A progresszív tubuláris károsodás vezet a jellegzetes heretünetekhez és a következményes azoospermiához."
    },
    {
        "id": "tk10_863",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "The pineal gland's hormone, melatonin, generally exerts an inhibitory influence on the hypothalamic-pituitary-gonadal (HPG) axis.",
        "question_text_hu": "A tobozmirigy hormonja, a melatonin, általában gátló hatást fejt ki a hipotalamusz-hipofízis-gonád (HPG) tengelyre.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Melatonin inhibits GnRH release; its physiological role is particularly important in regulating seasonal breeding in animals and timing of puberty in humans.",
        "explanation_hu": "A melatonin gátolja a GnRH-felszabadulást; fiziológiai szerepe különösen fontos az állatok szezonális szaporodásának szabályozásában és az emberi pubertás időzítésében."
    },
    {
        "id": "tk10_864",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Female eunuchoidism (due to early ovarian failure) typically results in a significantly reduced adult height (short stature).",
        "question_text_hu": "A női eunuchoidizmus (korai petefészek-elégtelenség miatt) jellemzően jelentősen csökkent felnőttkori testmagasságot (alacsony termet) eredményez.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "Like in males, it leads to TALL stature with long extremities because the lack of estrogen prevents the physiological closure of the epiphyseal plates.",
        "explanation_hu": "A férfiakhoz hasonlóan ez is MAGAS termethez vezet hosszú végtagokkal, mert az öztrogén hiánya megakadályozza az epifízisfúgák fiziológiás záródását."
    },
    {
        "id": "tk10_865",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The hyperestrogenism observed in advanced liver failure is primarily due to the decreased hepatic detoxification and clearance of estrogenic compounds.",
        "question_text_hu": "Az előrehaladott májelégtelenségben megfigyelhető hiperösztrogenizmus elsődleges oka az öztrogénvegyületek csökkent hepatikus detoxikációja és clearance-e.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Liver dysfunction leads to elevated circulating estrogen levels due to reduced metabolism and increased peripheral conversion of androgens.",
        "explanation_hu": "A májműködési zavar emelkedett keringő öztrogénszinthez vezet a csökkent metabolizmus és az androgének fokozott perifériás konverziója miatt."
    },
    {
        "id": "tk10_866",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Chronic anovulation is one of the most common causes of female subfertility or infertility.",
        "question_text_hu": "A krónikus anovuláció a női szubfertilitás vagy infertilitás egyik leggyakoribb oka.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Regular ovulation is a fundamental requirement for natural conception.",
        "explanation_hu": "A szabályos ovuláció a természetes fogantatás alapvető feltétele."
    },
    {
        "id": "tk10_867",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Gynecomastia (enlargement of male breast tissue) is a frequent clinical manifestation of Klinefelter syndrome.",
        "question_text_hu": "A ginecomasztia (férfi emlőszövet megnagyobbodása) a Klinefelter-szindróma gyakori klinikai manifesztációja.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "A disturbed androgen/estrogen ratio in Klinefelter syndrome stimulates glandular proliferation in the male breast.",
        "explanation_hu": "A Klinefelter-szindrómában felborult androgén/öztrogén arány serkenti a mirigyes proliferációt a férfi emlőben."
    },
    {
        "id": "tk10_868",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the specific endocrine syndrome with its defining karyotype or pathophysiological driver.",
        "question_text_hu": "Párosítsa a specifikus endokrin szindrómát annak meghatározó kariotípusával vagy patofiziológiai kiváltó okával.",
        "options": {
            "en": [
                "A) Klinefelter syndrome",
                "B) Morris syndrome",
                "C) Kallmann syndrome",
                "D) Polycystic Ovary Syndrome (PCOS)"
            ],
            "hu": [
                "A) Klinefelter-szindróma",
                "B) Morris-szindróma",
                "C) Kallmann-szindróma",
                "D) Policisztás ovárium szindróma (PCOS)"
            ]
        },
        "items": {
            "en": [
                "1) 47,XXY genotype; Primary hypergonadotropic hypogonadism",
                "2) 46,XY genotype; Female phenotype due to target organ androgen resistance",
                "3) GnRH-deficiency; Combined hypogonadism and anosmia",
                "4) Hyperinsulinemia and high LH; Chronic anovulation and hyperandrogenemia"
            ],
            "hu": [
                "1) 47,XXY genotípus; Primer hipergonadotrop hipogonadizmus",
                "2) 46,XY genotípus; Női fenotípus a célszerv androgén-rezisztenciája miatt",
                "3) GnRH-hiány; Társult hipogonadizmus és anozmia",
                "4) Hiperinzulinémia és magas LH; Krónikus anovuláció és hiperandrogenémia"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Matching specific syndromes with their underlying causes reflects integrated clinical understanding.",
        "explanation_hu": "A specifikus szindrómák és kiváltó okaik párosítása az integrált klinikai tudást tükrözi."
    },
    {
        "id": "tk10_869",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical status with its characteristic endocrine profile.",
        "question_text_hu": "Párosítsa a klinikai állapotot a jellemző endokrin profiljával.",
        "options": {
            "en": [
                "A) Primary Ovarian Failure",
                "B) Hypothalamic (Functional) Amenorrhea",
                "C) Polycystic Ovary Syndrome (PCOS)",
                "D) Pre-pubertal castration"
            ],
            "hu": [
                "A) Primer petefészek-elégtelenség",
                "B) Hipotalamikus (funkcionális) amenorrhea",
                "C) Policisztás ovárium szindróma (PCOS)",
                "D) Pubertás előtti kasztráció"
            ]
        },
        "items": {
            "en": [
                "1) High FSH and High LH (Hypergonadotropic)",
                "2) Low/Absent FSH and LH (Hypogonadotropic)",
                "3) High LH but low or normal FSH (High LH/FSH ratio)",
                "4) Significantly elevated FSH despite no prior puberty"
            ],
            "hu": [
                "1) Magas FSH és magas LH (hipergonadotrop)",
                "2) Alacsony/hiányzó FSH és LH (hipogonadotrop)",
                "3) Magas LH, de alacsony vagy normális FSH (magas LH/FSH arány)",
                "4) Jelentősen emelkedett FSH a korábbi pubertás hiánya ellenére"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Gonadotropin levels are key for distinguishing between primary and secondary (central) gonadal failures.",
        "explanation_hu": "A gonadotropinszintek kulcsfontosságúak a primer és a szekunder (centrális) ivarmirigy-elégtelenség megkülönböztetésében."
    },
    {
        "id": "tk10_870",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the endocrine disorder with an appropriate therapeutic intervention or key clinical consequence.",
        "question_text_hu": "Párosítsa az endokrin rendellenességet a megfelelő terápiás beavatkozással vagy kulcsfontosságú klinikai következménnyel.",
        "options": {
            "en": [
                "A) PCOS with metabolic risk",
                "B) Severe postmenopausal symptoms",
                "C) Morris syndrome (undescended gonads)",
                "D) Congenital Adrenal Hyperplasia (CAH)"
            ],
            "hu": [
                "A) PCOS anyagcsere-kockázattal",
                "B) Súlyos posztmenopauzás tünetek",
                "C) Morris-szindróma (le nem szállt ivarmirigyek)",
                "D) Kongenitális adrenális hiperplázia (CAH)"
            ]
        },
        "items": {
            "en": [
                "1) Metformin to improve insulin sensitivity and restore ovulation",
                "2) Hormone Replacement Therapy (HRT) with careful risk monitoring",
                "3) Surgical removal of intra-abdominal gonads due to malignancy risk",
                "4) Lifelong glucocorticoid replacement to suppress ACTH induced androgen excess"
            ],
            "hu": [
                "1) Metformin az inzulinszenzitivitás javítására és az ovuláció helyreállítására",
                "2) Hormonpótló terápia (HRT) gondos kockázatfigyelés mellett",
                "3) Hasüregi ivarmirigyek sebészi eltávolítása a malignus kockázat miatt",
                "4) Élethosszig tartó glükokortikoid-pótlás az ACTH-indukált androgén-túlsúly gátlására"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Treatment choices reflect the specific molecular and physiological targets of the underlying disease process.",
        "explanation_hu": "A terápiás választások az alapbetegség specifikus molekuláris és fiziológiai célpontjait tükrözik."
    }
]