[
    {
        "id": "tk10_631",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Mineralocorticoid production is less dependent on ACTH compared to glucocorticoids because it can also be significantly stimulated by angiotensin II and high plasma potassium (K+) levels.",
        "question_text_hu": "A mineralokortikoid-termelés kevésbé függ az ACTH-tól, mint a glükokortikoidoké, mert az angiotenzin-II és a magas plazma káliumszint (K+) is jelentősen stimulálhatja.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "The zona glomerulosa is primarily regulated by the renin-angiotensin-aldosterone system (RAAS) and serum electrolytes rather than the pituitary-adrenal axis alone.",
        "explanation_hu": "A zona glomerulosát elsősorban a renin-angiotenzin-aldoszteron rendszer (RAAS) és a szérum elektrolitok szabályozzák, nem pedig kizárólag a hipofízis-mellékvese tengely."
    },
    {
        "id": "tk10_632",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "A peripheral defect in cortisol secretion leads to an over-activation of the other zones of the adrenal cortex because the resulting lack of negative feedback causes a compensatory increase in ACTH.",
        "question_text_hu": "A kortizolszekréció perifériás defektusa a mellékvesekéreg többi zónájának túlzott aktiválódásához vezet, mert a negatív visszacsatolás hiánya kompenzáló ACTH-túlsúlyt eredményez.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "In certain enzymatic defects, the lack of cortisol-mediated suppression causes a rise in CRH and ACTH, which stimulates the production of adrenal androgens and mineralocorticoid precursors.",
        "explanation_hu": "Bizonyos enzimhibák esetén a kortizol-mediált szuppresszió hiánya a CRH és az ACTH emelkedését okozza, ami serkenti a mellékvese-androgének és mineralokortikoid előanyagok termelését."
    },
    {
        "id": "tk10_633",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Aldosterone has high biological availability in the circulation because it is only 50% bound to plasma proteins, allowing a larger free fraction to act on distal renal tubules.",
        "question_text_hu": "Az aldoszteron biológiai elérhetősége a keringésben magas, mert csak 50%-ban kötődik plazmafehérjékhez, lehetővé téve, hogy egy nagyobb szabad frakció hasson a disztális vesetubulusokra.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "The lower degree of protein binding compared to cortisol ensuring that a larger proportion of aldosterone is immediately available to bind to mineralocorticoid receptors.",
        "explanation_hu": "A kortizolhoz képest alacsonyabb fehérjekötődés biztosítja, hogy az aldoszteron nagyobb hányada legyen azonnal elérhető a mineralokortikoid receptorokhoz való kötődéshez."
    },
    {
        "id": "tk10_634",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Cortisol does not typically activate the type-I (mineralocorticoid) receptor in sensitive tissues like the kidney because the 11-beta-hydroxysteroid dehydrogenase (11-beta-HSD) enzyme locally degrades it.",
        "question_text_hu": "Mineralokortikoid-érzékeny szövetekben, például a vesében a kortizol jellemzően nem aktiválja az I-es típusú (mineralokortikoid) receptort, mert a 11-béta-hidroxiszteroid dehidrogenáz (11-béta-HSD) enzim helyileg lebontja.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Local conversion of cortisol to inactive cortisone prevents illicit activation of the mineralocorticoid receptor despite the high circulating concentration of cortisol.",
        "explanation_hu": "A kortizol lokális átalakítása inaktív kortizonná megakadályozza a mineralokortikoid receptor nem kívánt aktiválását a kortizol magas keringő koncentrációja ellenére."
    },
    {
        "id": "tk10_635",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Glucocorticoids promote the development of type 2 diabetes mellitus (T2DM) because they simultaneously increase hepatic gluconeogenesis and decrease glucose utilization in brain and muscle cells.",
        "question_text_hu": "A glükokortikoidok elősegítik a 2-es típusú diabetes mellitus (T2DM) kialakulását, mert egyszerre fokozzák a máj glükoneogenezisét és csökkentik a glükóz felhasználását az agyban és az izomsejtekben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "I true, II false",
        "explanation_en": "Glucocorticoids decrease glucose utilization in peripheral tissues like muscle and adipose tissue, but brain glucose uptake remains largely unaffected or protected.",
        "explanation_hu": "A glükokortikoidok csökkentik a glükózfelhasználást a perifériás szövetekben, mint az izom- és zsírszövet, de az agy glükózfelvétele nagyrészt érintetlen marad vagy védett."
    },
    {
        "id": "tk10_636",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Long-term glucocorticoid treatment leads to a negative nitrogen balance because these hormones strongly augment the breakdown of structural proteins in muscle, bone, and skin.",
        "question_text_hu": "A hosszú távú glükokortikoid-kezelés negatív nitrogénegyensúlyhoz vezet, mert ezek a hormonok erősen fokozzák a strukturális fehérjék lebontását az izomban, a csontban és a bőrben.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "The systemic catabolic effect provides amino acid substrates for gluconeogenesis but results in the progressive wasting of lean tissues.",
        "explanation_hu": "A szisztémás katabolikus hatás aminosav-szubsztrátokat biztosít a glükoneogenezishez, de a sovány szövetek progresszív leépülését eredményezi."
    },
    {
        "id": "tk10_637",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "The anti-inflammatory action of glucocorticoids includes an antifebrile component because they stimulate the expression of annexin A1 which inhibits phospholipase A2.",
        "question_text_hu": "A glükokortikoidok gyulladáscsökkentő hatása lázcsillapító komponenst is tartalmaz, mert serkentik az annexin-A1 expresszióját, amely gátolja a foszfolipáz-A2-t.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Inhibition of the arachidonic acid cascade reduces the production of inflammatory and pyrogenic mediators like leukotrienes and prostaglandins (LOX and COX products).",
        "explanation_hu": "Az arachidonsav-kaszkád gátlása csökkenti a gyulladásos és pirogén mediátorok, például a leukotriének és prosztaglandinok (LOX és COX termékek) termelődését."
    },
    {
        "id": "tk10_638",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Glucocorticoids can mitigate the 'rubor and calor' (redness and heat) of inflammation because they repress the expression of inducible nitric oxide synthase (iNOS), lowering nitric oxide-mediated vasodilation.",
        "question_text_hu": "A glükokortikoidok mérsékelhetik a gyulladás 'rubor és calor' (vörösség és melegség) jeleit, mert gátolják az indukálható nitrogén-oxid szintáz (iNOS) expresszióját, csökkentve a nitrogén-oxid-közvetített vazodilatációt.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Nitric oxide is a potent inflammatory vasodilator; its transcriptional repression by glucocorticoids effectively limits local hyperperfusion in inflamed tissues.",
        "explanation_hu": "A nitrogén-oxid egy erős gyulladásos értágító; a glükokortikoidok általi transzkripciós elnyomása hatékonyan korlátozza a helyi hiperperfúziót a gyulladt szövetekben."
    },
    {
        "id": "tk10_639",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which molecules are classified as mineralocorticoids or exhibit significant mineralocorticoid effects? Select all that apply.",
        "question_text_hu": "Mely molekulák osztályozhatók mineralokortikoidként, vagy mutatnak jelentős mineralokortikoid hatást? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Aldosterone",
                "Corticosterone",
                "11-deoxycorticosterone (DOC)",
                "9-alpha-fluorocortisol",
                "Melatonin"
            ],
            "hu": [
                "Aldoszteron",
                "Kortikoszteron",
                "11-deoxikortikoszteron (DOC)",
                "9-alfa-fluorkortizol",
                "Melatonin"
            ]
        },
        "correct_answer": "Aldoszteron, Kortikoszteron, 11-deoxikortikoszteron (DOC), 9-alfa-fluorkortizol",
        "explanation_en": "Aldosterone is the primary endogenous mineralocorticoid, while DOC and corticosterone represent precursors or variants with affinity for the type-I receptor.",
        "explanation_hu": "Az aldoszteron az elsődleges endogén mineralokortikoid, míg a DOC és a kortikoszteron olyan előanyagokat vagy variánsokat képviselnek, amelyek affinitást mutatnak az I-es típusú receptorhoz."
    },
    {
        "id": "tk10_640",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which gene products have their expression STIMULATED by glucocorticoids to achieve anti-inflammatory goals? Select all that apply.",
        "question_text_hu": "Mely géntermékek expresszióját STIMULÁLJÁK a glükokortikoidok a gyulladáscsökkentő célok elérése érdekében? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Interleukin-10 (IL-10)",
                "Interleukin-1 receptor antagonist (IL-1Ra)",
                "Annexin A1 (lipocortin)",
                "Inducible nitric oxide synthase (iNOS)",
                "Interleukin-1-beta (IL-1-beta)"
            ],
            "hu": [
                "Interleukin-10 (IL-10)",
                "Interleukin-1 receptor antagonista (IL-1Ra)",
                "Annexin-A1 (lipokortin)",
                "Indukálható nitrogén-oxid szintáz (iNOS)",
                "Interleukin-1-béta (IL-1-béta)"
            ]
        },
        "correct_answer": "Interleukin-10 (IL-10), Interleukin-1 receptor antagonista (IL-1Ra), Annexin-A1 (lipokortin)",
        "explanation_en": "Glucocorticoids achieve anti-inflammatory effects by both transactivating anti-inflammatory genes (like IL-10 and annexin) and transrepressing pro-inflammatory genes (like iNOS and IL-1-beta).",
        "explanation_hu": "A glükokortikoidok gyulladáscsökkentő hatásukat a gyulladásgátló gének (mint az IL-10 és az annexin) transzaktiválásával, valamint a gyulladáskeltő gének (mint az iNOS és az IL-1-béta) transzrepressziójával érik el."
    },
    {
        "id": "tk10_641",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What characterizes the metabolic 'diabetogenic' effect of glucocorticoids? Select all that apply.",
        "question_text_hu": "Mi jellemzi a glükokortikoidok metabolikus 'diabetogén' hatását? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Stimulation of hepatic gluconeogenesis",
                "Reduced glucose utilization in skeletal muscle and adipose tissue",
                "Lowering of systemic plasma amino acid levels",
                "Redistribution of fat toward the face and trunk",
                "Direct autoimmune destruction of pancreatic beta cells"
            ],
            "hu": [
                "A máj glükoneogenezisének serkentése",
                "Csökkent glükózfelhasználás a vázizomban és a zsírszövetben",
                "A szisztémás plazma aminosavszintjének csökkenése",
                "A zsír újraelosztása az arc és a törzs felé",
                "A hasnyálmirigy béta-sejtjeinek közvetlen autoimmun elpusztítása"
            ]
        },
        "correct_answer": "A máj glükoneogenezisének serkentése, Csökkent glükózfelhasználás a vázizomban és a zsírszövetben, A zsír újraelosztása az arc és a törzs felé",
        "explanation_en": "Glucocorticoids increase plasma amino acid levels due to systemic proteolysis; they cause metabolic stress on beta cells (steroid diabetes) but do not cause direct autoimmune destruction.",
        "explanation_hu": "A glükokortikoidok növelik a plazma aminosavszintjét a szisztémás proteolízis miatt; metabolikus stresszt okoznak a béta-sejteknek (szteroid-diabétesz), de nem okoznak közvetlen autoimmun pusztulást."
    },
    {
        "id": "tk10_642",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which clinical scenarios or conditions are associated with a decrease in Cortisol-Binding Globulin (CBG) levels? Select all that apply.",
        "question_text_hu": "Mely klinikai forgatókönyvek vagy állapotok társulnak a kortizolkötő globulin (CBG) szintjének csökkenéséhez? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Advanced liver disease (impaired synthesis)",
                "Nephrotic syndrome (urinary loss)",
                "Hyperthyroidism",
                "Estrogen excess (pregnancy or OC use)",
                "Primary hypothyroidism"
            ],
            "hu": [
                "Súlyos májbetegség (csökkent szintézis)",
                "Nephrosis szindróma (vizelettel történő vesztés)",
                "Hipertireózis",
                "Ösztrogén-többlet (terhesség vagy fogamzásgátló)",
                "Primer hipotireózis"
            ]
        },
        "correct_answer": "Súlyos májbetegség (csökkent szintézis), Nephrosis szindróma (vizelettel történő vesztés), Hipertireózis",
        "explanation_en": "High estrogen levels and hypothyroidism are classic causes of an INCREASE in hepatic CBG production.",
        "explanation_hu": "A magas ösztrogénszint és a hipotireózis a máj CBG-termelésének NÖVEKEDÉSÉT okozó klasszikus okok."
    },
    {
        "id": "tk10_643",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which physiological triggers stimulate glucocorticoid release as part of the neuroendocrine stress response? Select all that apply.",
        "question_text_hu": "Mely élettani kiváltó tényezők serkentik a glükokortikoidok felszabadulását a neuroendokrin stresszválasz részeként? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Acute physical or psychological stress",
                "Severe pain",
                "Antidiuretic hormone (ADH)",
                "Epinephrine (adrenaline)",
                "Severe hyperglycemia"
            ],
            "hu": [
                "Akut fizikai vagy pszichológiai stressz",
                "Súlyos fájdalom",
                "Antidiuretikus hormon (ADH)",
                "Epinefrin (adrenalin)",
                "Súlyos hiperglikémia"
            ]
        },
        "correct_answer": "Akut fizikai vagy pszichológiai stressz, Súlyos fájdalom, Antidiuretikus hormon (ADH), Epinefrin (adrenalin)",
        "explanation_en": "Hypoglycemia (not hyper-) is a potent stimulus for the HPA axis to elevate blood glucose levels.",
        "explanation_hu": "A hipoglikémia (nem hiper-) egy erőteljes stimulus a HPA-tengely számára a vércukorszint megemelésére."
    },
    {
        "id": "tk10_644",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary renal physiological effect of mineralocorticoids like aldosterone?",
        "question_text_hu": "Mi a mineralokortikoidok, például az aldoszteron elsődleges renális élettani hatása?",
        "options": {
            "en": [
                "Enhanced distal reabsorption of sodium and water; increased excretion of K+ and H+",
                "Enhanced reabsorption of potassium; increased excretion of salt and water",
                "Complete cessation of glomerular filtration at the Bowman's capsule",
                "Activation of 25-hydroxyvitamin D in the proximal tubule"
            ],
            "hu": [
                "Fokozott disztális nátrium- és vízvisszaszívás; megnövekedett K+ és H+ ürítés",
                "A kálium fokozott visszaszívása; só- és vízürítés fokozása",
                "A glomeruláris filtráció teljes leállítása a Bowman-tokban",
                "A 25-hidroxi-D-vitamin aktiválása a proximális tubulusban"
            ]
        },
        "correct_answer": "Fokozott disztális nátrium- és vízvisszaszívás; megnövekedett K+ és H+ ürítés",
        "explanation_en": "Aldosterone acts on the principal and intercalated cells of the distal nephron to maintain volume while sacrificing potassium and protons.",
        "explanation_hu": "Az aldoszteron a disztális nefron principális és interkalált sejtjeire hatva tartja fenn a térfogatot a kálium és a protonok kárára."
    },
    {
        "id": "tk10_645",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which enzyme enables mineralocorticoid-sensitive tissues to distinguish between aldosterone and much higher levels of cortisol?",
        "question_text_hu": "Melyik enzim teszi lehetővé a mineralokortikoid-érzékeny szövetek számára az aldoszteron és a jóval magasabb szintű kortizol megkülönböztetését?",
        "options": {
            "en": [
                "11-beta-hydroxysteroid dehydrogenase (11-beta-HSD)",
                "Monoamine oxidase (MAO)",
                "Angiotensin-converting enzyme (ACE)",
                "Thyroid peroxidase"
            ],
            "hu": [
                "11-béta-hidroxiszteroid dehidrogenáz (11-béta-HSD)",
                "Monoamin-oxidáz (MAO)",
                "Angiotenzin-konvertáló enzim (ACE)",
                "Pajzsmirigy peroxidáz"
            ]
        },
        "correct_answer": "11-béta-hidroxiszteroid dehidrogenáz (11-béta-HSD)",
        "explanation_en": "11-beta-HSD type 2 converts cortisol into inactive cortisone, preventing the illicit occupation of the mineralocorticoid receptor by cortisol.",
        "explanation_hu": "A 11-béta-HSD 2-es típusú enzim a kortizolt inaktív kortizonná alakítja, megakadályozva a mineralokortikoid receptor kortizol általi illetéktelen elfoglalását."
    },
    {
        "id": "tk10_646",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why do glucocorticoids cause 'characteristic obesity' (e.g., moon face, buffalo hump) despite their systemic fat-mobilizing effects?",
        "question_text_hu": "Miért okoznak a glükokortikoidok 'jellegzetes elhízást' (pl. holdvilágarc, bölénypúp) a szisztémás zsírmobilizáló hatásuk ellenére?",
        "options": {
            "en": [
                "Because fat deposition increases regionally in the face, neck, and trunk",
                "Because they block all fatty acid release from the lower limbs",
                "Because they facilitate the direct conversion of muscle into adipose tissue",
                "Because they significantly increase the patient's appetite for dietary fats"
            ],
            "hu": [
                "Mert a zsírlerakódás regionálisan megnő az arcon, a nyakon és a törzsön",
                "Mert blokkolják az összes zsírsav-felszabadulást az alsó végtagokból",
                "Mert elősegítik az izomszövet közvetlen zsírszövetté alakulását",
                "Mert jelentősen fokozzák a beteg étvágyát az étrendi zsírok iránt"
            ]
        },
        "correct_answer": "Mert a zsírlerakódás regionálisan megnő az arcon, a nyakon és a törzsön",
        "explanation_en": "Glucocorticoids cause a redistribute of body fat; while they stimulate lipolysis in the extremities, they promote fat accumulation in central and facial areas.",
        "explanation_hu": "A glükokortikoidok a testzsír újraelosztását okozzák; miközben serkentik a lipolízist a végtagokban, elősegítik a zsírfelhalmozódást a centrális és arc területeken."
    },
    {
        "id": "tk10_647",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which glucocorticoid receptor variant is unable to elicit gene transactivation alone and functions as a negative regulator?",
        "question_text_hu": "Melyik glükokortikoid receptor variáns képtelen önmagában gén transzaktivációra, és működik negatív regulátorként?",
        "options": {
            "en": [
                "Glucocorticoid receptor beta (GR-beta)",
                "Glucocorticoid receptor alpha (GR-alpha)",
                "Annexin A1",
                "Cortisol-binding globulin (CBG)"
            ],
            "hu": [
                "Glükokortikoid receptor béta (GR-béta)",
                "Glükokortikoid receptor alfa (GR-alfa)",
                "Annexin-A1",
                "Kortizolkötő globulin (CBG)"
            ]
        },
        "correct_answer": "Glükokortikoid receptor béta (GR-béta)",
        "explanation_en": "GR-beta competes with GR-alpha for co-activators or DNA binding sites, potentially contributing to clinical glucocorticoid resistance.",
        "explanation_hu": "A GR-béta verseng a GR-alfával a koaktivátorokért vagy a DNS-kötőhelyekért, ami potenciálisan hozzájárul a klinikai glükokortikoid-rezisztenciához."
    },
    {
        "id": "tk10_648",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "By which molecular mechanism do glucocorticoids suppress the inflammatory vascular responses of redness (rubor) and heat (calor)?",
        "question_text_hu": "Milyen molekuláris mechanizmussal nyomják el a glükokortikoidok a vörösség (rubor) és a melegség (calor) gyulladásos vaszkuláris válaszait?",
        "options": {
            "en": [
                "Repressing the expression of inducible nitric oxide synthase (iNOS)",
                "Directly increasing the local sodium concentration in capillaries",
                "Blocking the pituitary-thyroid regulatory axis",
                "Increasing the subcutaneous production of serotonin and histamine"
            ],
            "hu": [
                "Az indukálható nitrogén-oxid szintáz (iNOS) expressziójának elnyomásával",
                "A kapillárisok helyi nátrium-koncentrációjának közvetlen növelésével",
                "A hipofízis-pajzsmirigy szabályozási tengely blokkolásával",
                "A szerotonin és hisztamin szubkután termelődésének fokozásával"
            ]
        },
        "correct_answer": "Az indukálható nitrogén-oxid szintáz (iNOS) expressziójának elnyomásával",
        "explanation_en": "Reduced nitric oxide levels prevent the inappropriate relaxation of vascular smooth muscle, limiting hyperperfusion in inflamed areas.",
        "explanation_hu": "A csökkent nitrogén-oxid szint megakadályozza a vaszkuláris simaizom nem megfelelő elernyedését, korlátozva a hiperperfúziót a gyulladt területeken."
    },
    {
        "id": "tk10_649",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "The formation of which steroid hormones/precursors is less dependent on ACTH and the HPA axis?",
        "question_text_hu": "Melyik szteroid hormonok/előanyagok képződése függ kevésbé az ACTH-tól és a HPA-tengelytől?",
        "options": {
            "en": [
                "Transformation of pregnenolone into mineralocorticoids (aldosterone pathway)",
                "Transformation of cholesterol into 17-hydroxypregnenolone",
                "Transformation of dehydroepiandrosterone (DHEA) into testosterone",
                "Metabolic inactivation of cortisone within the hepatic tissue"
            ],
            "hu": [
                "A pregnenolon mineralokortikoidokká történő átalakulása (aldoszteron útvonal)",
                "A koleszterin 17-hidroxipregnenolonná történő átalakulása",
                "A dehidroepiandroszteron (DHEA) tesztoszteronná történő átalakulása",
                "A kortizon metabolikus inaktiválása a májszövetben"
            ]
        },
        "correct_answer": "A pregnenolon mineralokortikoidokká történő átalakulása (aldoszteron útvonal)",
        "explanation_en": "While ACTH has some trophic effect, the zona glomerulosa and aldosterone production are primarily regulated by the RAAS and potassium levels.",
        "explanation_hu": "Bár az ACTH-nak van némi trófikus hatása, a zona glomerulosa és az aldoszterontermelés elsősorban a RAAS és a káliumszintek által szabályozott."
    },
    {
        "id": "tk10_650",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the structural consequence of a prolonged, pathologically elevated level of exogenous glucocorticoids on the adrenal cortex?",
        "question_text_hu": "Mi a tartós, patológiásan emelkedett exogén glükokortikoid-szint strukturális következménye a mellékvesekéregre nézve?",
        "options": {
            "en": [
                "Atrophy of the adrenal cortex (primarily the zona fasciculata and reticularis)",
                "Isolated hypertrophy of the zona glomerulosa",
                "Malignant transformation of cortical cells into medullary tissue",
                "A massive compensatory increase in DHEA and androgen production"
            ],
            "hu": [
                "A mellékvesekéreg atrófiája (elsősorban a zona fasciculata és reticularis)",
                "A zona glomerulosa izolált hipertrófiája",
                "A kéregsejtek rosszindulatú átalakulása velőszövetté",
                "A DHEA- és androgéntermelés masszív kompenzáló növekedése"
            ]
        },
        "correct_answer": "A mellékvesekéreg atrófiája (elsősorban a zona fasciculata és reticularis)",
        "explanation_en": "Prolonged negative feedback suppresses CRH and ACTH; the lack of the trophic signal (ACTH) leads to functional and structural atrophy of the dependent zones.",
        "explanation_hu": "A tartós negatív visszacsatolás elnyomja a CRH-t és az ACTH-t; a trófikus jel (ACTH) hiánya a függő zónák funkcionális és strukturális atrófiájához vezet."
    },
    {
        "id": "tk10_651",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What molecular mechanism is proposed for 'acquired glucocorticoid resistance' involving the GR-beta variant?",
        "question_text_hu": "Milyen molekuláris mechanizmust feltételeznek a 'szerzett glükokortikoid-rezisztencia' hátterében a GR-béta variáns közreműködésével?",
        "options": {
            "en": [
                "Competition by GR-alpha/beta heterodimers for co-activators and DNA binding sites",
                "Hyper-activation of the glucocorticoid receptor by elevated estrogen levels",
                "Complete functional failure of the renal 11-beta-hydroxysteroid dehydrogenase enzyme",
                "Rapid programmed cell death of all glucocorticoid-sensitive cortical cells"
            ],
            "hu": [
                "A GR-alfa/béta heterodimerek koaktivátorokért és DNS-kötőhelyekért folytatott versengése",
                "A glükokortikoid receptor túlzott aktiválása az emelkedett ösztrogénszint által",
                "A renális 11-béta-hidroxiszteroid dehidrogenáz enzim teljes funkcionális kudarca",
                "Minden glükokortikoid-érzékeny kéregsejt gyors programozott sejthalála"
            ]
        },
        "correct_answer": "A GR-alfa/béta heterodimerek koaktivátorokért és DNS-kötőhelyekért folytatott versengése",
        "explanation_en": "GR-beta functions as a dominant negative regulator, interfering with the normal transactivation and transrepression activities of the alpha variant.",
        "explanation_hu": "A GR-béta domináns negatív regulátorként működik, zavarva az alfa variáns normális transzaktivációs és transzrepressziós tevékenységét."
    },
    {
        "id": "tk10_652",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which molecular effect primarily explains why glucocorticoids inhibit tissue regeneration and wound healing?",
        "question_text_hu": "Melyik molekuláris hatás magyarázza elsősorban, hogy a glükokortikoidok miért gátolják a szövetregenerációt és a sebgyógyulást?",
        "options": {
            "en": [
                "Systemic catabolic/proteolytic effect (e.g., on collagen and matrix proteins)",
                "Sudden reflex-mediated increase in blood flow to the injured area",
                "Inhibition of the 1-alpha-hydroxylase enzyme in the kidney",
                "Systemic prevention of any adipose tissue formation during the recovery phase"
            ],
            "hu": [
                "Szisztémás katabolikus/proteolitikus hatás (pl. a kollagénen és mátrixfehérjéken)",
                "A sérült terület vérellátásának hirtelen reflex-mediált növekedése",
                "Az 1-alfa-hidroxiláz enzim gátlása a vesében",
                "Bármilyen zsírszövet-képződés szisztémás megakadályozása a felépülési szakaszban"
            ]
        },
        "correct_answer": "Szisztémás katabolikus/proteolitikus hatás (pl. a kollagénen és mátrixfehérjéken)",
        "explanation_en": "By repressing genes for Matrix Metalloproteinases (MMPs) and augmenting protein breakdown, the structural integrity and repair of tissues are impaired.",
        "explanation_hu": "A mátrix-metalloproteinázok (MMP-k) génjeinek elnyomásával és a fehérjelebontás fokozásával a szövetek szerkezeti integritása és regenerációja károsodik."
    },
    {
        "id": "tk10_653",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "How do glucocorticoids primarily interact with the AP-1 and NF-kappaB transcription factors to exert anti-inflammatory effects?",
        "question_text_hu": "Hogyan lépnek interakcióba a glükokortikoidok az AP-1 és NF-kB transzkripciós faktorokkal a gyulladáscsökkentő hatás kifejtése érdekében?",
        "options": {
            "en": [
                "They inhibit their transcriptional activity (transrepression)",
                "They massively stimulate the mRNA expression of these factors",
                "They facilitate the translocation of these factors into red blood cells",
                "They stabilize the binding of these factors to the mineralocorticoid receptor"
            ],
            "hu": [
                "Gátolják transzkripciós aktivitásukat (transzrepresszió)",
                "Masszívan serkentik ezen faktorok mRNS-expresszióját",
                "Elősegítik ezen faktorok vörösvértestekbe történő transzlokációját",
                "Stabilizálják ezen faktorok kötődését a mineralokortikoid receptorhoz"
            ]
        },
        "correct_answer": "Gátolják transzkripciós aktivitásukat (transzrepresszió)",
        "explanation_en": "The inhibition of these 'master switches' silences the transcription of numerous pro-inflammatory cytokines and enzymes.",
        "explanation_hu": "Ezen 'főkapcsolók' gátlása elnémítja számos gyulladáskeltő citokin és enzim transzkripcióját."
    },
    {
        "id": "tk10_654",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "The metabolic degradation and inactivation of steroid hormones occur primarily within the liver.",
        "question_text_hu": "A szteroidhormonok metabolikus lebontása és inaktiválása elsősorban a májban történik.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Hepatic conjugation and reduction reactions transform lipophilic steroids into water-soluble metabolites for biliary or urinary excretion.",
        "explanation_hu": "A máj konjugációs és redukciós reakciói a lipofil szteroidokat vízoldékony metabolitokká alakítják az epeúti vagy vizelettel történő ürítéshez."
    },
    {
        "id": "tk10_655",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "In the systemic circulation, the majority of cortisol is transported bound to Cortisol-Binding Globulin (CBG/Transcortin).",
        "question_text_hu": "A szisztémás keringésben a kortizol többsége kortizolkötő globulinhoz (CBG/transzkortin) kötötten szállítódik.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Protein binding serves as a reservoir, protects the hormone from rapid clearance, and regulates the biologically active free fraction.",
        "explanation_hu": "A fehérjekötődés raktárként szolgál, védi a hormont a gyors kiürüléstől, és szabályozza a biológiailag aktív szabad frakciót."
    },
    {
        "id": "tk10_656",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Glucocorticoids increase the hepatic synthesis of angiotensinogen.",
        "question_text_hu": "A glükokortikoidok fokozzák az angiotenzinogén hepatikus szintézisét.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "This stimulatory effect contributes to their role in blood pressure regulation and the hypertensive side effects of glucocorticoid excess.",
        "explanation_hu": "Ez a serkentő hatás hozzájárul a vérnyomás szabályozásában betöltött szerepükhöz és a glükokortikoid-túlsúly hipertóniás mellékhatásaihoz."
    },
    {
        "id": "tk10_657",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "The percentage of aldosterone bound to plasma proteins (approx. 50%) is significantly lower than that of cortisol (approx. 90%).",
        "question_text_hu": "Az aldoszteron plazmafehérjékhez kötött aránya (kb. 50%) lényegesen alacsonyabb, mint a kortizolé (kb. 90%).",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Lower protein affinity results in a larger free fraction and a shorter half-life for aldosterone compared to glucocorticoids.",
        "explanation_hu": "Az alacsonyabb fehérjeaffinitás nagyobb szabad frakciót és rövidebb féléletidőt eredményez az aldoszteron számára a glükokortikoidokhoz képest."
    },
    {
        "id": "tk10_658",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The metabolic profile of glucocorticoid action includes a significant decrease in systemic plasma amino acid levels.",
        "question_text_hu": "A glükokortikoid-hatás metabolikus profiljához hozzátartozik a szisztémás plazma aminosavszintjének jelentős csökkenése.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "Glucocorticoids INCREASE plasma amino acid levels by stimulating the breakdown of peripheral proteins (muscle, connective tissue).",
        "explanation_hu": "A glükokortikoidok NÖVELIK a plazma aminosavszintjét a perifériás fehérjék (izom, kötőszövet) lebontásának serkentésével."
    },
    {
        "id": "tk10_659",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the protein or factor related to corticosteroid action with its primary regulator or characteristic.",
        "question_text_hu": "Párosítsa a kortikoszteroid-hatáshoz kapcsolódó fehérjét vagy faktort annak elsődleges szabályozójával vagy jellemzőjével.",
        "options": {
            "en": [
                "A: CBG level increase -> 1: Estrogen excess and hyperthyroidism",
                "B: CBG level decrease -> 2: Advanced liver disease and nephrotic syndrome",
                "C: Annexin A1 induction -> 3: Transcriptional stimulation by glucocorticoids",
                "D: Hepatic angiotensinogen -> 4: Positive transcriptional regulation by glucocorticoids"
            ],
            "hu": [
                "A: CBG szint emelkedése -> 1: Ösztrogén-többlet és hipertireózis",
                "B: CBG szint csökkenése -> 2: Súlyos májbetegség és nephrosis szindróma",
                "C: Annexin-A1 indukció -> 3: Glükokortikoidok általi transzkripciós serkentés",
                "D: Hepatikus angiotenzinogén -> 4: Glükokortikoidok általi pozitív transzkripciós szabályozás"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "The biological availability and end-organ effects of steroids are modulated by liver synthesis, transort protein levels, and local tissue regulators.",
        "explanation_hu": "A szteroidok biológiai elérhetőségét és szervspecifikus hatásait a májszintézis, a transzportfehérje-szintek és a helyi szöveti regulátorok modulálják."
    },
    {
        "id": "tk10_660",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the receptor variant or localized enzyme with its specific role in corticosteroid action.",
        "question_text_hu": "Párosítsa a receptor variánst vagy lokalizált enzimet a kortikoszteroid-hatásban betöltött specifikus szerepével.",
        "options": {
            "en": [
                "A: Corticoid type-I receptor (MR) -> 1: High-affinity goal for both aldosterone and cortisol",
                "B: Corticoid type-II receptor (GR) -> 2: Primary target for endogenous and clinical glucocorticoids",
                "C: 11-beta-hydroxysteroid dehydrogenase -> 3: Protects mineralocorticoid-sensitive tissues from cortisol",
                "D: GR-beta variant -> 4: Dominant negative regulator linked to glucocorticoid resistance"
            ],
            "hu": [
                "A: I-es típusú kortikoid receptor (MR) -> 1: Magas affinitású célpont mind az aldoszteron, mind a kortizol számára",
                "B: II-es típusú kortikoid receptor (GR) -> 2: Az endogén és klinikai glükokortikoidok elsődleges célpontja",
                "C: 11-béta-hidroxiszteroid dehidrogenáz -> 3: Védi a mineralokortikoid-érzékeny szöveteket a kortizoltól",
                "D: GR-béta variáns -> 4: Domináns negatív regulátor, a glükokortikoid-rezisztenciához köthető"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "The specific physiological outcome depends on the balance between receptor subtypes and the local enzymatic environment protecting those receptors.",
        "explanation_hu": "A specifikus élettani kimenetel a receptor-altípusok és az ezen receptorokat védő helyi enzimkörnyezet közötti egyensúlytól függ."
    }
]