[
    {
        "id": "tk10_301",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Primary hypothyroidism can lead to secondary hyperprolactinemia and infertility because the compensatory elevation of TRH in response to low thyroid hormones stimulates the secretion of prolactin from the pituitary.",
        "question_text_hu": "A primer hipotireózis szekunder hiperprolaktinémiához és infertilitáshoz vezethet, mert az alacsony pajzsmirigyhormon-szintre adott kompenzatórikus TRH-emelkedés serkenti a hipofízis prolaktin-szekrécióját.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "TRH acts as a common releasing factor for both TSH and PRL, thus its excess in hypothyroidism affects both axes.",
        "explanation_hu": "A TRH közös felszabadító faktorként működik mind a TSH, mind a PRL számára, így túlsúlya hipotireózisban mindkét tengelyt érinti."
    },
    {
        "id": "tk10_302",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hypothyroid coma is considered a critical medical emergency with a death rate approaching 50% because it involves the simultaneous failure of respiratory and circulatory systems alongside profound hypothermia.",
        "question_text_hu": "A hipotiroid kóma kritikus orvosi vészhelyzetnek számít, amelynek halálozási aránya megközelíti az 50%-ot, mert a légző- és keringési rendszer egyidejű leállásával, valamint súlyos hipotermiával jár.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The metabolic collapse in myxedema coma is often triggered by infections or cold exposure in a severely hypothyroid patient.",
        "explanation_hu": "A myxödémás kómában fellépő metabolikus összeomlást gyakran fertőzések vagy hideghatás váltja ki egy súlyosan pajzsmirigy-alulműködésben szenvedő betegnél."
    },
    {
        "id": "tk10_303",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Subclinical hypothyroidism is often diagnosed based exclusively on laboratory findings because in this condition peripheral fT3 and fT4 levels remain normal despite a significantly elevated TSH level.",
        "question_text_hu": "A szubklinikai hipotireózist gyakran kizárólag laboratóriumi leletek alapján diagnosztizálják, mert ebben az állapotban a perifériás fT3 és fT4 szintek normálisak maradnak a jelentősen emelkedett TSH-szint ellenére.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The pituitary detects the slight decrease in thyroid output before free hormone levels drop below the normal reference range.",
        "explanation_hu": "A hipofízis észleli a pajzsmirigy-termelés kismértékű csökkenését, mielőtt a szabad hormonszintek a normál referenciaérték alá süllyednének."
    },
    {
        "id": "tk10_304",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In euthyroid sick syndrome (low T3 syndrome), TSH levels typically remain normal or slightly suppressed because the underlying mechanism involves a peripheral conversion disorder rather than a primary failure of the thyroid gland itself.",
        "question_text_hu": "Eutireoid beteg-szindrómában (alacsony T3 szindróma) a TSH-szint jellemzően normális marad vagy enyhén elnyomott, mert a háttérben álló mechanizmus inkább perifériás konverziós zavart foglal magában, semmint magának a pajzsmirigynek a primer elégtelenségét.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Systemic illness and inflammation (TNF-alpha, IL-6) inhibit T4 conversion to active T3, creating a hypothyroid-like metabolic state without HPT axis failure.",
        "explanation_hu": "A szisztémás betegség és gyulladás (TNF-alfa, IL-6) gátolja a T4 aktív T3-má való konverzióját, hipotiroid-szerű anyagcsere-állapotot hozva létre a HPT-tengely elégtelensége nélkül."
    },
    {
        "id": "tk10_305",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Postpartum thyroiditis is thought to result from a rebound hyper-immune state because the immune tolerance typical of pregnancy is followed by a sudden autoimmune reaction against thyroid tissue in the months after delivery.",
        "question_text_hu": "A postpartum tiroiditisz feltételezhetően egy 'rebound' hiperimmun állapot következménye, mert a terhességre jellemző immuntoleranciát a szülés utáni hónapokban a pajzsmirigyszövet elleni hirtelen autoimmun reakció követi.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "This transient autoimmune phenomenon affects roughly 7.5% of women and usually presents with a sequence of hyper- followed by hypothyroidism.",
        "explanation_hu": "Ez az átmeneti autoimmun jelenség a nők körülbelül 7,5%-át érinti, és általában hipertireózist követő hipotireózissal jelentkezik."
    },
    {
        "id": "tk10_306",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Psychological disorders in adult hypothyroidism, such as lethargy and mental slowdown, are typically reversible with treatment because the underlying intellectual capacities are maintained despite the slow recall and utilization of data.",
        "question_text_hu": "A felnőttkori pajzsmirigy-alulműködés pszichológiai zavarai, mint például a letargia és a mentális lassulás, kezeléssel jellemzően visszafordíthatóak, mert a háttérben meghúzódó intellektuális képességek megmaradnak az adatok lassú felidézése és felhasználása ellenére is.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Unlike neonatal cretinism, adult cognitive changes are metabolic in origin and resolve once hormone levels are normalized.",
        "explanation_hu": "Ellentétben az újszülöttkori kretinizmussal, a felnőttkori kognitív változások metabolikus eredetűek, és a hormonszintek normalizálódásával megszűnnek."
    },
    {
        "id": "tk10_307",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "In neonatal hypothyroidism, systemic symptoms appear only from the 6th or 7th week of life because the presence of maternal thyroid hormones in utero and immediately after birth often masks the infant's deficiency.",
        "question_text_hu": "Újszülöttkori hipotireózisban a szisztémás tünetek csak az élet 6-7. hetétől jelentkeznek, mert az anyai pajzsmirigyhormonok jelenléte méhen belül és közvetlenül a születés után gyakran elfedi a csecsemő hiányát.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Maternal T4 cross the placenta in sufficient amounts to maintain normal fetal somatic growth and brain weight until birth.",
        "explanation_hu": "Az anyai T4 elegendő mennyiségben jut át a placentán ahhoz, hogy születésig fenntartsa a normális magzati szomatikus növekedést és agytömeget."
    },
    {
        "id": "tk10_308",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Severe hyperemesis gravidarum may be accompanied by a transient mild hyperthyroid phase because slightly higher than normal hCG levels structurally stimulate the thyroid gland TSH receptors.",
        "question_text_hu": "A súlyos hyperemesis gravidarumot átmeneti, enyhe hipertireoid fázis kísérheti, mert a normálisnál kissé magasabb hCG-szintek szerkezetileg stimulálják a pajzsmirigy TSH-receptorait.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Spillover effect of hCG on TSH receptors can lead to TSH suppression and marginal fT4 elevation in pregnancy-related nausea.",
        "explanation_hu": "A hCG TSH-receptorokra gyakorolt spillover-hatása TSH-szuppresszióhoz és marginális fT4-emelkedéshez vezethet a terhességi hányingerben."
    },
    {
        "id": "tk10_309",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following clinical findings are frequent in adult hypothyroidism? Select all that apply.",
        "question_text_hu": "Melyek az alábbi klinikai leletek közül a gyakoriak felnőttkori hipotireózisban? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Anemia (iron, B12, or folic acid deficiency)",
                "Nerve compressions such as carpal tunnel syndrome",
                "Muscle weakness and cramps",
                "Tendency for atrophic gastric mucosa and obstipation",
                "Hyperdynamic circulatory state"
            ],
            "hu": [
                "Vérszegénység (vas-, B12- vagy folsavhiány)",
                "Idegkompressziók, például carpal tunnel szindróma",
                "Izomgyengeség és görcsök",
                "Atrofiás gyomornyálkahártyára való hajlam és szorulás",
                "Hiperdinámiás keringési állapot"
            ]
        },
        "correct_answer": "Vérszegénység (vas-, B12- vagy folsavhiány), Idegkompressziók, például carpal tunnel szindróma, Izomgyengeség és görcsök, Atrofiás gyomornyálkahártyára való hajlam és szorulás",
        "explanation_en": "Hypodynamics, not hyperdynamics, is the rule in hypothyroidism.",
        "explanation_hu": "Hipotireózisban a hipodinámia, nem pedig a hiperdinámia a jellemző."
    },
    {
        "id": "tk10_310",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which conditions are often in the background of 'Euthyroid Sick Syndrome' (low T3 syndrome)? Select all that apply.",
        "question_text_hu": "Mely állapotok állnak gyakran az 'eutireoid beteg-szindróma' (alacsony T3 szindróma) hátterében? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Fasting or starvation",
                "Sepsis",
                "Chronic renal failure",
                "Acute myocardial infarction (AMI)",
                "Graves' disease"
            ],
            "hu": [
                "Éhezés vagy koplalás",
                "Szepszis",
                "Krónikus veseelégtelenség",
                "Akut miokardiális infarktus (AMI)",
                "Graves-Basedow-kór"
            ]
        },
        "correct_answer": "Éhezés vagy koplalás, Szepszis, Krónikus veseelégtelenség, Akut miokardiális infarktus (AMI)",
        "explanation_en": "Graves' involves primary hyperthyroidism, not the low T3 conversion disorder of sick syndrome.",
        "explanation_hu": "A Graves-kór primer hipertireózis, nem pedig az alacsony T3-konverziós zavar, ami a beteg-szindrómát jellemzi."
    },
    {
        "id": "tk10_311",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following describes the typical sequence and character of postpartum thyroiditis? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyik írja le a postpartum tiroiditisz tipikus folyamatát és jellegét? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Hyperthyroid phase within 2-6 months postpartum",
                "Hypothyroid phase from 3rd to 12th month postpartum",
                "Often resolves within a year",
                "Approximately 25% become permanently hypothyroid over 10 years",
                "Exclusively monophasic hyperthyroid presentation"
            ],
            "hu": [
                "Hipertireoid fázis a szülés utáni 2-6. hónapban",
                "Hipotiroid fázis a szülés utáni 3-12. hónaptól",
                "Gyakran egy éven belül megszűnik",
                "Körülbelül 25% válik tartósan hipotireoiddá 10 év alatt",
                "Kizárólag monofázisos hipertireoid megjelenés"
            ]
        },
        "correct_answer": "Hipertireoid fázis a szülés utáni 2-6. hónapban, Hipotiroid fázis a szülés utáni 3-12. hónaptól, Gyakran egy éven belül megszűnik, Körülbelül 25% válik tartósan hipotireoiddá 10 év alatt",
        "explanation_en": "Both biphasic and monophasic patterns occur; exclusivity is incorrect.",
        "explanation_hu": "Bifázisos és monofázisos mintázatok is előfordulnak; a 'kizárólagosság' helytelen."
    },
    {
        "id": "tk10_312",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What cardiovascular complications are expected in elderly patients with long-standing untreated hypothyroidism? Select all that apply.",
        "question_text_hu": "Milyen kardiovaszkuláris szövődmények várhatóak kezeletlen, régóta fennálló hipotireózisban szenvedő idős betegeknél? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Accelerated atherosclerosis",
                "Acute myocardial infarction (AMI)",
                "Stroke",
                "Hypercholesterolemia",
                "Hyperdynamic circulatory collapse"
            ],
            "hu": [
                "Felgyorsult ateroszklerózis",
                "Akut miokardiális infarktus (AMI)",
                "Stroke",
                "Hiperkoleszterinémia",
                "Hiperdinámiás keringési összeomlás"
            ]
        },
        "correct_answer": "Felgyorsult ateroszklerózis, Akut miokardiális infarktus (AMI), Stroke, Hiperkoleszterinémia",
        "explanation_en": "Hypothyroidism is hypodynamic; hyperdynamic collapse belongs to thyroid crisis/storm.",
        "explanation_hu": "A hipotireózis hipodinámiás; a hiperdinámiás összeomlás a pajzsmirigy-krízishez/viharhoz tartozik."
    },
    {
        "id": "tk10_313",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "What are the common causes of subclinical hypothyroidism? Select all that apply.",
        "question_text_hu": "Melyek a szubklinikai hipotireózis gyakori okai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Under-dosed thyroid hormone substitution",
                "Initial phase of Hashimoto's thyroiditis",
                "Mild transient thyroiditis",
                "Pituitary TSH-producing adenoma",
                "Iodine treatment during thyrotoxic crisis"
            ],
            "hu": [
                "Aluldozírozott pajzsmirigyhormon-pótlás",
                "A Hashimoto-tireoiditisz kezdeti szakasza",
                "Enyhe, átmeneti pajzsmirigygyulladás",
                "Hipofízeális TSH-termelő adenóma",
                "Jódkezelés tireotoxikus krízis alatt"
            ]
        },
        "correct_answer": "Aluldozírozott pajzsmirigyhormon-pótlás, A Hashimoto-tireoiditisz kezdeti szakasza, Enyhe, átmeneti pajzsmirigygyulladás",
        "explanation_en": "TSH adenoma causes hyperthyroidism, and crisis treatment is for excess, not deficiency.",
        "explanation_hu": "A TSH-adenóma hipertireózist okoz, a kríziskezelés pedig túltermelésre, nem hiányra való."
    },
    {
        "id": "tk10_314",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the primary indicator of subclinical hypothyroidism in laboratory tests?",
        "question_text_hu": "Mi a szubklinikai hipotireózis elsődleges jelzője a laboratóriumi vizsgálatokban?",
        "options": {
            "en": [
                "Elevated TSH with normal fT3 and fT4",
                "Low TSH with high fT4",
                "Normal TSH with low fT3",
                "Elevated TSH and elevated fT4"
            ],
            "hu": [
                "Emelkedett TSH normál fT3 és fT4 mellett",
                "Alacsony TSH magas fT4 mellett",
                "Normál TSH alacsony fT3 mellett",
                "Emelkedett TSH és emelkedett fT4 mellett"
            ]
        },
        "correct_answer": "Emelkedett TSH normál fT3 és fT4 mellett",
        "explanation_en": "Slight thyroid failure is sensed by the pituitary before free hormone levels drop below reference ranges.",
        "explanation_hu": "A kismértékű pajzsmirigy-elégtelenséget a hipofízis észleli, mielőtt a szabad hormonszintek a referencia-tartomány alá süllyednének."
    },
    {
        "id": "tk10_315",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which statement best describes the cognitive function in adult hypothyroidism?",
        "question_text_hu": "Melyik állítás írja le legjobban a kognitív funkciókat felnőttkori hipotireózisban?",
        "options": {
            "en": [
                "Intellectual capacities are maintained, but recall/utilization is slow",
                "Intellectual capacity is progressively and irreversibly lost",
                "Associate functions are suppressed while memory remains fast",
                "Psychomotoric activity is increased due to irritability"
            ],
            "hu": [
                "Az intellektuális képességek megmaradnak, de a felidézés/felhasználás lassú",
                "Az intellektuális kapacitás progresszíven és visszafordíthatatlanul elvész",
                "Az asszociációs funkciók elnyomottak, míg a memória gyors marad",
                "A pszichomotoros aktivitás fokozott az irritabilitás miatt"
            ]
        },
        "correct_answer": "Az intellektuális képességek megmaradnak, de a felidézés/felhasználás lassú",
        "explanation_en": "Adult hypothyroidism slows mental processing but does not destroy intelligence, unlike early neonatal deficiency.",
        "explanation_hu": "A felnőttkori hipotireózis lassítja a mentális folyamatokat, de nem pusztítja el az intelligenciát, ellentétben a korai újszülöttkori hiánnyal."
    },
    {
        "id": "tk10_316",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the expected outcome for most cases of postpartum thyroiditis?",
        "question_text_hu": "Mi a várható kimenetel a postpartum tiroiditisz eseteinek többségében?",
        "options": {
            "en": [
                "It resolves within a year",
                "It turns into permanent Graves' disease",
                "It progresses to hypothyroid coma",
                "It requires lifelong ablation with I-131"
            ],
            "hu": [
                "Egy éven belül megszűnik",
                "Tartós Graves-betegséggé alakul",
                "Hipotiroid kómává fajul",
                "Egész életen át tartó I-131 ablációt igényel"
            ]
        },
        "correct_answer": "Egy éven belül megszűnik",
        "explanation_en": "Most cases are transient, although some develop permanent failure over long follow-up periods.",
        "explanation_hu": "A legtöbb eset átmeneti, bár egyeseknél tartós elégtelenség alakul ki hosszú követési idő alatt."
    },
    {
        "id": "tk10_317",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Why do patients with primary hypothyroidism often have elevated prolactin levels?",
        "question_text_hu": "Miért van gyakran emelkedett prolaktinszintje a primer hipotireózisban szenvedő betegeknek?",
        "options": {
            "en": [
                "Excess TRH stimulates both TSH and Prolactin producing cells",
                "Lack of T4 directly inhibits dopamine release",
                "TSH directly acts as a prolactin-releasing factor",
                "Iodine deficiency stimulates placental lactogen production"
            ],
            "hu": [
                "A TRH-túlsúly stimulálja a TSH- és a prolaktintermelő sejteket is",
                "A T4 hiánya közvetlenül gátolja a dopamin-felszabadulást",
                "A TSH közvetlenül prolaktin-felszabadító faktorként működik",
                "A jódhiány stimulálja a placentáris laktogén termelését"
            ]
        },
        "correct_answer": "A TRH-túlsúly stimulálja a TSH- és a prolaktintermelő sejteket is",
        "explanation_en": "TRH is a potent stimulant for prolactin release from the anterior pituitary lactotrophs.",
        "explanation_hu": "A TRH az elülső hipofízis laktotróf sejtjeiből származó prolaktin-felszabadulás hatékony stimulátora."
    },
    {
        "id": "tk10_318",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which statement regarding maternal T4 and fetal development is correct?",
        "question_text_hu": "Melyik állítás helyes az anyai T4-gyel és a magzati fejlődéssel kapcsolatban?",
        "options": {
            "en": [
                "Maternal T4 maintains normal fetal brain weight and somatic growth until birth",
                "Maternal T4 cannot cross the placenta, leading to immediate fetal symptoms",
                "Fetal development is entirely independent of any thyroid hormones",
                "Maternal T4 in excess causes neonatal goiter in all cases"
            ],
            "hu": [
                "Az anyai T4 fenntartja a normális magzati agytömeget és szomatikus növekedést születésig",
                "Az anyai T4 nem tud átjutni a placentán, ami azonnali magzati tünetekhez vezet",
                "A magzati fejlődés teljesen független a pajzsmirigyhormonoktól",
                "A túlzott anyai T4 minden esetben újszülöttkori golyvát okoz"
            ]
        },
        "correct_answer": "Az anyai T4 fenntartja a normális magzati agytömeget és szomatikus növekedést születésig",
        "explanation_en": "Maternal T4 protects the fetus; therefore, neonatal symptoms of deficiency typically appear only weeks after birth as maternal levels fade.",
        "explanation_hu": "Az anyai T4 megvédi a magzatot; ezért a hiány újszülöttkori tünetei jellemzően csak hetekkel a szülés után jelentkeznek, ahogy az anyai szintek csökkennek."
    },
    {
        "id": "tk10_319",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why is the diagnosis of hypothyroidism in the elderly often delayed?",
        "question_text_hu": "Miért késik gyakran a pajzsmirigy-alulműködés diagnózisa időseknél?",
        "options": {
            "en": [
                "Symptoms appear as normal phenomena of senescence (aging)",
                "Elderly patients always present with hyperdynamic circulation",
                "TSH is always suppressed in elderly hypothyroidism",
                "Thyroid hormones levels are naturally higher in the elderly"
            ],
            "hu": [
                "A tünetek az öregedés (senescentia) normális jelenségeiként jelentkeznek",
                "Az idős betegek mindig hiperdinámiás keringéssel jelentkeznek",
                "A TSH mindig elnyomott az időskori hipotireózisban",
                "A pajzsmirigyhormon-szintek természetesen magasabbak időskorban"
            ]
        },
        "correct_answer": "A tünetek az öregedés (senescentia) normális jelenségeiként jelentkeznek",
        "explanation_en": "Psychomotoric slowdown and poor memory are mistaken for aging by patients and relatives.",
        "explanation_hu": "A pszichomotoros lassulást és a rossz memóriát a betegek és a hozzátartozók tévesen az öregedésnek tudják be."
    },
    {
        "id": "tk10_320",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which ECG finding is frequently mentioned as a sign of hypothyroidism?",
        "question_text_hu": "Melyik EKG-leletet említik gyakran a pajzsmirigy-alulműködés jeleként?",
        "options": {
            "en": [
                "Low voltage",
                "Peaked T waves",
                "Shortened PR interval",
                "ST elevation in all leads"
            ],
            "hu": [
                "Low voltage",
                "Csúcsos T-hullámok",
                "Lerövidült PR-intervallum",
                "ST-eleváció minden elvezetésben"
            ]
        },
        "correct_answer": "Low voltage",
        "explanation_en": "Myxedematous effusion and reduced heart work contribute to low electrical activity recorded on the skin surface.",
        "explanation_hu": "A myxödémás effúzió és a csökkent szívmunka hozzájárul a bőrfelszínen regisztrált alacsony elektromos aktivitáshoz."
    },
    {
        "id": "tk10_321",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "The high death rate (near 50%) in hypothyroid coma is primarily due to failure of:",
        "question_text_hu": "A hipotiroid kómában fellépő magas halálozási arány (közel 50%) elsősorban minek az elégtelenségének köszönhető?",
        "options": {
            "en": [
                "Respiratory and circulatory systems",
                "The renal excretion of water",
                "The integumentary system (skin)",
                "Endocrine feedback loops only"
            ],
            "hu": [
                "A légző- és keringési rendszernek",
                "A víz vesén keresztüli kiválasztásának",
                "A kültakarónak (bőr)",
                "Kizárólag az endokrin visszacsatolási köröknek"
            ]
        },
        "correct_answer": "A légző- és keringési rendszernek",
        "explanation_en": "Severe respiratory depression and low cardiac output lead to fatal systemic collapse.",
        "explanation_hu": "A súlyos légzésdepresszió és az alacsony perctérfogat végzetes szisztémás összeomláshoz vezet."
    },
    {
        "id": "tk10_322",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "In euthyroid sick syndrome, which cytokines are often found to be elevated?",
        "question_text_hu": "Eutireoid beteg-szindrómában mely citokinek szintje emelkedett gyakran?",
        "options": {
            "en": [
                "TNF-alpha and IL-6",
                "Erythropoietin and Thrombopoietin",
                "Insulin and Glucagon",
                "Acetylcholine and Noradrenaline"
            ],
            "hu": [
                "TNF-alfa és IL-6",
                "Eritropoetin és trombopoetin",
                "Inzulin és glükagon",
                "Acetilkolin és noradrenalin"
            ]
        },
        "correct_answer": "TNF-alfa és IL-6",
        "explanation_en": "Inflammatory cytokines inhibit the 5'-deiodinase enzyme responsible for peripheral T3 production.",
        "explanation_hu": "A gyulladásos citokinek gátolják a perifériás T3-termelésért felelős 5'-dejodináz enzimet."
    },
    {
        "id": "tk10_323",
        "type": "single_choice",
        "bloom_level": 1,
        "question_text_en": "At what point does neonatal hypothyroidism become irreversible in terms of nervous system development?",
        "question_text_hu": "Melyik időpontban válik az újszülöttkori hipotireózis visszafordíthatatlanná az idegrendszer fejlődése szempontjából?",
        "options": {
            "en": [
                "From the 6-7th week of life",
                "Immediately at the moment of birth",
                "Only after the 2nd year of life",
                "During the first trimester of pregnancy"
            ],
            "hu": [
                "Az élet 6-7. hetétől",
                "Közvetlenül a születés pillanatában",
                "Csak az élet 2. éve után",
                "A terhesség első trimeszterében"
            ]
        },
        "correct_answer": "Az élet 6-7. hetétől",
        "explanation_en": "Critical brain maturation requires thyroid hormones during this early postnatal window.",
        "explanation_hu": "A kritikus agyi éréshez pajzsmirigyhormonokra van szükség ebben a korai posztnatális ablakban."
    },
    {
        "id": "tk10_324",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Why can trophoblast tumors (e.g., choriocarcinoma) lead to hyperthyroidism according to the text?",
        "question_text_hu": "Miért vezethetnek a trofoblaszt tumorok (pl. choriocarcinoma) hipertireózishoz a szöveg szerint?",
        "options": {
            "en": [
                "Extremely high hCG levels structurally mimic TSH",
                "They produce ectopic pituitary-stimulating factors",
                "They destroy the normal thyroid follicles",
                "They inhibit the T4-to-T3 peripheral conversion"
            ],
            "hu": [
                "A rendkívül magas hCG-szintek szerkezetileg utánozzák a TSH-t",
                "Ektopiás hipofízis-stimuláló faktorokat termelnek",
                "Elpusztítják a normális pajzsmirigy-follikulusokat",
                "Gátolják a T4-T3 perifériás konverziót"
            ]
        },
        "correct_answer": "A rendkívül magas hCG-szintek szerkezetileg utánozzák a TSH-t",
        "explanation_en": "High hCG levels activate TSH receptors due to the shared alpha subunit and structural similarity.",
        "explanation_hu": "A magas hCG-szintek aktiválják a TSH-receptorokat a közös alfa-alegység és a szerkezeti hasonlóság miatt."
    },
    {
        "id": "tk10_325",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which symptom is characteristic for Raromenorrhea combined with metrorrhagia in hypothyroidism?",
        "question_text_hu": "Melyik tünet jellemző a hipotireózisban fellépő raromenorrhoea és metrorrhagia kombinációjára?",
        "options": {
            "en": [
                "Irregular and heavy menstrual bleeding",
                "Complete absence of menstruation (amenorrhea)",
                "Regular but very light cycles",
                "Excessive growth of body hair (hirsutism)"
            ],
            "hu": [
                "Rendszertelen és erős mentstruációs vérzés",
                "A menstruáció teljes hiánya (amenorrhea)",
                "Rendszeres, de nagyon enyhe ciklusok",
                "Túlzott testszőrzet-növekedés (hirsutizmus)"
            ]
        },
        "correct_answer": "Rendszertelen és erős mentstruációs vérzés",
        "explanation_en": "Thyroid failure disrupts the normal hormonal control of the menstrual cycle, leading to irregular timing and volume.",
        "explanation_hu": "A pajzsmirigy-elégtelenség megzavarja a menstruációs ciklus normális hormonális kontrollját, ami rendszertelen időzítéshez és menstruációs mennyiséghez vezet."
    },
    {
        "id": "tk10_326",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Intellectual capacities are fundamentally lost and destroyed in adult hypothyroidism.",
        "question_text_hu": "Az intellektuális képességek alapvetően elvesznek és elpusztulnak felnőttkori pajzsmirigy-alulműködésben.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "They are maintained but the speed of recall and utilization is slowed.",
        "explanation_hu": "Megmaradnak, de a felidézés és a felhasználás sebessége lelassul."
    },
    {
        "id": "tk10_327",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Postpartum thyroiditis resolves within a year in most cases.",
        "question_text_hu": "A postpartum tiroiditisz az esetek többségében egy éven belül megszűnik.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Most cases are transient, though follow-up is necessary due to the risk of permanent failure.",
        "explanation_hu": "A legtöbb eset átmeneti, bár a követés szükséges a tartós elégtelenség kockázata miatt."
    },
    {
        "id": "tk10_328",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Neonatal hypothyroidism symptoms are clinically obvious immediately at birth.",
        "question_text_hu": "Az újszülöttkori hipotireózis tünetei klinikailag nyilvánvalóak közvetlenül a születés után.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Maternal hormones mask the deficiency; symptoms appear around the 6-7th week.",
        "explanation_hu": "A magzati hormonok elfedik a hiányt; a tünetek a 6-7. hét környékén jelentkeznek."
    },
    {
        "id": "tk10_329",
        "type": "matching",
        "bloom_level": 2,
        "question_text_en": "Match the specialized form of thyroid disorder with its key laboratory/clinical finding.",
        "question_text_hu": "Párosítsa a pajzsmirigyzavar speciális formáját annak kulcsfontosságú laboratóriumi/klinikai leletével.",
        "options": {
            "en": [
                "A) Subclinical Hypothyroidism",
                "B) Euthyroid Sick Syndrome",
                "C) Postpartum Thyroiditis",
                "D) Neonatal Hypothyroidism"
            ],
            "hu": [
                "A) Szubklinikai hipotireózis",
                "B) Eutireoid beteg-szindróma",
                "C) Postpartum tiroiditisz",
                "D) Újszülöttkori hipotireózis"
            ]
        },
        "items": {
            "en": [
                "1) Elevated TSH with normal fT4",
                "2) Low T3 with normal/low TSH during illness",
                "3) Biphasic hyper/hypo state after delivery",
                "4) Irreversible CNS failure if left untreated"
            ],
            "hu": [
                "1) Emelkedett TSH normál fT4 mellett",
                "2) Alacsony T3 normál/alacsony TSH mellett betegség alatt",
                "3) Bifázisos hiper/hipo állapot szülés után",
                "4) Visszafordíthatatlan KKV-elégtelenség, ha kezeletlen marad"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "These forms require careful differential diagnosis based on context and lab results.",
        "explanation_hu": "Ezek a formák gondos differenciáldiagnózist igényelnek a kontextus és a laboreredmények alapján."
    },
    {
        "id": "tk10_330",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the complication of hypothyroidism with its anatomical or metabolic system.",
        "question_text_hu": "Párosítsa a pajzsmirigy-alulműködés szövődményét az anatómiai vagy metabolikus rendszerével.",
        "options": {
            "en": [
                "A) Myxedema",
                "B) Hypercholesterolemia",
                "C) Carpal tunnel",
                "D) Atrophic mucosa"
            ],
            "hu": [
                "A) Myxödéma",
                "B) Hiperkoleszterinémia",
                "C) Carpal tunnel",
                "D) Atrofiás nyálkahártya"
            ]
        },
        "items": {
            "en": [
                "1) Connective tissue water binding",
                "2) Reduced LDL-receptor density",
                "3) Nerve compression syndrome",
                "4) Gastrointestinal tract"
            ],
            "hu": [
                "1) Kötőszöveti vízmegkötés",
                "2) Csökkent LDL-receptor sűrűség",
                "3) Idegkompressziós szindróma",
                "4) Gasztrointesztinális traktus"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Hypothyroidism affects a wide range of biological processes throughout the body.",
        "explanation_hu": "A pajzsmirigy-alulműködés a biológiai folyamatok széles skáláját érinti az egész testben."
    }
]