[
    {
        "id": "tk10_751",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Adrenal androgen levels are typically high in patients with Cushing's disease because androgens increase erythropoietin production and blood viscosity, thereby contributing to hypertension.",
        "question_text_hu": "Cushing-kórban a mellékvese-androgének szintje jellemzően magas, mert az androgének fokozzák az eritropoetin-termelést és a vér viszkozitását, ezáltal hozzájárulva a hipertóniához.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Increased red blood cell mass leads to higher peripheral resistance and blood pressure.",
        "explanation_hu": "A megnövekedett vörösvértest-tömeg magasabb perifériás ellenálláshoz és vérnyomáshoz vezet."
    },
    {
        "id": "tk10_752",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Consuming excessive amounts of real liquorice can lead to apparent mineralocorticoid excess (AME) because glycyrrhizin inhibits the renal 11-beta-hydroxysteroid dehydrogenase (11-beta-HSD) enzyme.",
        "question_text_hu": "Túlzott mennyiségű igazi édesgyökér (medvecukor) fogyasztása látszólagos mineralokortikoid-túlsúlyhoz (AME) vezethet, mert a glicirrizin gátolja a renális 11-béta-hidroxiszteroid-dehidrogenáz (11-béta-HSD) enzimet.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "This inhibition allows cortisol to reach and activate mineralocorticoid receptors (MR) in the renal tubules, mimicking aldosterone.",
        "explanation_hu": "Ez a gátlás lehetővé teszi, hogy a kortizol elérje és aktiválja a vese tubulusaiban lévő mineralokortikoid receptorokat (MR), utánozva az aldoszteront."
    },
    {
        "id": "tk10_753",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Cushing's syndrome is characteristically associated with centripetal (truncal) obesity, because the high insulin levels resulting from glucocorticoid-induced hyperglycemia promote regional fat deposition.",
        "question_text_hu": "A Cushing-szindróma jellegzetesen centripetális (törzsi) elhízással társul, mert a glükokortikoidok által kiváltott hiperglikémia következtében fellépő magas inzulinszint elősegíti a regionális zsírlerakódást.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Insulin activity is preserved in specific adipose depots like the face (moon face) and neck (buffalo hump), despite systemic lipolysis.",
        "explanation_hu": "Az inzulinfüggő zsírlerakódás megmarad bizonyos helyeken, mint az arc (holdvilágarc) és a nyak (bölénypúp), a szisztémás lipolízis ellenére."
    },
    {
        "id": "tk10_754",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Severe osteoporosis is a significant complication of Cushing's syndrome, because glucocorticoids decrease intestinal calcium absorption and increase the expression of PTH-receptors on osteoclasts.",
        "question_text_hu": "A súlyos oszteoporózis a Cushing-szindróma jelentős szövődménye, mert a glükokortikoidok csökkentik a bélből történő kalciumfelszívódást és növelik az oszteoklasztokon lévő PTH-receptorok expresszióját.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Loss of collagen matrix in the bone and inhibition of osteoblast activity further contribute to rapid skeletal weakening.",
        "explanation_hu": "A csont kollagén mátrixának elvesztése és az oszteoblaszt-aktivitás gátlása tovább járul a vázrendszer gyors gyengüléséhez."
    },
    {
        "id": "tk10_755",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Gastric ulcers in Cushing's syndrome are notoriously dangerous because they can progress silently without typical inflammatory pain, as glucocorticoids increase acid production while simultaneously masking symptoms of inflammation.",
        "question_text_hu": "A Cushing-szindrómában fellépő gyomorfekélyek köztudottan veszélyesek, mert némán, tipikus gyulladásos fájdalom nélkül súlyosbodhatnak, mivel a glükokortikoidok fokozzák a savtermelést, miközben elfedik a gyulladásos tüneteket.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Increased acidity combined with inhibited tissue repair leads to deep mucosal lesions with minimal warning signs.",
        "explanation_hu": "A fokozott savtermelés és a gátolt szöveti regeneráció mély nyálkahártya-elváltozásokhoz vezet minimális figyelmeztető jelek mellett."
    },
    {
        "id": "tk10_756",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hematological findings in Cushing's syndrome include a decrease in circulating lymphocytes and eosinophils, because high cortisol levels promote the apoptosis of these inflammatory cells and impair their mobilization from the bone marrow.",
        "question_text_hu": "A Cushing-szindróma hematológiai leletei közé tartozik a keringő limfociták és eozinofilek számának csökkenése, mert a magas kortizolszint elősegíti ezen gyulladásos sejtek apoptózisát és gátolja a csontvelőből való mobilizációjukat.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "I true, II false",
        "explanation_en": "Cortisol actually increases the production and mobilization of NEUTROPHILS by reducing their margination, despite the decrease in lymphocytes.",
        "explanation_hu": "A kortizol valójában növeli a NEUTROFILEK termelését és mobilizációját a szegregációjuk (margináció) csökkentésével, a limfociták számának csökkenése ellenére."
    },
    {
        "id": "tk10_757",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Ecchymoses (bruising) occur frequently in patients with Cushing's syndrome because excessive glucocorticoids cause severe protein breakdown and loss of supporting connective tissue in the vascular walls.",
        "question_text_hu": "Cushing-szindrómás betegeknél gyakran fordulnak elő ecchymosisok (véraláfutások), mert a túlzott glükokortikoidszint súlyos fehérjelebontást és a támogató kötőszövet elvesztését okozza az érfalakban.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "Loss of collagen matrix makes capillaries fragile and highly prone to rupture even with minimal trauma.",
        "explanation_hu": "A kollagén mátrix elvesztése a kapillárisokat törékennyé és minimális trauma esetén is repedésre hajlamossá teszi."
    },
    {
        "id": "tk10_758",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Secondary hyperaldosteronism associated with edema is characterized by elevated renin levels and a decreased effective circulating arterial volume, because fluid shifts from the vascular space into the interstitium.",
        "question_text_hu": "Az ödémával járó szekunder hiperaldoszteronizmust emelkedett reninszint és csökkent effektív keringő artériás térfogat jellemzi, mert a folyadék az érpályából az interstitiumba áramlik.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "This mechanism is seen in conditions like congestive heart failure and cirrhosis, where kidneys respond to perceived low volume by retaining salt and water.",
        "explanation_hu": "Ez a mechanizmus látható olyan állapotokban, mint a pangásos szívelégtelenség és a májcirrózis, ahol a vesék az alacsony effektív térfogatara só- és vízvisszatartással válaszolnak."
    },
    {
        "id": "tk10_759",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which mechanisms contribute to the development of hypertension in Cushing's syndrome? Select all that apply.",
        "question_text_hu": "Mely mechanizmusok járulnak hozzá a hipertónia kialakulásához Cushing-szindrómában? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Spillover effect of cortisol on mineralocorticoid receptors",
                "Increased hepatic synthesis of angiotensinogen",
                "Potentiation of catecholamine-induced vasoconstriction",
                "Increased blood viscosity due to androgen-stimulated erythropoiesis",
                "Direct compression of the renal arteries by abdominal fat"
            ],
            "hu": [
                "A kortizol 'spillover' hatása a mineralokortikoid receptorokon",
                "Az angiotenzinogén fokozott májbeli szintézise",
                "A katekolamin-indukált vazokonstrikció potenciálása",
                "Az androgén-stimulált eritropoézis miatti fokozott vérviszkozitás",
                "A veseartériák hasi zsír általi közvetlen kompressziója"
            ]
        },
        "correct_answer": "A kortizol 'spillover' hatása a mineralokortikoid receptorokon, Az angiotenzinogén fokozott májbeli szintézise, A katekolamin-indukált vazokonstrikció potenciálása, Az androgén-stimulált eritropoézis miatti fokozott vérviszkozitás",
        "explanation_en": "The combination of volume expansion, increased vascular resistance, and higher metabolic tone drives the blood pressure up.",
        "explanation_hu": "A térfogat-expanzió, a megnövekedett vaszkuláris rezisztencia és a magasabb metabolikus tónus kombinációja emeli meg a vérnyomást."
    },
    {
        "id": "tk10_760",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following are recognized causes of ACTH-independent Cushing's syndrome? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyek az ACTH-független Cushing-szindróma elismert okai? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Adrenal cortisol-producing adenoma",
                "Adrenal cortisol-producing carcinoma",
                "Iatrogenic administration of therapeutic glucocorticoids",
                "Ectopic ACTH production by a small-cell lung carcinoma",
                "Pituitary ACTH-secreting adenoma (Cushing's disease)"
            ],
            "hu": [
                "Mellékvese kortizol-termelő adenoma",
                "Mellékvese kortizol-termelő karcinóma",
                "Terápiás glükokortikoidok iatrogén alkalmazása",
                "Kissejtes tüdőkarcinóma ektopiás ACTH-termelése",
                "Hipofízis ACTH-szekretáló adenoma (Cushing-kór)"
            ]
        },
        "correct_answer": "Mellékvese kortizol-termelő adenoma, Mellékvese kortizol-termelő karcinóma, Terápiás glükokortikoidok iatrogén alkalmazása",
        "explanation_en": "ACTH-independent forms involve autonomous cortisol secretion or exogenous intake, which usually suppresses pituitary ACTH.",
        "explanation_hu": "Az ACTH-független formák autonom kortizolszekréciót vagy exogén bevitelt foglalnak magukban, ami általában elnyomja a hipofízis ACTH-szintjét."
    },
    {
        "id": "tk10_761",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following factors contribute to the systemic 'catabolic state' in Cushing's syndrome? Select all that apply.",
        "question_text_hu": "Az alábbi tényezők közül melyek járulnak hozzá a szisztémás 'katabolikus állapothoz' Cushing-szindrómában? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Negative nitrogen balance",
                "Acceleration of muscle protein breakdown",
                "Inhibition of fibroblast activity leading to skin striae",
                "Impaired tissue regeneration and wound healing",
                "Hypertrophic enlargement of the thymus gland"
            ],
            "hu": [
                "Negatív nitrogénegyensúly",
                "Az izomfehérje-lebontás gyorsulása",
                "A fibroblaszt-aktivitás gátlása, ami bőrcsíkokhoz (striae) vezet",
                "Károsodott szöveti regeneráció és sebgyógyulás",
                "A thymus hipertrófiás megnagyobbodása"
            ]
        },
        "correct_answer": "Negatív nitrogénegyensúly, Az izomfehérje-lebontás gyorsulása, A fibroblaszt-aktivitás gátlása, ami bőrcsíkokhoz (striae) vezet, Károsodott szöveti regeneráció és sebgyógyulás",
        "explanation_en": "Thymic atrophy (rather than hypertrophy) is characteristic due to the inhibition of lymphoid proliferation.",
        "explanation_hu": "A thymus atrófiája (nem pedig hipertrófiája) jellemző a limfoid proliferáció gátlása miatt."
    },
    {
        "id": "tk10_762",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which hematological changes are characteristically found in a patient with untreated Cushing's syndrome? Select all that apply.",
        "question_text_hu": "Mely hematológiai változások találhatóak meg jellegzetesen egy kezeletlen Cushing-szindrómás betegnél? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Neutrophilia (increased neutrophil count)",
                "Polycythemia (elevated red blood cell mass)",
                "Lymphopenia (reduced lymphocyte count)",
                "Eosinopenia (reduced eosinophil count)",
                "Basophilia (elevated basophil count)"
            ],
            "hu": [
                "Neutrofília (megnövekedett neutrofilszám)",
                "Policitémia (megemelkedett vörösvértest-tömeg)",
                "Limfopénia (csökkent limfocitaszám)",
                "Eozinopénia (csökkent eozinofilszám)",
                "Bazofília (megemelkedett bazofilszám)"
            ]
        },
        "correct_answer": "Neutrofília (megnövekedett neutrofilszám), Policitémia (megemelkedett vörösvértest-tömeg), Limfopénia (csökkent limfocitaszám), Eozinopénia (csökkent eozinofilszám)",
        "explanation_en": "Basophil counts typically decrease (basopenia) alongside lymphocytes and eosinophils under the influence of high glucocorticoids.",
        "explanation_hu": "A bazofilszám jellemzően csökken (bazopénia) a limfocitákkal és eozinofilekkel együtt magas glükokortikoidszint hatására."
    },
    {
        "id": "tk10_763",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following gastrointestinal or endocrine disruptions are typical of chronic glucocorticoid excess? Select all that apply.",
        "question_text_hu": "Melyek az alábbiak közül a krónikus glükokortikoid-túlsúlyra jellemző gasztrointesztinális vagy endokrin zavarok? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Hypersecretion of gastric acid",
                "Suppression of the inflammatory response in gastric ulcers (silent ulcers)",
                "Decreased pulsatile secretion of GnRH and GH",
                "Secondary suppression of TSH levels",
                "Primary autoimmune stimulation of TSH production"
            ],
            "hu": [
                "A gyomorsav hiper-szekréciója",
                "A gyulladásos válasz gátlása a gyomorfekélyekben (néma fekélyek)",
                "A GnRH és a GH csökkent pulzatilis szekréciója",
                "A TSH-szint szekunder elnyomása",
                "A TSH-termelés primer autoimmun stimulációja"
            ]
        },
        "correct_answer": "A gyomorsav hiper-szekréciója, A gyulladásos válasz gátlása a gyomorfekélyekben (néma fekélyek), A GnRH és a GH csökkent pulzatilis szekréciója, A TSH-szint szekunder elnyomása",
        "explanation_en": "Glucocorticoids suppress most other major pituitary-endocrine axes, leading to secondary deficiencies of thyroid and sex hormones.",
        "explanation_hu": "A glükokortikoidok elnyomják a legtöbb más jelentős hipofízis-endokrin tengelyt, ami a pajzsmirigy- és nemi hormonok szekunder hiányához vezet."
    },
    {
        "id": "tk10_764",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which specific condition is strictly defined by the eponym 'Cushing's disease'?",
        "question_text_hu": "Melyik konkrét állapotot határozza meg szigorúan a 'Cushing-kór' eponym?",
        "options": {
            "en": [
                "Adrenal cortical hyperplasia caused by a pituitary ACTH-secreting adenoma",
                "An autonomous cortisol-secreting adrenal adenoma",
                "The presence of ectopic ACTH production by a pulmonary malignancy",
                "Hypercortisolism resulting from a primary deficiency of 21-hydroxylase"
            ],
            "hu": [
                "Hipofízis ACTH-szekretáló adenoma által okozott mellékvesekéreg-hiperplázia",
                "Autonóm kortizolszekretáló mellékvese-adenoma",
                "Tüdőmalignitás által okozott ektopiás ACTH-termelés",
                "21-hidroxiláz primer hiányából eredő hiperkortizolizmus"
            ]
        },
        "correct_answer": "Hipofízis ACTH-szekretáló adenoma által okozott mellékvesekéreg-hiperplázia",
        "explanation_en": "Cushing's syndrome is the general state; Cushing's disease refers specifically to the pituitary (central) etiology.",
        "explanation_hu": "A Cushing-szindróma az általános állapot; a Cushing-kór konkrétan a hipofízis (centrális) etiológiájára utal."
    },
    {
        "id": "tk10_765",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary biochemical mechanism behind 'Apparent Mineralocorticoid Excess' (AME) following chronic liquorice ingestion?",
        "question_text_hu": "Mi az elsődleges biokémiai mechanizmus a 'látszólagos mineralokortikoid-túlsúly' (AME) mögött krónikus medvecukor-fogyasztást követően?",
        "options": {
            "en": [
                "Inhibition of the 11-beta-hydroxysteroid dehydrogenase type 2 (11-beta-HSD2) enzyme",
                "Direct stimulation of aldosterone synthase expression in the adrenal cortex",
                "Competitive blockade of all peripheral insulin receptors",
                "Inhibition of iodine transport into the thyroid follicular cells"
            ],
            "hu": [
                "A 11-béta-hidroxiszteroid-dehidrogenáz 2-es típusú (11-béta-HSD2) enzim gátlása",
                "Az aldoszteron-szintáz expressziójának közvetlen stimulálása a mellékvesekéregben",
                "Az összes perifériás inzulinreceptor kompetitív blokádja",
                "A jód pajzsmirigy follikuláris sejtjeibe történő transzportjának gátlása"
            ]
        },
        "correct_answer": "A 11-béta-hidroxiszteroid-dehidrogenáz 2-es típusú (11-béta-HSD2) enzim gátlása",
        "explanation_en": "Normally, 11-beta-HSD2 converts active cortisol to inactive cortisone in the kidney; its inhibition allows cortisol to overwhelm the mineralocorticoid receptors.",
        "explanation_hu": "Normális esetben a 11-béta-HSD2 az aktív kortizolt inaktív kortizonná alakítja a vesében; ennek gátlása lehetővé teszi, hogy a kortizol elárassza a mineralokortikoid receptorokat."
    },
    {
        "id": "tk10_766",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why is wound healing significantly impaired in patients with chronic Cushing's syndrome?",
        "question_text_hu": "Miért jelentősen zavart a sebgyógyulás krónikus Cushing-szindrómás betegeknél?",
        "options": {
            "en": [
                "Due to the catabolic effect on collagen and inhibition of tissue regeneration",
                "Due to excessive accumulation of hemosiderin in the dermal layers",
                "Because of the complete replacement of skin cells by visceral adipose tissue",
                "Due to the overgrowth of sensory neurons into the epidermal layers"
            ],
            "hu": [
                "A kollagénre gyakorolt katabolikus hatás és a szöveti regeneráció gátlása miatt",
                "A hemosziderin túlzott felhalmozódása miatt a dermális rétegekben",
                "A bőrsejtek viscerális zsírszövetre történő teljes lecserélődése miatt",
                "A szenzoros neuronok epidermális rétegekbe történő túlnövekedése miatt"
            ]
        },
        "correct_answer": "A kollagénre gyakorolt katabolikus hatás és a szöveti regeneráció gátlása miatt",
        "explanation_en": "Cortisol's catabolic role leads to skin thinning and reduced fibroblast activity, preventing efficient repair.",
        "explanation_hu": "A kortizol katabolikus szerepe bőrvékonyodáshoz és csökkent fibroblaszt-aktivitáshoz vezet, megakadályozva a hatékony regenerációt."
    },
    {
        "id": "tk10_767",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What role does hyperinsulinism play in the characteristic fat redistribution seen in Cushing's patients?",
        "question_text_hu": "Milyen szerepet játszik a hiperinzulinizmus a Cushing-betegeknél látható jellegzetes zsíreloszlásban?",
        "options": {
            "en": [
                "It promotes regional adipogenesis causing truncal and facial obesity",
                "It shifts all peripheral fat into the skeletal muscle of the lower limbs",
                "It triggers generalized lipolysis leading to severe systemic cachexia",
                "It converts subcutaneous fat into dense fibrous connective tissue"
            ],
            "hu": [
                "Regionális adipogenezist serkent, törzsi és feji elhízást okozva",
                "Minden perifériás zsírt az alsó végtagok vázizomzatába helyez át",
                "Általános lipolízist vált ki, ami súlyos szisztémás kachexiához vezet",
                "A szubkután zsírt sűrű rostos kötőszövetté alakítja"
            ]
        },
        "correct_answer": "Regionális adipogenezist serkent, törzsi és feji elhízást okozva",
        "explanation_en": "Elevated insulin levels, responding to steroid-induced hyperglycemia, drive fat storage in insulin-sensitive depots despite systemic cortisol-driven lipolysis.",
        "explanation_hu": "A szteroid-indukált hiperglikémiára válaszul megemelkedett inzulinszint a zsírtárolást az inzulinfüggő raktárak felé tereli, a szisztémás kortizol-vezérelt lipolízis ellenére."
    },
    {
        "id": "tk10_768",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary cause of hypercalciuria and the increased risk of nephrolithiasis in Cushing's syndrome?",
        "question_text_hu": "Mi a hiperkalciuria és a megnövekedett nefrolitiázis-kockázat elsődleges oka Cushing-szindrómában?",
        "options": {
            "en": [
                "Inhibition of intestinal Ca++ absorption leading to bone resorption and increased renal filtered load",
                "Excessive endogenous production of fluoride within the salivary glands",
                "The mechanical accumulation of dietary chalk within the renal calyces",
                "A complete chronic occlusion of the renal cortical microvasculature"
            ],
            "hu": [
                "A bélből történő Ca++-felszívódás gátlása, ami csontreszorpcióhoz és megnövekedett renális filtrációs terheléshez vezet",
                "A nyálmirigyek túlzott endogén fluoridtermelése",
                "Az étrendi kréta mechanikai felhalmozódása a vesekelyhekben",
                "A vese kortikális mikrovoszkulatúrájának teljes krónikus elzáródása"
            ]
        },
        "correct_answer": "A bélből történő Ca++-felszívódás gátlása, ami csontreszorpcióhoz és megnövekedett renális filtrációs terheléshez vezet",
        "explanation_en": "Cortisol antagonizes Vitamin D, leading to secondary hyperparathyroidism and Mobilization of calcium from the bones.",
        "explanation_hu": "A kortizol antagonizálja a D-vitamint, ami szekunder hiperparatireózishoz és a kalcium csontokból történő mobilizációjához vezet."
    },
    {
        "id": "tk10_769",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why do hypokalemia and metabolic alkalosis frequently develop in severe states of cortisol excess?",
        "question_text_hu": "Miért alakul ki gyakran hipokalémia és metabolikus alkalózis súlyos kortizoltúlsúly esetén?",
        "options": {
            "en": [
                "Due to the spillover effect of cortisol on mineralocorticoid receptors resulting in K+/H+ loss",
                "Because of the excessive transdermal loss of total body potassium",
                "Due to the de novo synthesis of hydrochloric acid by the thyroid follicles",
                "As a direct compensatory response to extreme chronic dehydration"
            ],
            "hu": [
                "A kortizol mineralokortikoid receptorokra gyakorolt 'spillover' hatása miatt, ami K+/H+-vesztést eredményez",
                "A teljes testkálium túlzott transzdermális vesztése miatt",
                "A pajzsmirigy follikulusok által végzett de novo sósavszintézis miatt",
                "A krónikus extrém dehidratációra adott közvetlen kompenzatórikus válaszként"
            ]
        },
        "correct_answer": "A kortizol mineralokortikoid receptorokra gyakorolt 'spillover' hatása miatt, ami K+/H+-vesztést eredményez",
        "explanation_en": "At high concentrations, cortisol overwhelms the 11-beta-HSD2 enzyme and activates the distal nephron's mineralocorticoid receptors.",
        "explanation_hu": "Magas koncentrációban a kortizol elárasztja a 11-béta-HSD2 enzimet, és aktiválja a disztális nefron mineralokortikoid receptorait."
    },
    {
        "id": "tk10_770",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which laboratory parameter is most helpful in distinguishing primary from secondary hyperaldosteronism?",
        "question_text_hu": "Mely laboratóriumi paraméter a leghasznosabb a primer és szekunder hiperaldoszteronizmus megkülönböztetésében?",
        "options": {
            "en": [
                "Plasma renin activity (suppressed in primary, elevated in secondary)",
                "The presence of significant hyperglycemia and glycosuria",
                "The total thickness of the cranial vault on CT imaging",
                "The concentration of glucose within the cerumen of the ear"
            ],
            "hu": [
                "Plazma reninaktivitás (elnyomott a primerben, emelkedett a szekunderben)",
                "A jelentős hiperglikémia és glükózuria jelenléte",
                "A koponyatető teljes vastagsága CT-felvételen",
                "A fülzsírban (cerumen) lévő glükóz koncentrációja"
            ]
        },
        "correct_answer": "Plazma reninaktivitás (elnyomott a primerben, emelkedett a szekunderben)",
        "explanation_en": "Measuring both aldosterone and renin allows for the calculation of the ARR (aldosterone-to-renin ratio), the gold standard for diagnosis.",
        "explanation_hu": "Az aldoszteron és a renin együttes mérése lehetővé teszi az ARR (aldoszteron-renin arány) kiszámítását, ami a diagnózis aranystandardja."
    },
    {
        "id": "tk10_771",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Cushing's syndrome can be caused by long-term iatrogenic glucocorticoid administration.",
        "question_text_hu": "A Cushing-szindrómát okozhatja hosszú távú iatrogén glükokortikoid-alkalmazás.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Exogenous steroids provide the hormonal excess needed to create the phenotype while suppressing internal ACTH.",
        "explanation_hu": "Az exogén szteroidok biztosítják a fenotípus kialakulásához szükséges hormonális túlsúlyt, miközben elnyomják a belső ACTH-t."
    },
    {
        "id": "tk10_772",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "In Cushing's syndrome, both cellular phagocyte function and circulating lymphocyte counts are significantly increased.",
        "question_text_hu": "Cushing-szindrómában mind a celluláris fagocita funkció, mind a keringő limfocitaszám jelentősen megnövekedett.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "Glucocorticoids are overall immunosuppressive; they impair phagocytosis and induce lymphopenia.",
        "explanation_hu": "A glükokortikoidok összességében immunszuppresszív hatásúak; gátolják a fagocitózist és limfopéniát okoznak."
    },
    {
        "id": "tk10_773",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Polycythemia and increased blood viscosity are recognized hematological complications of chronic Cushing's syndrome.",
        "question_text_hu": "A policitémia és a megnövekedett vérviszkozitás a krónikus Cushing-szindróma elismert hematológiai szövődményei.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Glucocorticoids and associated androgens stimulate erythropoiesis in the bone marrow.",
        "explanation_hu": "A glükokortikoidok és a kapcsolódó androgének serkentik a csontvelői eritropoézist."
    },
    {
        "id": "tk10_774",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Osteoporosis in Cushing's syndrome is exacerbated by a decrease in the number of PTH-receptors on the surface of osteoclasts.",
        "question_text_hu": "A Cushing-szindróma oszteoporózisát súlyosbítja az oszteoklasztok felszínén lévő PTH-receptorok számának csökkenése.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "The number of PTH-receptors is actually UPREGULATED, making osteoclasts more responsive to bone-resorbing signals.",
        "explanation_hu": "A PTH-receptorok száma valójában FELÜLSZABÁLYOZOTT (UPREGULÁLT), ami az oszteoklasztokat érzékenyebbé teszi a csontbontó jelekre."
    },
    {
        "id": "tk10_775",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Glucocorticoids directly stimulate the expression of anti-inflammatory proteins, such as interleukin-10 (IL-10).",
        "question_text_hu": "A glükokortikoidok közvetlenül serkentik a gyulladásgátló fehérjék, például az interleukin-10 (IL-10) expresszióját.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "This gene activation is part of their complex transactivation mechanism to resolve inflammation.",
        "explanation_hu": "Ez a génaktiváció a gyulladás leállítását célzó összetett transzaktivációs mechanizmusuk része."
    },
    {
        "id": "tk10_776",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The renal 11-beta-HSD2 enzyme normally functions to transform inactive cortisone back into active cortisol.",
        "question_text_hu": "A renális 11-béta-HSD2 enzim normális esetben az inaktív kortizont alakítja vissza aktív kortizollá.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "The type 2 enzyme INACTIVATES cortisol to cortisone to protect mineralocorticoid receptors; the type 1 enzyme (liver) performs the reverse.",
        "explanation_hu": "A 2-es típusú enzim INAKTIVÁLJA a kortizolt kortizonná az MR-receptorok védelme érdekében; az 1-es típusú enzim (máj) végzi az ellenkezőjét."
    },
    {
        "id": "tk10_777",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Certain enzymatic forms of Congenital Adrenal Hyperplasia (CAH) can present with systemic hypertension.",
        "question_text_hu": "A kongenitális mellékvese-hiperplázia (CAH) bizonyos enzimatikus formái szisztémás hipertóniával jelentkezhetnek.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Both 11-beta-hydroxylase and 17-alpha-hydroxylase deficiencies lead to the accumulation of deoxycorticosterone (DOC), causing salt retention.",
        "explanation_hu": "Mind a 11-béta-hidroxiláz, mind a 17-alfa-hidroxiláz hiánya a dezoxikortikoszteron (DOC) felhalmozódásához vezet, ami sóvisszatartást okoz."
    },
    {
        "id": "tk10_778",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical sign of Cushing's syndrome with its primary underlying metabolic or structural mechanism.",
        "question_text_hu": "Párosítsa a Cushing-szindróma klinikai jelét annak elsődleges hátterében álló metabolikus vagy strukturális mechanizmusával.",
        "options": {
            "en": [
                "A) Hyperglycemia",
                "B) Buffalo hump",
                "C) Purple striae",
                "D) Ecchymoses"
            ],
            "hu": [
                "A) Hiperglikémia",
                "B) Bölénypúp",
                "C) Lila striae",
                "D) Ecchymosisok"
            ]
        },
        "items": {
            "en": [
                "1) Insulin antagonism and stimulated gluconeogenesis",
                "2) Adipogenetic effect of local hyperinsulinemia",
                "3) Catabolic breakdown of the dermal collagen matrix",
                "4) Fragility of vascular walls due to connective tissue proteolysis"
            ],
            "hu": [
                "1) Inzulin-antagonizmus és stimulált glükoneogenezis",
                "2) A lokális hiperinzulinémia adipogenetikus hatása",
                "3) A dermális kollagén mátrix katabolikus lebontása",
                "4) Az érfalak kötőszöveti proteolízis miatti törékenysége"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "The pleiotropic effects of cortisol result in a distinctive clinical phenotype across multiple organ systems.",
        "explanation_hu": "A kortizol pleiotróp hatásai jellegzetes klinikai fenotípust eredményeznek több szervrendszerben."
    },
    {
        "id": "tk10_779",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the hormone with its characteristic change in a patient with untreated Cushing's syndrome.",
        "question_text_hu": "Párosítsa a hormont annak jellegzetes változásával kezeletlen Cushing-szindrómás betegnél.",
        "options": {
            "en": [
                "A) Prolactin (PRL)",
                "B) ACTH (in cases of adrenal adenoma)",
                "C) Growth Hormone (GH)",
                "D) Erythropoietin (EPO)"
            ],
            "hu": [
                "A) Prolaktin (PRL)",
                "B) ACTH (mellékvese-adenoma esetén)",
                "C) Növekedési hormon (GH)",
                "D) Eritropoetin (EPO)"
            ]
        },
        "items": {
            "en": [
                "1) Elevated levels (partly due to hypercortisolism effects)",
                "2) Suppressed/Low levels due to negative feedback",
                "3) Decreased pulsatile secretion",
                "4) Increased stimulation (contributing to polycythemia)"
            ],
            "hu": [
                "1) Emelkedett szint (részben a hiperkortizolizmus hatásai miatt)",
                "2) Elnyomott/alacsony szint a negatív visszacsatolás miatt",
                "3) Csökkent pulzatilis szekréció",
                "4) Fokozott stimuláció (hozzájárulva a policitémiához)"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Glucocorticoid excess causes widespread secondary dysregulation across most anterior pituitary axes.",
        "explanation_hu": "A glükokortikoid-túlsúly széles körű szekunder diszregulációt okoz a legtöbb adenohipofízis-tengelyen."
    },
    {
        "id": "tk10_780",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the specific hyperaldosteronism presentation with its distinguishing clinical profile.",
        "question_text_hu": "Párosítsa a specifikus hiperaldoszteronizmus megjelenést annak megkülönböztető klinikai profiljával.",
        "options": {
            "en": [
                "A) Primary hyperaldosteronism (Conn's)",
                "B) Secondary with hypertension (Renal artery stenosis)",
                "C) Secondary with edema (Heart failure)",
                "D) Secondary physiological (Compensation for sweating)"
            ],
            "hu": [
                "A) Primer hiperaldoszteronizmus (Conn)",
                "B) Szekunder hipertóniával (veseartéria-szűkület)",
                "C) Szekunder ödémával (szívelégtelenség)",
                "D) Szekunder élettani (izzadás miatti kompenzáció)"
            ]
        },
        "items": {
            "en": [
                "1) Hypertension present, edema typically absent",
                "2) High renin, severe hypertension, absent edema",
                "3) Normal/low central BP, significant peripheral edema",
                "4) Normal BP, transient increase to restore volume"
            ],
            "hu": [
                "1) Hipertónia jelen van, ödéma tipikusan hiányzik",
                "2) Magas renin, súlyos hipertónia, hiányzó ödéma",
                "3) Normális/alacsony centrális NY, jelentős perifériás ödéma",
                "4) Normális vérnyomás, átmeneti emelkedés a térfogat helyreállítására"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Understanding the interplay of blood pressure, renin, and fluid status is key to differential diagnosis.",
        "explanation_hu": "A vérnyomás, a renin és a folyadékállapot kölcsönhatásának megértése kulcsfontosságú a differenciáldiagnózishoz."
    }
]