[
    {
        "id": "tk10_361",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hypocalcemic symptoms may develop in patients with metabolic alkalosis because the decrease in H+ concentration leads to a higher binding affinity of plasma proteins for calcium, reducing the ionized Ca++ fraction.",
        "question_text_hu": "Metabolikus alkalózisban a betegeknél hipokalcémiás tünetek jelentkezhetnek, mert a H+-koncentráció csökkenése a plazmafehérjék kalcium iránti kötődési affinitásának növekedéséhez vezet, ami csökkenti az ionizált Ca++ hányadot.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Only ionized calcium is physiologically active; protein-bound calcium cannot stabilize excitable membranes.",
        "explanation_hu": "Csak az ionizált kalcium élettanilag aktív; a fehérjéhez kötött kalcium nem tudja stabilizálni az ingerelhető membránokat."
    },
    {
        "id": "tk10_362",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Parathyroid hormone (PTH) is considered an anabolic hormone at normal plasma levels because it enhances RNA synthesis in bone tissue and promotes bone building when Vitamin D is also present.",
        "question_text_hu": "A parathormon (PTH) normális plazmaszint mellett anabolikus hormonnak tekinthető, mert fokozza az RNS-szintézist a csontszövetben, és elősegíti a csontépítést, ha D-vitamin is jelen van.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "While chronic PTH excess is catabolic, pulsatile or physiological doses support bone matrix synthesis.",
        "explanation_hu": "Míg a krónikus PTH-túlsúly katabolikus hatású, a pulzatilis vagy élettani dózisok támogatják a csontmátrix szintézisét."
    },
    {
        "id": "tk10_363",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "The kidneys play a crucial role in indirect calcium absorption from the gut because PTH stimulates the 1-alpha-hydroxylase activity in the kidney which converts Vitamin D3 into its active form, calcitriol.",
        "question_text_hu": "A vesék döntő szerepet játszanak a bélből történő közvetett kalcium-abszorpcióban, mert a PTH serkenti a vese 1-alfa-hidroxiláz aktivitását, amely a D3-vitamint aktív formájává, kalcitriollá alakítja.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Active Vitamin D (Calcitriol) is essential for the synthesis of calbindins in the intestinal mucosa.",
        "explanation_hu": "Az aktív D-vitamin (kalcitriol) alapvető fontosságú a bélnyálkahártyában zajló kalbindinek szintéziséhez."
    },
    {
        "id": "tk10_364",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "PTH-induced phosphate excretion in the proximal tubules is mediated by cAMP because its elevation decreases the PO4 permeability and reabsorption capacity of the renal tubular cells.",
        "question_text_hu": "A PTH által kiváltott foszfát-kiválasztást a proximális tubulusokban a cAMP közvetíti, mert annak emelkedése csökkenti a vese tubuláris sejtjeinek PO4-permeabilitását és reabszorpciós kapacitását.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "PTH blocks the sodium-phosphate symporter (NPT2a), leading to phosphaturia.",
        "explanation_hu": "A PTH gátolja a nátrium-foszfát szimportert (NPT2a), ami foszfaturiához vezet."
    },
    {
        "id": "tk10_365",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Vitamin D3 (Calcitriol) primarily enhances bone formation indirectly because its direct effect on bone tissue involves stimulating osteoclast-mediated resorption to expose free surface for remodeling.",
        "question_text_hu": "A D3-vitamin (kalcitriol) elsősorban közvetett módon fokozza a csontképződést, mert a csontszövetre gyakorolt közvetlen hatása az oszteoklasztok által közvetített reszorpció serkentését foglalja magában, hogy szabad felszínt biztosítson a remodellinghez.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "While Vitamin D directly activates osteoclasts, its systemic effect is bone-building due to increased calcium and phosphate availability from the gut.",
        "explanation_hu": "Bár a D-vitamin közvetlenül aktiválja az oszteoklasztokat, szisztémás hatása csontépítő a bélből származó fokozott kalcium- és foszfát-elérhetőség miatt."
    },
    {
        "id": "tk10_366",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Inflammatory states like osteoarthritis can worsen bone loss during Vitamin D supplementation because cytokines promote the transformation of macrophages into osteoclasts which carry receptors for Vitamin D.",
        "question_text_hu": "A gyulladásos állapotok, mint például az oszteoartrititisz, súlyosbíthatják a csontvesztést a D-vitamin-pótlás során, mert a citokinek elősegítik a makrofágok oszteoklaszttá való átalakulását, amelyek D-vitamin-receptorokat hordoznak.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Chronic inflammation increases the population of osteoclast precursors, which then over-respond to Vitamin D's direct lytic effect.",
        "explanation_hu": "A krónikus gyulladás növeli az oszteoklaszt-prekurzorok számát, amelyek túlzottan reagálnak a D-vitamin közvetlen litikus hatására."
    },
    {
        "id": "tk10_367",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Low serum magnesium (hypomagnesemia) can stimulate PTH secretion because Mg++ levels share similar regulatory trends with calcium in the parathyroid gland sensing mechanism.",
        "question_text_hu": "Az alacsony szérum magnéziumszint (hipomagnezémia) serkentheti a PTH szekrécióját, mert a Mg++ szintek hasonló szabályozási tendenciát mutatnak a kalciummal a mellékpajzsmirigy érzékelő mechanizmusában.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "A fall in either calcium or magnesium (within limits) triggers the release of PTH to restore homeostasis.",
        "explanation_hu": "A kalcium vagy a magnézium szintjének csökkenése (bizonyos határokon belül) kiváltja a PTH felszabadulását a homeosztázis helyreállítása érdekében."
    },
    {
        "id": "tk10_368",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Continuous administration of PTH is the standard therapy for osteoporosis because it increases RNA synthesis and alkaline phosphatase activity in osteoblasts to promote mineralization.",
        "question_text_hu": "A PTH folyamatos adagolása az oszteoporózis standard terápiája, mert fokozza az RNS-szintézist és az alkalikus foszfatáz aktivitást az oszteoblasztokban a mineralizáció elősegítése érdekében.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. hamis",
        "explanation_en": "The first statement is false. Continuous PTH is catabolic and causes bone loss. Only pulsatile administration (PTH 1-34 fragment) is anabolic and used in osteoporosis therapy.",
        "explanation_hu": "Az első állítás hamis. A folyamatos PTH-adás katabolikus hatású és csontvesztést okoz. Csak a pulzatilis alkalmazás (PTH 1-34 fragment) anabolikus hatású, és használják az oszteoporózis terápiájában."
    },
    {
        "id": "tk10_369",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following factors stimulate the secretion of parathyroid hormone (PTH)? Select all that apply.",
        "question_text_hu": "Az alábbi tényezők közül melyek serkentik a parathormon (PTH) szekrécióját? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Fall of serum Ca++",
                "Fall of serum Mg++",
                "Increase of beta-adrenergic activity",
                "Hypercalcemia",
                "High levels of 1,25-(OH)2-cholecalciferol"
            ],
            "hu": [
                "A szérum Ca++ csökkenése",
                "A szérum Mg++ csökkenése",
                "A béta-adrenerg aktivitás fokozódása",
                "Hiperkalcémia",
                "Magas 1,25-(OH)2-kolekalciferol szint"
            ]
        },
        "correct_answer": "A szérum Ca++ csökkenése, A szérum Mg++ csökkenése, A béta-adrenerg aktivitás fokozódása",
        "explanation_en": "Hypocalcemia is the primary stimulus; hypercalcemia and active vitamin D inhibit PTH release.",
        "explanation_hu": "A hipokalcémia az elsődleges inger; a hiperkalcémia és az aktív D-vitamin gátolja a PTH-felszabadulást."
    },
    {
        "id": "tk10_370",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What are the effects of Vitamin D3 (calcitriol) on physiological systems? Select all that apply.",
        "question_text_hu": "Milyen hatásai vannak a D3-vitaminnak (kalcitriol) az élettani rendszerekre? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Increases intestinal absorption of Ca++ via Calbindins",
                "Increases renal reabsorption of Ca++",
                "Increases synthesis of bone matrix proteins like osteocalcin",
                "Directly suppresses phosphate excretion in the kidney",
                "Induces rapid hypocalcemia in alkalosis"
            ],
            "hu": [
                "Fokozza a kalcium bélből való felszívódását kalbindinek révén",
                "Fokozza a kalcium vese tubuláris visszaszívását",
                "Fokozza a csontmátrix-fehérjék, pl. oszteokalcin szintézisét",
                "Közvetlenül gátolja a foszfát-kiválasztást a vesében",
                "Hirtelen hipokalcémiát vált ki alkalózisban"
            ]
        },
        "correct_answer": "Fokozza a kalcium bélből való felszívódását kalbindinek révén, Fokozza a kalcium vese tubuláris visszaszívását, Fokozza a csontmátrix-fehérjék, pl. oszteokalcin szintézisét",
        "explanation_en": "Vitamin D generally increases serum calcium and supports bone mineralization. Alkalosis affects protein binding, not Vitamin D level.",
        "explanation_hu": "A D-vitamin általánosságban növeli a szérum kalciumszintet és támogatja a csontok mineralizációját. Az alkalózis a fehérjekötődést befolyásolja, nem a D-vitamin szintjét."
    },
    {
        "id": "tk10_371",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which adaptive mechanisms occur in response to iodine deficiency? Select all that apply.",
        "question_text_hu": "Milyen adaptációs mechanizmusok jönnek létre jódhiányra válaszul? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "High TSH production leading to hypertrophy",
                "Increased T3 secretion",
                "Increased peripheral conversion of T4 to T3",
                "More avid iodide uptake by the thyroid gland",
                "Excessive release of stored thyroglobulin into the blood"
            ],
            "hu": [
                "Magas TSH-termelés, ami hipertrófiához vezet",
                "Fokozott T3-szekréció",
                "A T4-T3 perifériás konverzió fokozódása",
                "A pajzsmirigy mohóbb jód-felvétele",
                "A tárolt tireoglobulin túlzott kiáramlása a vérbe"
            ]
        },
        "correct_answer": "Magas TSH-termelés, ami hipertrófiához vezet, Fokozott T3-szekréció, A T4-T3 perifériás konverzió fokozódása, A pajzsmirigy mohóbb jód-felvétele",
        "explanation_en": "The gland adapts by becoming more efficient and favoring the more active hormone (T3).",
        "explanation_hu": "A mirigy úgy adaptálódik, hogy hatékonyabbá válik, és a nagyobb aktivitású hormon (T3) termelését részesíti előnyben."
    },
    {
        "id": "tk10_372",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What proteins produced in the bone tissue are regulated by Vitamin D? Select all that apply.",
        "question_text_hu": "Milyen csontszövetben termelődő fehérjéket szabályoz a D-vitamin? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Osteocalcin",
                "Osteopontin",
                "Alkaline phosphatase",
                "Calbindin-D28k",
                "Casein"
            ],
            "hu": [
                "Oszteokalcin",
                "Oszteopontin",
                "Alkalikus foszfatáz",
                "Kalbindin-D28k",
                "Kazein"
            ]
        },
        "correct_answer": "Oszteokalcin, Oszteopontin, Alkalikus foszfatáz",
        "explanation_en": "Calbindin is intestinal/renal; osteocalcin and osteopontin are matrix proteins regulated by Vitamin D in bone.",
        "explanation_hu": "A kalbindin intestinális/renális; az oszteokalcin és az oszteopontin csont-mátrix fehérjék, amelyeket a D-vitamin szabályoz a csontban."
    },
    {
        "id": "tk10_373",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following describes the distribution of calcium in the blood? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyek írják le a kalcium megoszlását a vérben? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Approximately 50% is ionized (Ca++)",
                "Approximately 1.2 mmol/liter is bound to proteins",
                "Total serum calcium is normally 2.1-2.6 mmol/liter",
                "Most calcium in the blood is found as insoluble crystals",
                "Only protein-bound calcium possesses electrophysiologic activity"
            ],
            "hu": [
                "Körülbelül 50% ionizált (Ca++)",
                "Körülbelül 1,2 mmol/liter fehérjékhez kötött",
                "A teljes szérum kalcium normálisan 2,1-2,6 mmol/liter",
                "A vérben lévő kalcium nagy része oldhatatlan kristályok formájában van",
                "Csak a fehérjéhez kötött kalcium rendelkezik elektrofiziológiai aktivitással"
            ]
        },
        "correct_answer": "Körülbelül 50% ionizált (Ca++), Körülbelül 1,2 mmol/liter fehérjékhez kötött, A teljes szérum kalcium normálisan 2,1-2,6 mmol/liter",
        "explanation_en": "Only ionized calcium (Ca++) is active and able to stabilize cell membranes.",
        "explanation_hu": "Csak az ionizált kalcium (Ca++) aktív, és képes stabilizálni a sejtmembránokat."
    },
    {
        "id": "tk10_374",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the primary stimulus for the secretion of parathyroid hormone (PTH)?",
        "question_text_hu": "Mi a parathormon (PTH) szekréciójának elsődleges ingere?",
        "options": {
            "en": [
                "Fall of serum ionized Ca++",
                "Increase in serum PO4",
                "Rise of serum magnesium",
                "Increase in Vitamin D levels"
            ],
            "hu": [
                "Az ionizált szérum kalciumszint csökkenése",
                "A szérum foszfátszint emelkedése",
                "A szérum magnéziumszint emelkedése",
                "A D-vitamin-szint emelkedése"
            ]
        },
        "correct_answer": "Az ionizált szérum kalciumszint csökkenése",
        "explanation_en": "Hypocalcemia is the main physiological trigger for PTH release.",
        "explanation_hu": "A hipokalcémia a PTH-felszabadulás fő élettani kiváltója."
    },
    {
        "id": "tk10_375",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "How does PTH affect phosphate metabolism in the kidney?",
        "question_text_hu": "Hogyan hat a PTH a foszfát-anyagcserére a vesében?",
        "options": {
            "en": [
                "Increases PO4 excretion in the proximal tubules",
                "Increases PO4 reabsorption in the distal tubules",
                "Decreases PO4 permeability in all tubules",
                "Directly stimulates PO4 synthesis in the liver"
            ],
            "hu": [
                "Fokozza a foszfát-kiválasztást a proximális tubulusokban",
                "Fokozza a foszfát-visszaszívást a távoli tubulusokban",
                "Csökkenti a foszfát-permeabilitást minden tubulusban",
                "Közvetlenül serkenti a foszfát-szintézist a májban"
            ]
        },
        "correct_answer": "Fokozza a foszfát-kiválasztást a proximális tubulusokban",
        "explanation_en": "PTH is a phosphaturic hormone; it lowers serum phosphate by preventing its reabsorption.",
        "explanation_hu": "A PTH egy foszfaturikus hormon; csökkenti a szérum foszfátszintet azáltal, hogy megakadályozza annak visszaszívódását."
    },
    {
        "id": "tk10_376",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which enzyme in the kidney is stimulated by PTH to activate Vitamin D?",
        "question_text_hu": "Melyik veseenzimet serkenti a PTH a D-vitamin aktiválása érdekében?",
        "options": {
            "en": [
                "1-alpha-hydroxylase",
                "24-hydroxylase",
                "Alkaline phosphatase",
                "Renin"
            ],
            "hu": [
                "1-alfa-hidroxiláz",
                "24-hidroxiláz",
                "Alkalikus foszfatáz",
                "Renin"
            ]
        },
        "correct_answer": "1-alfa-hidroxiláz",
        "explanation_en": "This enzyme completes the conversion into calcitriol (1,25-(OH)2-D3).",
        "explanation_hu": "Ez az enzim fejezi be a kalcitriollá (1,25-(OH)2-D3) történő átalakítást."
    },
    {
        "id": "tk10_377",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the effect of Vitamin D3 on intestinal mucosa?",
        "question_text_hu": "Mi a D3-vitamin hatása a bélnyálkahárártyára?",
        "options": {
            "en": [
                "Induces synthesis of Calbindins to increase Ca++ absorption",
                "Inhibits phosphate transporters to keep serum levels stable",
                "Activates ATPase to secrete Ca++ into the gut lumen",
                "Binds to proteins to prevent H+ displacement"
            ],
            "hu": [
                "Indukálja a kalbindinek szintézisét a kalcium-felszívódás fokozása érdekében",
                "Gátolja a foszfát-transzportereket a szérumszint stabilitása érdekében",
                "Aktiválja az ATP-ázt a kalcium bélüregbe történő szekretálásához",
                "Fehérjékhez kötődik a H+ kiszorításának megakadályozása érdekében"
            ]
        },
        "correct_answer": "Indukálja a kalbindinek szintézisét a kalcium-felszívódás fokozása érdekében",
        "explanation_en": "Calbindins are specialized transport proteins that carry calcium across the enterocytes.",
        "explanation_hu": "A kalbindinek speciális transzportfehérjék, amik átjuttatják a kalciumot az enterocitákon."
    },
    {
        "id": "tk10_378",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "In what physiological state does protein binding of calcium increase, potentially leading to tetany?",
        "question_text_hu": "Milyen élettani állapotban fokozódik a kalcium fehérjekötődése, ami potenciálisan tetániához vezet?",
        "options": {
            "en": [
                "Alkalosis",
                "Acidosis",
                "Hypercalcemia",
                "Iodine deficiency"
            ],
            "hu": [
                "Alkalózis",
                "Acidózis",
                "Hiperkalcémia",
                "Jódhiány"
            ]
        },
        "correct_answer": "Alkalózis",
        "explanation_en": "As pH rises (alkalosis), proteins lose H+ ions and gain open sites for Ca++, lowering free ionized levels.",
        "explanation_hu": "A pH emelkedésével (alkalózis) a fehérjék H+-ionokat veszítenek, és szabad helyek keletkeznek a Ca++ számára, ami csökkenti a szabad ionizált szintet."
    },
    {
        "id": "tk10_379",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "What is the primary stimulus that inhibits the secretion of PTH?",
        "question_text_hu": "Mi a PTH szekrécióját gátló elsődleges inger?",
        "options": {
            "en": [
                "Hypercalcemia (High serum Ca++)",
                "Low magnesium levels",
                "High phosphate levels",
                "Catecholamines via beta receptors"
            ],
            "hu": [
                "Hiperkalcémia (magas szérum kalciumszint)",
                "Alacsony magnéziumszint",
                "Magas foszfátszint",
                "Katekolaminok béta-receptorokon keresztül"
            ]
        },
        "correct_answer": "Hiperkalcémia (magas szérum kalciumszint)",
        "explanation_en": "Rising calcium levels act via negative feedback on the calcium-sensing receptors of parathyroid cells.",
        "explanation_hu": "Az emelkedő kalciumszint a mellékpajzsmirigy sejtjeinek kalcium-érzékelő receptorain keresztül negatív visszacsatolással hat."
    },
    {
        "id": "tk10_380",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Osteocalcin is a Vitamin D-dependent bone matrix protein that also requires which other vitamin?",
        "question_text_hu": "Az oszteokalcin egy D-vitamin-függő csontmátrix-fehérje, amelyhez melyik másik vitaminra is szükség van?",
        "options": {
            "en": [
                "Vitamin K",
                "Vitamin A",
                "Vitamin C",
                "Vitamin B12"
            ],
            "hu": [
                "K-vitamin",
                "A-vitamin",
                "C-vitamin",
                "B12-vitamin"
            ]
        },
        "correct_answer": "K-vitamin",
        "explanation_en": "Osteocalcin is a gamma-carboxyglutamic acid-containing protein, whose synthesis is Vitamin K-dependent.",
        "explanation_hu": "Az oszteokalcin egy gamma-karboxiglutaminsav-tartalmú fehérje, amelynek szintézise K-vitamin-függő."
    },
    {
        "id": "tk10_381",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why can Vitamin D3 show a 'lytic' effect on bone tissue?",
        "question_text_hu": "Miért mutathat a D3-vitamin 'litikus' hatást a csontszöveten?",
        "options": {
            "en": [
                "Receptors are present on immature osteoclasts",
                "It directly dissolves hydroxyapatite crystals",
                "It inhibits the alkaline phosphatase enzyme",
                "It prevents the synthesis of collagen matrix"
            ],
            "hu": [
                "Receptorai jelen vannak az éretlen oszteoklasztokon",
                "Közvetlenül feloldja a hidroxiapatit kristályokat",
                "Gátolja az alkalikus foszfatáz enzimet",
                "Megakadályozza a kollagén mátrix szintézisét"
            ]
        },
        "correct_answer": "Receptorai jelen vannak az éretlen oszteoklasztokon",
        "explanation_en": "Vitamin D can induce bone resorption in certain contexts to facilitate remodeling.",
        "explanation_hu": "A D-vitamin bizonyos kontextusokban képes csontreszorpciót indukálni a remodelling elősegítése érdekében."
    },
    {
        "id": "tk10_382",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "At what serum level does hypercalcemia typically start giving clinical symptoms?",
        "question_text_hu": "Melyik szérumszint felett kezd a hiperkalcémia jellemzően klinikai tüneteket adni?",
        "options": {
            "en": [
                "Above 5.0 mmol/liter",
                "Above 2.6 mmol/liter",
                "Below 1.5 mmol/liter",
                "Exactly at 2.1 mmol/liter"
            ],
            "hu": [
                "5,0 mmol/liter felett",
                "2,6 mmol/liter felett",
                "1,5 mmol/liter alatt",
                "Pontosan 2,1 mmol/liter-nél"
            ]
        },
        "correct_answer": "5,0 mmol/liter felett",
        "explanation_en": "While 2.6 is the upper normal limit, severe clinical symptoms usually emerge above 5.0.",
        "explanation_hu": "Bár a 2,6 a normál felső határ, a súlyos klinikai tünetek általában 5,0 felett jelentkeznek."
    },
    {
        "id": "tk10_383",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "How does pulsatile PTH administration differ from continuous PTH effect in bone?",
        "question_text_hu": "Miben különbözik a pulzatilis PTH-kezelés a folyamatos PTH-hatástól a csontban?",
        "options": {
            "en": [
                "Pulsatile is anabolic (builds bone), continuous is catabolic (resorbs bone)",
                "Pulsatile inhibits Vitamin D, continuous activates it",
                "Pulsatile causes magnesium loss, continuous prevents it",
                "There is no difference in their bone effects"
            ],
            "hu": [
                "A pulzatilis anabolikus (csontépítő), a folyamatos katabolikus (csontreszorbeáló)",
                "A pulzatilis gátolja a D-vitamint, a folyamatos aktiválja",
                "A pulzatilis magnéziumvesztést okoz, a folyamatos megakadályozza",
                "Nincs különbség a csontra gyakorolt hatásukban"
            ]
        },
        "correct_answer": "A pulzatilis anabolikus (csontépítő), a folyamatos katabolikus (csontreszorbeáló)",
        "explanation_en": "Dynamic dosing of PTH 1-34 promotes osteoblast activity over osteoclasts.",
        "explanation_hu": "A PTH 1-34 dinamikus adagolása az oszteoblaszt-aktivitást serkenti az oszteoklasztokkal szemben."
    },
    {
        "id": "tk10_384",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which enzyme's expression is enhanced by Vitamin D to promote bone mineralization?",
        "question_text_hu": "Melyik enzim expresszióját fokozza a D-vitamin a csont mineralizációjának elősegítése érdekében?",
        "options": {
            "en": [
                "Alkaline phosphatase",
                "Tyrosine hydroxylase",
                "1-alpha-hydroxylase",
                "ATPase"
            ],
            "hu": [
                "Alkalikus foszfatáz",
                "Tirozin-hidroxiláz",
                "1-alfa-hidroxiláz",
                "ATP-áz"
            ]
        },
        "correct_answer": "Alkalikus foszfatáz",
        "explanation_en": "Alkaline phosphatase is essential for creating the local phosphate environment needed for hydroxyapatite deposition.",
        "explanation_hu": "Az alkalikus foszfatáz alapvető fontosságú a hidroxiapatit-lerakódáshoz szükséges helyi foszfátkörnyezet létrehozásához."
    },
    {
        "id": "tk10_385",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What happens if both iodide deficiency and protein-calorie malnutrition are present?",
        "question_text_hu": "Mi történik, ha a jódhiány és a fehérje-kalória alultápláltság egyszerre van jelen?",
        "options": {
            "en": [
                "Goiter development is worsened due to lack of thyroglobulin substrate",
                "Goiter development is prevented because TSH cannot rise",
                "The thyroid gland spontaneously regresses to normal size",
                "Hyperthyroidism develops due to low protein binding"
            ],
            "hu": [
                "A golyva kialakulása súlyosbodik a tireoglobulin-szubsztrát hiánya miatt",
                "A golyva kialakulása gátolt, mert a TSH nem tud emelkedni",
                "A pajzsmirigy spontán visszafejlődik normál méretűre",
                "Hipertireózis alakul ki az alacsony fehérjekötődés miatt"
            ]
        },
        "correct_answer": "A golyva kialakulása súlyosbodik a tireoglobulin-szubsztrát hiánya miatt",
        "explanation_en": "The inability to synthesize the scaffold protein prevents adequate adaptation to low iodine.",
        "explanation_hu": "A vázfehérje szintézisére való képtelenség megakadályozza az alacsony jódszinthez való megfelelő alkalmazkodást."
    },
    {
        "id": "tk10_386",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Ionized Ca++ fraction represents roughly 1.3 mmol/liter in normal plasma.",
        "question_text_hu": "Az ionizált kalcium hányad körülbelül 1,3 mmol/litert tesz ki normál plazmában.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Ionized calcium is approximately half of the total serum calcium.",
        "explanation_hu": "Az ionizált kalcium a teljes szérumkalcium-szint körülbelül felét teszi ki."
    },
    {
        "id": "tk10_387",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "PTH indirectly increases Ca++ absorption from the gut by activating Vitamin D in the kidney.",
        "question_text_hu": "A PTH közvetve növeli a kalcium-felszívódást a bélből a D-vitamin vesében történő aktiválásával.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "PTH stimulates the conversion of calcidiol to calcitriol, which then acts on the gut.",
        "explanation_hu": "A PTH serkenti a kalcidiol kalcitriollá történő átalakulását, ami aztán a bélben fejti ki hatását."
    },
    {
        "id": "tk10_388",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Total body calcium is approximately 1100 g, with 99% stored in the bone tissue.",
        "question_text_hu": "A test teljes kalciumtartalma körülbelül 1100 g, amelynek 99%-a a csontszövetben tárolódik.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "The bone system serves as the primary reservoir for calcium homeostasis.",
        "explanation_hu": "A csontrendszer a kalcium-homeosztázis elsődleges raktáraként szolgál."
    },
    {
        "id": "tk10_389",
        "type": "matching",
        "bloom_level": 2,
        "question_text_en": "Match the hormone with its primary stimulator.",
        "question_text_hu": "Párosítsa a hormont annak elsődleges ingerével.",
        "options": {
            "en": [
                "A) PTH",
                "B) Calcitriol (active D3)",
                "C) Calcitonin",
                "D) Alkaline Phosphatase (enzyme)"
            ],
            "hu": [
                "A) PTH",
                "B) Kalcitriol (aktív D3)",
                "C) Kalcitonin",
                "D) Alkalikus foszfatáz (enzim)"
            ]
        },
        "items": {
            "en": [
                "1) Low serum ionized Ca++",
                "2) High serum PTH and low PO4",
                "3) High serum Ca++",
                "4) Vitamin D activation in bone"
            ],
            "hu": [
                "1) Alacsony ionizált szérum kalciumszint",
                "2) Magas szérum PTH és alacsony foszfátszint",
                "3) Magas szérum kalciumszint",
                "4) D-vitamin aktiváció a csontban"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Hormonal feedback loops maintain tight control over blood mineral levels.",
        "explanation_hu": "Hormonális visszacsatolási körök tartják szoros ellenőrzés alatt a vér ásványianyag-szintjeit."
    },
    {
        "id": "tk10_390",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the Vitamin D effect with its location.",
        "question_text_hu": "Párosítsa a D-vitamin hatását annak helyszínével.",
        "options": {
            "en": [
                "A) Calbindin synthesis",
                "B) Osteocalcin synthesis",
                "C) VDR-RXR receptor activation",
                "D) 1-alpha-hydroxylase activation"
            ],
            "hu": [
                "A) Kalbindin szintézis",
                "B) Oszteokalcin szintézis",
                "C) VDR-RXR receptor aktiváció",
                "D) 1-alfa-hidroxiláz aktiváció"
            ]
        },
        "items": {
            "en": [
                "1) Intestinal mucosa and Kidney",
                "2) Bone matrix",
                "3) Target cell nucleus",
                "4) Kidney tubules"
            ],
            "hu": [
                "1) Bélnyálkahártya és vese",
                "2) Csontmátrix",
                "3) Célszövet sejtmagja",
                "4) Vese tubulusok"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Vitamin D functions as a nuclear hormone affecting multiple tissues simultaneously.",
        "explanation_hu": "A D-vitamin nukleáris hormonként működik, több szövetet is érintve egyidejűleg."
    }
]