[
    {
        "id": "tk10_541",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Chronic immobilization leads to significant bone resorption within 1-2 weeks because the lack of muscle function prevents the piezo-electric activation of osteoblasts.",
        "question_text_hu": "A krónikus immobilizáció (például ágyhoz kötöttség) 1-2 héten belül jelentős csontreszorpcióhoz vezet, mivel az izomműködés hiánya megakadályozza az oszteoblasztok piezoelektromos aktivációját.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Mechanical load and muscle pull generate electrical signals that stimulate bone-building cells.",
        "explanation_hu": "A mechanikai terhelés és az izomhúzás olyan elektromos jeleket generál, amelyek serkentik a csontépítő sejteket."
    },
    {
        "id": "tk10_542",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "The 'female athlete triad' is particularly dangerous during adolescence because suppressed gonadal activity prevents the attainment of expected peak bone mass.",
        "question_text_hu": "A „női sportoló triász” (anorexia, amenorrhoea, oszteoporózis) különösen veszélyes serdülőknél, mivel az elnyomott gonadális aktivitás megakadályozza a várt csúcs-csonttömeg elérését.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Sex steroids and proper nutrition are essential during the window of highest bone density development.",
        "explanation_hu": "A szexszteroidok és a megfelelő táplálkozás elengedhetetlenek a csontsűrűség legintenzívebb fejlődésének időszakában."
    },
    {
        "id": "tk10_543",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Prolonged steroid treatment in children may cause growth retardation because it suppresses osteoblast activity and decreases intestinal calcium absorption.",
        "question_text_hu": "A gyermekek tartós szteroidkezelése növekedési retardációt okozhat, mivel elnyomja az oszteoblasztok aktivitását és csökkenti a bélrendszeri kalciumfelszívódást.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The combined effect on osteoblast activity and Ca balance leads to profound skeletal development failure.",
        "explanation_hu": "Az oszteoblaszt-aktivitásra és a Ca-egyensúlyra gyakorolt együttes hatás a csontváz fejlődésének súlyos zavarához vezet."
    },
    {
        "id": "tk10_544",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Diabetes mellitus significantly increases the risk of osteoporosis because chronic hyperglycemia leads to the glycation of collagen in the bone matrix, impairing its structural integrity.",
        "question_text_hu": "A Diabetes mellitus hozzájárul az oszteoporózis kockázatához, mivel a krónikus hiperglikémia a csontmátrix kollagénjének glikációjához vezet, rontva annak strukturális integritását.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Non-enzymatic glycation cross-links the matrix, making it more brittle and reducing turnover quality.",
        "explanation_hu": "A nem enzimatikus glikáció keresztkötéseket hoz létre a mátrixban, törékenyebbé téve azt és rontva a turnover minőségét."
    },
    {
        "id": "tk10_545",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "In postmenopausal (type-1) osteoporosis, vertebral compression fractures occur predominantly on the ventral side because the dorsal vertebral processes provide greater local stability.",
        "question_text_hu": "Posztmenopauzális (1-es típusú) oszteoporózisban a csigolyatömörüléses törések főként a csigolyatestek ventrális oldalán fordulnak elő, mivel a dorzális csigolyanyúlványok nagyobb helyi stabilitást biztosítanak.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The spongy bone of the vertebral body is most susceptible to eccentric load-bearing failure.",
        "explanation_hu": "A csigolyatest szivacsos csontállománya a legérzékenyebb az excentrikus terhelés miatti károsodásra."
    },
    {
        "id": "tk10_546",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Severe vertebral compression fractures can lead to paralytic ileus because significant bleeding from the fracture site may occur toward the retroperitoneum.",
        "question_text_hu": "A súlyos csigolyatömörüléses törések paralitikus ileushoz vezethetnek, mivel a törés helyéről jelentős vérzés következhet be a retroperitóneum felé.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Retroperitoneal hematomas can irritate the autonomic nerves and the bowel, leading to cessation of motility.",
        "explanation_hu": "A retroperitoneális hematómák irritálhatják a vegetatív idegeket és a beleket, ami a motilitás megszűnéséhez vezet."
    },
    {
        "id": "tk10_547",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Vitamin C deficiency interferes with bone strength because it is a necessary cofactor for the prolyl- and lysyl-hydroxylase enzymes required for stable collagen alpha-helix formation.",
        "question_text_hu": "A C-vitamin hiánya zavarja a csontszilárdságot, mivel ez az enzim kofaktora a stabil kollagén alfa-hélixet létrehozó prolyl- és lysyl-hidroxiláznak.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Hydroxylation is essential for the cross-linking and triple helix stability of collagen matrix.",
        "explanation_hu": "A hidroxilálás elengedhetetlen a kollagénmátrix keresztkötéseihez és a tripla hélix stabilitásához."
    },
    {
        "id": "tk10_548",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hyperthyroidism accelerates the development of osteoporosis because excess thyroxine enhances both bone production and resorption while shifting the net balance towards resorption.",
        "question_text_hu": "A hipertireózis felgyorsítja az oszteoporózis kialakulását, mivel a felesleges tiroxin mind a csontképzést, mind a reszorpciót fokozza, a nettó egyensúlyt pedig a reszorpció irányába tolja el.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "High-turnover bone loss is a classic complication of sustained thyroid hormone excess.",
        "explanation_hu": "A fokozott anyagcserével járó csontvesztés a tartós pajzsmirigyhormon-túlsúly klasszikus szövődménye."
    },
    {
        "id": "tk10_549",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which endocrine disorders are well-known to contribute to secondary osteoporosis? Select all that apply.",
        "question_text_hu": "Mely endokrin betegségek járulnak hozzá bizonyítottan a szekunder oszteoporózishoz? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Cushing's disease (steroid excess)",
                "Hypogonadism (in both sexes)",
                "Diabetes mellitus",
                "Hyperthyroidism",
                "Isolated growth hormone excess (Gigantism)"
            ],
            "hu": [
                "Cushing-kór (szteroid-túlsúly)",
                "Hipogonadizmus (mindkét nemnél)",
                "Diabetes mellitus",
                "Hipertireózis",
                "Izolált növekedési hormon túlsúly (gigantizmus)"
            ]
        },
        "correct_answer": "Cushing-kór (szteroid-túlsúly), Hipogonadizmus (mindkét nemnél), Diabetes mellitus, Hipertireózis",
        "explanation_en": "Gigantism usually involves bone growth; it is not a primary cause of osteoporosis.",
        "explanation_hu": "A gigantizmus általában csontnövekedéssel jár, nem tartozik az oszteoporózis elsődleges okai közé."
    },
    {
        "id": "tk10_550",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which groups are particularly at risk for 'female athlete triad' related bone loss? Select all that apply.",
        "question_text_hu": "Mely csoportok veszélyeztetettek különösen a „női sportoló triász” okozta csontvesztés tekintetében? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Gymnasts and figure skaters",
                "Triathletes and marathon runners",
                "Wrestlers and boxers (with weight classes)",
                "Professional swimmers (no weight impact)",
                "Adolescent girls with excessive training and low weight"
            ],
            "hu": [
                "Tornászok és műkorcsolyázók",
                "Triatlonisták és maratonfutók",
                "Birkózók és bokszolók (súlycsoportokkal)",
                "Professzionális úszók (súlyhatás nélkül)",
                "Serdülő lányok túlzott edzéssel és alacsony testsúllyal"
            ]
        },
        "correct_answer": "Tornászok és műkorcsolyázók, Triatlonisták és maratonfutók, Birkózók és bokszolók (súlycsoportokkal), Serdülő lányok túlzott edzéssel és alacsony testsúllyal",
        "explanation_en": "Sports where low body weight is a competitive advantage or evaluated by judges carry higher risks.",
        "explanation_hu": "Azok a sportágak, ahol az alacsony testsúly versenyelőny vagy a bírók értékelik, magasabb kockázatot hordoznak."
    },
    {
        "id": "tk10_551",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What are the common skeletal consequences of Type-1 (postmenopausal) osteoporosis? Select all that apply.",
        "question_text_hu": "Melyek az 1-es típusú (posztmenopauzális) oszteoporózis gyakori csontrendszeri következményei? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Vertebral compression (widow's hump)",
                "Wrist fractures (Colles' fracture)",
                "Femoral neck fractures (life-threatening)",
                "Aching back and sudden tearing pain",
                "Localized hyperostosis of the frontal bone"
            ],
            "hu": [
                "Csigolyatömörülés (özvegypúp)",
                "Csuklótörések (Colles-törés)",
                "Combnyaktörések (életveszélyes)",
                "Hátfájás és hirtelen tépő fájdalom",
                "A homlokcsont lokalizált hiperosztózisa"
            ]
        },
        "correct_answer": "Csigolyatömörülés (özvegypúp), Csuklótörések (Colles-törés), Combnyaktörések (életveszélyes), Hátfájás és hirtelen tépő fájdalom",
        "explanation_en": "Hyperostosis (bone thickening) is the opposite of the thinning seen in osteoporosis.",
        "explanation_hu": "A hiperosztózis (csontvastagodás) az oszteoporózisban látható vékonyodás ellentéte."
    },
    {
        "id": "tk10_552",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which nutrients (vitamins and trace elements) are necessary for collagen and matrix synthesis? Select all that apply.",
        "question_text_hu": "Mely tápanyagok (vitaminok és nyomelemek) szükségesek a kollagén- és mátrixszintézishez? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Vitamin C (for hydroxylases)",
                "Vitamin A (for mucopolysaccharides)",
                "Copper (Cu++)",
                "Vitamin B12 (for matrix mineralization)",
                "Iron (Fe++)"
            ],
            "hu": [
                "C-vitamin (a hidroxilázokhoz)",
                "A-vitamin (a mukopoliszacharidokhoz)",
                "Réz (Cu++)",
                "B12-vitamin (a mátrix mineralizációjához)",
                "Vas (Fe++)"
            ]
        },
        "correct_answer": "C-vitamin (a hidroxilázokhoz), A-vitamin (a mukopoliszacharidokhoz), Réz (Cu++)",
        "explanation_en": "While Vitamin B12 and Iron are important for overall health, they are not direct structural requirements for the bone matrix.",
        "explanation_hu": "Bár a B12-vitamin és a vas fontosak az általános egészséghez, nem tartoznak a csontmátrix közvetlen strukturális feltételei közé."
    },
    {
        "id": "tk10_553",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "What is the recommended calcium intake for individuals with lactose intolerance or milk allergy? Select all that apply.",
        "question_text_hu": "Milyen kalciumbeviteli lehetőségek javasoltak laktózérzékenység vagy tejallergia esetén? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Lactose intolerant: fermented products (yoghurt, kefir, hard cheese)",
                "Milk allergy: oilseeds (sesame, poppy, nuts)",
                "Avoid processed cheese (high phosphate content)",
                "Spinach (as the primary source)",
                "Skimmed milk regardless of intolerance"
            ],
            "hu": [
                "Laktózérzékenység: fermentált termékek (joghurt, kefir, kemény sajt)",
                "Tejallergia: olajos magvak (szezámmag, mák, dió)",
                "Ömlesztett sajtok kerülése (magas foszfáttartalom)",
                "Spenót (elsődleges forrásként)",
                "Sovány tej az intoleranciától függetlenül"
            ]
        },
        "correct_answer": "Laktózérzékenység: fermentált termékek (joghurt, kefir, kemény sajt), Tejallergia: olajos magvak (szezámmag, mák, dió), Ömlesztett sajtok kerülése (magas foszfáttartalom)",
        "explanation_en": "Spinach contains oxalates and phytates that hinder calcium absorption.",
        "explanation_hu": "A spenót oxalátokat és fitátokat tartalmaz, amelyek gátolják a kalcium felszívódását."
    },
    {
        "id": "tk10_554",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "How does smoking primarily affect bone health according to clinical observations?",
        "question_text_hu": "Hogyan befolyásolja a dohányzás elsősorban a csontok egészségét a klinikai megfigyelések szerint?",
        "options": {
            "en": [
                "Strongly accelerates osteoporosis",
                "Directly inhibits the pituitary gland",
                "Prevents the production of vitamin A",
                "Causes local vasoconstriction in the femora"
            ],
            "hu": [
                "Erősen felgyorsítja az oszteoporózist",
                "Közvetlenül gátolja az agyalapi mirigyet",
                "Megakadályozza az A-vitamin termelését",
                "Helyi érszűkületet okoz a combcsontokban"
            ]
        },
        "correct_answer": "Erősen felgyorsítja az oszteoporózist",
        "explanation_en": "Smoking is a major lifestyle risk factor that significantly speeds up bone loss.",
        "explanation_hu": "A dohányzás jelentős életmódbeli kockázati tényező, amely számottevően felgyorsítja a csontvesztést."
    },
    {
        "id": "tk10_555",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary skeletal consequence of weightlessness or extreme immobilization?",
        "question_text_hu": "Mi a vázrendszer elsődleges következménye súlytalanság vagy extrém immobilizáció esetén?",
        "options": {
            "en": [
                "Significant bone resorption within 1-2 weeks",
                "Increased bone density for protection",
                "Sudden calcification of the skull",
                "Total loss of the bone marrow cavity"
            ],
            "hu": [
                "Jelentős csontreszorpció 1-2 héten belül",
                "Fokozott csontsűrűség a védelem érdekében",
                "A koponya hirtelen elmeszesedése",
                "A csontvelőüreg teljes elvesztése"
            ]
        },
        "correct_answer": "Jelentős csontreszorpció 1-2 héten belül",
        "explanation_en": "Physical load and muscle contraction are essential for maintaining bone structure.",
        "explanation_hu": "A fizikai terhelés és az izomösszehúzódás elengedhetetlen a csontszerkezet fenntartásához."
    },
    {
        "id": "tk10_556",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which fracture is considered a life-threatening state in the context of osteoporosis?",
        "question_text_hu": "Melyik törés tekintendő életveszélyes állapotnak az oszteoporózis összefüggésében?",
        "options": {
            "en": [
                "Fracture of the femoral neck",
                "Wrist fracture (Colles)",
                "Vertebral compression fracture",
                "Fracture of the phalanges"
            ],
            "hu": [
                "Combnyaktörés",
                "Csuklótörés (Colles-törés)",
                "Csigolyatömörülés",
                "Ujjperctörés"
            ]
        },
        "correct_answer": "Combnyaktörés",
        "explanation_en": "Femoral neck fractures in elderly patients often lead to high mortality due to complications like sepsis or embolism.",
        "explanation_hu": "Idős betegeknél a combnyaktörések gyakran magas mortalitáshoz vezetnek olyan szövődmények miatt, mint a szepszis vagy az embólia."
    },
    {
        "id": "tk10_557",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What metabolic mechanism explains why steroids induce cystic rarefactions in bone?",
        "question_text_hu": "Milyen metabolikus mechanizmus magyarázza, hogy a szteroidok cisztikus ritkulást okoznak a csontban?",
        "options": {
            "en": [
                "Lowered calcium absorption inducing compensatory PTH rise",
                "Direct stimulation of vitamin D receptors",
                "Complete block of the pituitary-adrenal axis",
                "Increased storage of copper in the bone matrix"
            ],
            "hu": [
                "Csökkent kalciumfelszívódás, ami kompenzáló PTH-emelkedést vált ki",
                "A D-vitamin-receptorok közvetlen stimulálása",
                "A hipofízis-mellékvese-tengely teljes blokádja",
                "Fokozott réztárolás a csontmátrixban"
            ]
        },
        "correct_answer": "Csökkent kalciumfelszívódás, ami kompenzáló PTH-emelkedést vált ki",
        "explanation_en": "Steroid interference with Vitamin D function in the gut leads to secondary hyperparathyroidism.",
        "explanation_hu": "A szteroidok bélrendszeri D-vitamin-funkcióra gyakorolt hatása szekunder hiperparatireózishoz vezet."
    },
    {
        "id": "tk10_558",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What does a 'widow's hump' signify in an elderly woman?",
        "question_text_hu": "Mit jelez az „özvegypúp” egy idős nőnél?",
        "options": {
            "en": [
                "Deformed thoracic spine due to vertebral compression",
                "Increased muscle mass in the upper back",
                "A tumor of the posterior mediastinum",
                "Excessive skin growth on the neck"
            ],
            "hu": [
                "Deformált háti gerinc csigolyatömörülés miatt",
                "Fokozott izomtömeg a hát felső részén",
                "A hátsó gátor (mediastinum) daganata",
                "Túlzott bőrnövekedés a nyakon"
            ]
        },
        "correct_answer": "Deformált háti gerinc csigolyatömörülés miatt",
        "explanation_en": "Thoracic kyphosis results from accumulated micro-fractures of the vertebral bodies.",
        "explanation_hu": "A háti kifózis a csigolyatestek felhalmozódott mikro-fraktúráinak következménye."
    },
    {
        "id": "tk10_559",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "How does Fanconi syndrome relate to bone health?",
        "question_text_hu": "Hogyan kapcsolódik a Fanconi-szindróma a csontok egészségéhez?",
        "options": {
            "en": [
                "It causes real calciuria of renal origin",
                "It increases intestinal calcium absorption",
                "It triggers massive bone formation in the limbs",
                "It blocks the action of parathyroid hormone"
            ],
            "hu": [
                "Valódi renális eredetű kalciuriát okoz",
                "Fokozza a bélrendszeri kalciumfelszívódást",
                "Masszív csontképződést vált ki a végtagokban",
                "Gátolja a parathormon hatását"
            ]
        },
        "correct_answer": "Valódi renális eredetű kalciuriát okoz",
        "explanation_en": "Proximal renal tubular dysfunction leads to the wasting of minerals, including calcium.",
        "explanation_hu": "A proximális renális tubuláris diszfunkció az ásványi anyagok, köztük a kalcium fokozott ürítéséhez vezet."
    },
    {
        "id": "tk10_560",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why are hard cheeses often superior to processed ones for calcium intake?",
        "question_text_hu": "Miért előnyösebbek a kemény sajtok az ömlesztetteknél a kalciumbevitel szempontjából?",
        "options": {
            "en": [
                "Processed cheeses have high phosphate content which binds calcium",
                "Hard cheeses contain significantly more vitamin D",
                "Processed cheeses inhibit the pituitary gland",
                "Hard cheeses are easier for infants to digest"
            ],
            "hu": [
                "Az ömlesztett sajtok magas foszfáttartalma megköti a kalciumot",
                "A kemény sajtok lényegesen több D-vitamint tartalmaznak",
                "Az ömlesztett sajtok gátolják az agyalapi mirigyet",
                "A kemény sajtokat a csecsemők könnyebben emésztik"
            ]
        },
        "correct_answer": "Az ömlesztett sajtok magas foszfáttartalma megköti a kalciumot",
        "explanation_en": "High phosphate levels interfere with the bioavailability of dietary calcium.",
        "explanation_hu": "A magas foszfátszint zavarja az étkezési kalcium biológiai hasznosíthatóságát."
    },
    {
        "id": "tk10_561",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary consequence of osteocalcin and osteopontin suppression by steroids?",
        "question_text_hu": "Mi az Elsődleges következménye az oszteokalcin és az oszteopontin szteroidok általi elnyomásának?",
        "options": {
            "en": [
                "Failure of proper matrix mineralization and quality",
                "Sudden increase in bone strength",
                "Prevention of any bone fracture",
                "Increased production of Vitamin K"
            ],
            "hu": [
                "A megfelelő mátrix-mineralizáció és minőség zavara",
                "A csontszilárdság hirtelen növekedése",
                "Bármilyen csonttörés megelőzése",
                "Fokozott K-vitamin-termelés"
            ]
        },
        "correct_answer": "A megfelelő mátrix-mineralizáció és minőség zavara",
        "explanation_en": "These proteins are essential markers and active participants in proper bone construction.",
        "explanation_hu": "Ezek a fehérjék a megfelelő csontfelépítés alapvető markerei és aktív résztvevői."
    },
    {
        "id": "tk10_562",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which anatomical structure provides stability to the dorsal side of the vertebrae, protecting it from compression?",
        "question_text_hu": "Melyik anatómiai struktúra biztosít stabilitást a csigolyák dorzális oldalának, védve azt a kompressziótól?",
        "options": {
            "en": [
                "Vertebral processes",
                "Vertebral body (corpus)",
                "Intervertebral discs",
                "Ligamentum flavum"
            ],
            "hu": [
                "Csigolyanyúlványok",
                "Csigolyatest (corpus)",
                "Csigolyaközti porckorongok",
                "Ligamentum flavum"
            ]
        },
        "correct_answer": "Csigolyanyúlványok",
        "explanation_en": "The vertebral body is spongy and lacks the mechanical support found in the posterior processes.",
        "explanation_hu": "A csigolyatest szivacsos, és hiányzik belőle a hátulsó nyúlványokban meglévő mechanikai alátámasztás."
    },
    {
        "id": "tk10_563",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why does insulin deficiency in Diabetes mellitus lead to osteoporosis?",
        "question_text_hu": "Miért vezet az inzulinhiány Diabetes mellitusban oszteoporózishoz?",
        "options": {
            "en": [
                "Protein synthesis declines and matrix catabolism is enhanced",
                "Insulin directly binds and inactivates serum calcium",
                "Diabetes triggers the production of ectopic calcitonin",
                "Lack of insulin causes the skull to thicken excessively"
            ],
            "hu": [
                "A fehérjeszintézis csökken és a mátrix-katabolizmus fokozódik",
                "Az inzulin közvetlenül megköti és inaktiválja a szérum kalciumot",
                "A diabétesz ektopiás kalcitonin-termelést vált ki",
                "Az inzulinhiány a koponya túlzott megvastagodását okozza"
            ]
        },
        "correct_answer": "A fehérjeszintézis csökken és a mátrix-katabolizmus fokozódik",
        "explanation_en": "Insulin is an anabolic hormone; its lack affects the protein framework of all tissues, including bone.",
        "explanation_hu": "Az inzulin anabolikus hormon; hiánya minden szövet fehérjevázát érinti, beleértve a csontot is."
    },
    {
        "id": "tk10_564",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Lasting treatment with anticoagulants like heparin can aggravate osteoporosis.",
        "question_text_hu": "Az antikoagulánsokkal (például heparinnal) végzett tartós kezelés súlyosbíthatja az oszteoporózist.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Heparin interferes with matrix components like mucopolysaccharides, weakening the bone over time.",
        "explanation_hu": "A heparin zavarja a mátrix-összetevőket, például a mukopoliszacharidokat, idővel gyengítve a csontot."
    },
    {
        "id": "tk10_565",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Muscle function activates osteoblasts via a piezo-electric mechanism.",
        "question_text_hu": "Az izomműködés piezoelektromos mechanizmussal aktiválja az oszteoblasztokat.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "This is why bone grows thicker at points where muscles exert tension (tuberosities).",
        "explanation_hu": "Ezért vastagodik meg a csont azokon a pontokon, ahol az izmok feszülést gyakorolnak (tuberositasok)."
    },
    {
        "id": "tk10_566",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The 'female athlete triad' includes anorexia, amenorrhea, and hypercalcemia.",
        "question_text_hu": "A „női sportoló triász” része az anorexia, az amenorrhoea és a hiperkalcémia.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "The triad includes anorexia, amenorrhea, and osteoporosis (not hypercalcemia).",
        "explanation_hu": "A triász része az anorexia, az amenorrhoea és az oszteoporózis (nem a hiperkalcémia)."
    },
    {
        "id": "tk10_567",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Smoking speeds up osteoporosis significantly.",
        "question_text_hu": "A dohányzás jelentősen felgyorsítja az oszteoporózis kialakulását.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Clinical evidence confirms that smoking is a major risk factor for bone loss.",
        "explanation_hu": "A klinikai bizonyítékok megerősítik, hogy a dohányzás a csontvesztés egyik fő kockázati tényezője."
    },
    {
        "id": "tk10_568",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Pathological fractures of the femoral neck are a common consequence of Type-1 (postmenopausal) osteoporosis.",
        "question_text_hu": "A combnyak patológiás törése az 1-es típusú (posztmenopauzális) oszteoporózis gyakori következménye.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Both Type-1 and Type-2 osteoporosis lead to serious skeletal fragility involving the femur.",
        "explanation_hu": "Mind az 1-es, mind a 2-es típusú oszteoporózis súlyos csontrendszeri törékenységhez vezet, amely érinti a combcsontot is."
    },
    {
        "id": "tk10_569",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the risk factor with the specific mechanism of bone damage.",
        "question_text_hu": "Párosítsa a kockázati tényezőt a csontkárosodás specifikus mechanizmusával.",
        "options": {
            "en": [
                "A) Vitamin C deficiency",
                "B) Diabetes mellitus",
                "C) Cushing's syndrome",
                "D) Weightlessness"
            ],
            "hu": [
                "A) C-vitamin-hiány",
                "B) Diabetes mellitus",
                "C) Cushing-szindróma",
                "D) Súlytalanság"
            ]
        },
        "items": {
            "en": [
                "1) Impaired prolyl- and lysyl-hydroxylase function",
                "2) Non-enzymatic glycation of collagen in matrix",
                "3) Decresed 1-alpha-hydroxylase activity (steroid effect)",
                "4) Absence of piezo-electric osteoblast stimuli"
            ],
            "hu": [
                "1) Károsodott prolyl- és lysyl-hidroxiláz működés",
                "2) A kollagén nem enzimatikus glikációja a mátrixban",
                "3) Csökkent 1-alfa-hidroxiláz aktivitás (szteroidhatás)",
                "4) Piezoelektromos oszteoblaszt-stimulus hiánya"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Understanding the pathobiochemical mechanisms is essential for clinical management.",
        "explanation_hu": "A patobiokémiai mechanizmusok megértése elengedhetetlen a klinikai kezeléshez."
    },
    {
        "id": "tk10_570",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical symptom or sign with the likely osteoporosis complication.",
        "question_text_hu": "Párosítsa a klinikai tünetet vagy jelet a valószínű oszteoporózis-szövődménnyel.",
        "options": {
            "en": [
                "A) Widow's hump",
                "B) Sharp tearing pain",
                "C) Aching back",
                "D) Paralytic ileus"
            ],
            "hu": [
                "A) Özvegypúp",
                "B) Éles, tépő fájdalom",
                "C) Hátfájás",
                "D) Paralitikus ileus"
            ]
        },
        "items": {
            "en": [
                "1) Accumulated thoracic spinal kyphosis",
                "2) Acute vertebral compression fracture",
                "3) Micro-fractures of the vertebral bodies",
                "4) Retroperitoneal bleeding irritating autonomic nerves"
            ],
            "hu": [
                "1) Kialakult háti gerinc kifózis",
                "2) Akut csigolyatömörüléses törés",
                "3) A csigolyatestek mikro-fraktúrái",
                "4) A vegetatív idegeket irritáló retroperitoneális vérzés"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Pain quality and skeletal deformities are key diagnostic indicators of bone failure.",
        "explanation_hu": "A fájdalom jellege és a vázrendszeri deformitások kulcsfontosságú diagnosztikai mutatók."
    }
]