[
    {
        "id": "tk10_901",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Autoimmune Polyglandular Syndrome Type I (APECED) is characterized by severe mucocutaneous candidiasis, because a mutation of the AIRE gene on chromosome 21 leads to a defect in immune tolerance and defense.",
        "question_text_hu": "Az I-es típusú autoimmun poli-glanduláris szindrómát (APECED) súlyos mukokután candidiasis jellemzi, mert a 21. kromoszómán található AIRE gén mutációja a saját-tolerancia és az immunvédekezés zavarához vezet.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The AIRE gene is crucial for self-tolerance; its defect results in multi-organ autoimmunity and specific fungal susceptibility.",
        "explanation_hu": "Az AIRE gén kulcsfontosságú a saját-tolerancia szempontjából; hiánya több szervet érintő autoimmunitást és specifikus gomba-fogékonyságot eredményez."
    },
    {
        "id": "tk10_902",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Type II Autoimmune Polyglandular Syndrome (Schmidt syndrome) is distinguishable from Type I by its association with type 1 DM and the absence of parathyroid involvement.",
        "question_text_hu": "A II-es típusú autoimmun poli-glanduláris szindróma (Schmidt-szindróma) megkülönböztethető az I-es típustól az 1-es típusú DM-mel való társulása és a mellékpajzsmirigy-érintettség hiánya alapján.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Schmidt syndrome lacks the chronic candidiasis and alopecia typical of the recessive Type I (APECED).",
        "explanation_hu": "A Schmidt-szindrómából hiányzik a recesszív I-es típusra (APECED) jellemző krónikus candidiasis és alopecia."
    },
    {
        "id": "tk10_903",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Menopausal hot flushes are sometimes termed 'anapyrexia', because the beginning of the flush is marked by a sudden fall in the thermoregulatory set-point.",
        "question_text_hu": "A menopauzás hőhullámokat néha 'anapirexiának' nevezik, mert a hőhullám kezdetét a hőszabályozási alapjel (set-point) hirtelen leesése jelzi.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The body perceives its normal temperature as too high relative to the new low set-point, triggering heat dissipation (sweating).",
        "explanation_hu": "A szervezet a normális hőmérsékletét túl magasnak érzékeli az új, alacsony alapjelhez képest, ami hőleadást (izzadást) vált ki."
    },
    {
        "id": "tk10_904",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Somatopause is a major driver of age-related sarcopenia, because declining GH and IGF-1 levels result in the progressive loss of skeletal muscle mass.",
        "question_text_hu": "A szomatopauza az időskori szarkopénia egyik fő mozgatórugója, mert a csökkenő GH- és IGF-1-szintek a vázizomtömeg progresszív vesztését eredményezik.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Growth hormone levels fall with age, leading to reduced protein synthesis and muscle frailty.",
        "explanation_hu": "A növekedési hormon szintje az életkorral csökken, ami mérsékelt fehérjeszintézishez és izomgyengeséghez vezet."
    },
    {
        "id": "tk10_905",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "SSRIs can provide non-hormonal relief for menopausal hot flushes, because serotonergic pathways in the hypothalamus are involved in the thermoregulatory instability caused by estrogen deficiency.",
        "question_text_hu": "Az SSRI-k nem-hormonális enyhülést nyújthatnak menopauzás hőhullámokban, mert a hipotalamusz szerotoninerg útvonalai érintettek az ösztrogénhiány okozta hőszabályozási instabilitásban.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "SSRIs modulate the neurochemical signals that trigger the sudden shifts in thermoregulation during menopause.",
        "explanation_hu": "Az SSRI-k modulálják azokat a neurokémiai jeleket, amelyek a menopauza alatti hirtelen hőszabályozási eltolódásokat kiváltják."
    },
    {
        "id": "tk10_906",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Phytoestrogens are alternatives to standard hormonal therapy in oncologically high-risk patients, because they are thought to have lower risks of promoting hormone-sensitive malignancies like breast cancer.",
        "question_text_hu": "A fitoösztrogének alternatívái lehetnek a standard hormonpótlásnak onkológiailag magas kockázatú betegeknél, mert úgy vélik, kisebb a kockázatuk a hormonérzékeny daganatok, például az emlőrák serkentésében.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Phytoestrogens exhibit weak estrogenic activity and may have protective effects, though their symptom relief is less potent than estradiol.",
        "explanation_hu": "A fitoösztrogének gyenge ösztrogén hatást mutatnak és védőhatásuk is lehet, bár tüneti enyhülésük elmarad az ösztradiolétól."
    },
    {
        "id": "tk10_907",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Adrenopause is characterized by a gradual decline in cortisol production beginning at middle age, because the adrenal cortex atrophies during normal aging.",
        "question_text_hu": "Az adrenopauzát a kortizoltermelés középkortól kezdődő fokozatos csökkenése jellemzi, mert a mellékvesekéreg elsorvad a normális öregedés során.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. hamis",
        "explanation_en": "Adrenopause refers to the decline of DHEA/DHEAS, not cortisol; cortisol levels often stay stable or slightly rise with age.",
        "explanation_hu": "Az adrenopauza a DHEA/DHEAS csökkenésére utal, nem a kortizoléra; a kortizolszint gyakran stabil marad vagy kissé emelkedik az életkorral."
    },
    {
        "id": "tk10_908",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Synchropause in the elderly is characterized by better-defined circadian rhythms, because the pineal gland's melatonin production peaks in old age.",
        "question_text_hu": "Az időskori szinkropauzát jobban meghatározott cirkadián ritmus jellemzi, mert a tobozmirigy melatonintermelése időskorban éri el a csúcsát.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. hamis",
        "explanation_en": "Synchropause refers to the blunting and loss of temporal coordination in hormonal rhythms (like melatonin and GH).",
        "explanation_hu": "A szinkropauza a hormonális ritmusok (mint a melatonin és a GH) ellapulására és az időbeli koordináció elvesztésére utal."
    },
    {
        "id": "tk10_909",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "What are the classic clinical features of Autoimmune Polyglandular Syndrome Type I (APECED)? Select all that apply.",
        "question_text_hu": "Melyek az I-es típusú autoimmun poli-glanduláris szindróma (APECED) klasszikus klinikai jellemzői? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Chronic mucocutaneous candidiasis",
                "Hypoparathyroidism",
                "Addison's disease",
                "Autosomal recessive inheritance",
                "Common association with Type 1 Diabetes Mellitus"
            ],
            "hu": [
                "Krónikus mukokután candidiasis",
                "Hipoparateireózis",
                "Addison-kór",
                "Autoszómális recesszív öröklődés",
                "Gyakori társulás 1-es típusú diabetes mellitusszal"
            ]
        },
        "correct_answer": "Krónikus mukokután candidiasis, Hipoparateireózis, Addison-kór, Autoszómális recesszív öröklődés",
        "explanation_en": "T1DM is more typical for APS Type II (Schmidt syndrome); Type I hallmarks are candidiasis and hypoparathyroidism.",
        "explanation_hu": "Az 1-es típusú DM inkább az APS II-es típusára (Schmidt-szindróma) jellemző; az I-es típus ismérvei a candidiasis és a hipoparateireózis."
    },
    {
        "id": "tk10_910",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which non-endocrine autoimmune disorders are associated with APECED? Select all that apply.",
        "question_text_hu": "Mely nem-endokrin autoimmun betegségek társulnak az APECED-hez? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Alopecia and vitiligo",
                "Pernicious anemia",
                "Malabsorption/Enteropathy",
                "Chronic active hepatitis",
                "Myasthenia gravis"
            ],
            "hu": [
                "Alopecia és vitiligo",
                "Anemia perniciosa (vészes vérszegénység)",
                "Malabszorpció / enteropátia",
                "Krónikus aktív hepatitis",
                "Myasthenia gravis"
            ]
        },
        "correct_answer": "Alopecia és vitiligo, Anemia perniciosa (vészes vérszegénység), Malabszorpció / enteropátia, Krónikus aktív hepatitis",
        "explanation_en": "Myasthenia gravis is frequently found in APS Type II, not Type I.",
        "explanation_hu": "A myasthenia gravis a II-es típusú APS-ben fordul elő gyakran, nem az I-esben."
    },
    {
        "id": "tk10_911",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which thermoregulatory events occur during a menopausal hot flush? Select all that apply.",
        "question_text_hu": "Mely hőszabályozási események következnek be egy menopauzás hőhullám során? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Sudden drop in the hypothalamic set-point",
                "Cutaneous vasodilation and sweating",
                "Sensation of intense heat and palpitations",
                "Compensatory shivering after the flush",
                "Systemic fever (pyrexia)"
            ],
            "hu": [
                "A hipotalamusz alapjelének hirtelen leesése",
                "Kután vazodilatáció és izzadás",
                "Intenzív melegségérzet és palpitáció",
                "Kompenzáló hidegrázás a roham után",
                "Szisztémás láz (pirexia)"
            ]
        },
        "correct_answer": "A hipotalamusz alapjelének hirtelen leesése, Kután vazodilatáció és izzadás, Intenzív melegségérzet és palpitáció, Kompenzáló hidegrázás a roham után",
        "explanation_en": "It is an 'inverse fever' (anapyrexia) where the set-point falls, not rises; baseline body temperature is initially normal.",
        "explanation_hu": "Ez egy 'inverz láz' (anapirexia), ahol az alapjel leesik, nem emelkedik; az alap tessthőmérséklet kezdetben normális."
    },
    {
        "id": "tk10_912",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which factors contribute to geriatric sarcopenia? Select all that apply.",
        "question_text_hu": "Mely tényezők járulnak hozzá az időskori szarkopéniához? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Somatopause (declining GH)",
                "Anorexia and malnutrition",
                "Intestinal malabsorption",
                "Sedentary lifestyle",
                "Rising adrenal DHEA levels"
            ],
            "hu": [
                "Szomatopauza (csökkenő GH)",
                "Anorexia és malnutríció",
                "Intesztinális malabszorpció",
                "Szedenter (mozgásszegény) életmód",
                "Emelkedő mellékvese DHEA-szintek"
            ]
        },
        "correct_answer": "Szomatopauza (csökkenő GH), Anorexia és malnutríció, Intesztinális malabszorpció, Szedenter (mozgásszegény) életmód",
        "explanation_en": "DHEA levels drop dramatically with age (adrenopause), failing to support muscle mass.",
        "explanation_hu": "A DHEA-szintek drámaian esnek az életkorral (adrenopauza), így nem támogatják az izomtömeget."
    },
    {
        "id": "tk10_913",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What links obesity and insulin to increased cancer risk according to pathophysiological theories? Select all that apply.",
        "question_text_hu": "Mi köti össze az elhízást és az inzulint a megnövekedett rákkockázattal a kórélettani elméletek szerint? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Obesity causes insulin resistance and hyperinsulinemia",
                "High insulin cross-reacts with tissue IGF receptors",
                "Hyperinsulinemia promotes breast, prostate, and colon cancer",
                "Estrogen can help mitigate metabolic syndrome in menopause",
                "Insulin causes direct mutagenic DNA damage"
            ],
            "hu": [
                "Az elhízás inzulinrezisztenciát és hiperinzulinémiát okoz",
                "A magas inzulinszint keresztreakcióba lép a szöveti IGF-receptorokkal",
                "A hiperinzulinémia elősegíti az emlő-, prosztata- és vastagbélrákot",
                "Az ösztrogén segíthet a metabolikus szindróma mérséklésében menopauzában",
                "Az inzulin közvetlen mutagén DNS-károsodást okoz"
            ]
        },
        "correct_answer": "Az elhízás inzulinrezisztenciát és hiperinzulinémiát okoz, A magas inzulinszint keresztreakcióba lép a szöveti IGF-receptorokkal, A hiperinzulinémia elősegíti az emlő-, prosztata- és vastagbélrákot, Az ösztrogén segíthet a metabolikus szindróma mérséklésében menopauzában",
        "explanation_en": "Insulin's mitogenic potential via the IGF pathway links metabolic dysfunction to oncogenesis.",
        "explanation_hu": "Az inzulinnak az IGF-útvonalon keresztül kifejtett mitogén potenciálja összeköti a metabolikus diszfunkciót az onkogenezissel."
    },
    {
        "id": "tk10_914",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Mutations in which gene on chromosome 21 underlie the pathogenesis of APS Type I?",
        "question_text_hu": "A 21. kromoszóma melyik génjének mutációja áll az APS I-es típusának patogenezise mögött?",
        "options": {
            "en": [
                "AIRE (Auto-Immune-Regulator)",
                "FOXP3",
                "RET",
                "MEN1"
            ],
            "hu": [
                "AIRE (Auto-Immune-Regulator)",
                "FOXP3",
                "RET",
                "MEN1"
            ]
        },
        "correct_answer": "AIRE (Auto-Immune-Regulator)",
        "explanation_en": "AIRE ensures the expression of self-antigens in the thymus, preventing autoreactive T-cell escape.",
        "explanation_hu": "Az AIRE biztosítja a saját-antigének expresszióját a csecsemőmirigyben, megakadályozva az autoreaktív T-sejtek kijutását."
    },
    {
        "id": "tk10_915",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the defining difference between APS Type II (Schmidt) and APS Type III?",
        "question_text_hu": "Mi a meghatározó különbség az APS II-es (Schmidt) és a III-as típusa között?",
        "options": {
            "en": [
                "Type III excludes adrenocortical failure (Addison's)",
                "Type III features hypoparathyroidism",
                "Type II is caused by single gene mutations",
                "Type III is never found with thyroid disease"
            ],
            "hu": [
                "A III-as típusból hiányzik a mellékvesekéreg-elégtelenség (Addison-kór)",
                "A III-as típusra jellemző a hipoparateireózis",
                "A II-es típust egyetlen gén mutációja okozza",
                "A III-as típus soha nem fordul elő pajzsmirigybetegséggel"
            ]
        },
        "correct_answer": "A III-as típusból hiányzik a mellékvesekéreg-elégtelenség (Addison-kór)",
        "explanation_en": "The distinction is based solely on whether Addison's disease is part of the clinical presentation.",
        "explanation_hu": "A megkülönböztetés alapja kizárólag az, hogy az Addison-kór része-e a klinikai képnek."
    },
    {
        "id": "tk10_916",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "At what age do DHEA and DHEAS levels typically start to decline significantly in the process of adrenopause?",
        "question_text_hu": "Milyen korban kezd el jellemzően jelentősen csökkenni a DHEA és DHEAS szintje az adrenopauza folyamatában?",
        "options": {
            "en": [
                "After age 40",
                "After age 80",
                "During puberty",
                "Instantly after birth"
            ],
            "hu": [
                "A 40. életév után",
                "80 éves kor után",
                "Pubertás alatt",
                "Közvetlenül a születés után"
            ]
        },
        "correct_answer": "A 40. életév után",
        "explanation_en": "The age-related fall of adrenal androgens is one of the most consistent biomarkers of aging.",
        "explanation_hu": "A mellékvese-androgének életkorral összefüggő csökkenése az öregedés egyik legkövetkezetesebb biomarkere."
    },
    {
        "id": "tk10_917",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which condition is characterized by the progressive loss of skeletal muscle mass and strength in the elderly?",
        "question_text_hu": "Melyik állapotot jellemzi az idős korban tapasztalható progresszív vázizomtömeg- és erővesztés?",
        "options": {
            "en": [
                "Sarcopenia",
                "Acromegaly",
                "Eunuchoidism",
                "Anapyrexia"
            ],
            "hu": [
                "Szarkopénia",
                "Akromegália",
                "Eunuchoidizmus",
                "Anapirexia"
            ]
        },
        "correct_answer": "Szarkopénia",
        "explanation_en": "Sarcopenia is a central element of geriatric frailty syndrome, influenced by somatopause.",
        "explanation_hu": "A szarkopénia a geriátriai gyengeség-szindróma (frailty) központi eleme, amelyet a szomatopauza is befolyásol."
    },
    {
        "id": "tk10_918",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What characterizes the 'chill period' that often follows a menopausal hot flush?",
        "question_text_hu": "Mi jellemzi a menopauzás hőhullámot gyakran követő 'hidegrázási szakaszt' (chill period)?",
        "options": {
            "en": [
                "The set-point normalizes, causing a cold sensation and shivering in the cooled body",
                "Body temperature rises to extreme fever levels",
                "The skin becomes cyanotic due to vasoconstriction",
                "Temporary loss of all thermal sensation"
            ],
            "hu": [
                "A set-point normalizálódik, ami hidegérzetet és borzongást vált ki a lehűlt testben",
                "A tessthőmérséklet extrém lázas szintekre emelkedik",
                "A bőr cianotikussá válik a vazokonstrikció miatt",
                "Az összes hőérzet átmeneti elvesztése"
            ]
        },
        "correct_answer": "A set-point normalizálódik, ami hidegérzetet és borzongást vált ki a lehűlt testben",
        "explanation_en": "As the hypothalamic set-point returns to normal, the body (which shed heat during the flush) now feels cold relative to the baseline.",
        "explanation_hu": "Amint a hipotalamikus alapjel visszatér a normálisra, a szervezet (amely hőt adott le a roham alatt) hidegnek érződik az alapvonalhoz képest."
    },
    {
        "id": "tk10_919",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why are cortisol levels often slightly elevated and its stress-responsiveness blunted in geriatric patients?",
        "question_text_hu": "Geriátriai betegeknél miért gyakran kissé emelkedettek a kortizolszintek, és miért tompult a stresszválasz?",
        "options": {
            "en": [
                "Due to rising ACTH levels and the loss of circadian rhythm coordination",
                "Because the adrenal cortex exclusively produces mineralocorticoids",
                "Because older individuals do not experience psychological stress",
                "Due to excessive dietary salt intake"
            ],
            "hu": [
                "Az emelkedő ACTH-szintek és a cirkadián ritmus-koordináció elvesztése miatt",
                "Mert a mellékvesekéreg kizárólag mineralokortikoidokat termel",
                "Mert az idősebb egyének nem élnek át pszichológiai stresszt",
                "A túlzott étrendi sóbevitel miatt"
            ]
        },
        "correct_answer": "Az emelkedő ACTH-szintek és a cirkadián ritmus-koordináció elvesztése miatt",
        "explanation_en": "Aging affects the sensitivity of the negative feedback loops and the rhythmic output of the HPA axis.",
        "explanation_hu": "Az öregedés befolyásolja a negatív visszacsatolási hurkok érzékenységét és a HPA-tengely ritmikus működését."
    },
    {
        "id": "tk10_920",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which term describes the flattening or disappearance of diurnal hormonal secretion cycles in the elderly?",
        "question_text_hu": "Melyik kifejezés írja le az időskori diurnális hormonelválasztási ciklusok ellapulását vagy eltűnését?",
        "options": {
            "en": [
                "Synchropause",
                "Menopause",
                "Andropause",
                "Adrenopause"
            ],
            "hu": [
                "Szinkropauza",
                "Menopauza",
                "Andropauza",
                "Adrenopauza"
            ]
        },
        "correct_answer": "Szinkropauza",
        "explanation_en": "Synchropause captures the temporal dysregulation of various hormones, including melatonin and GH.",
        "explanation_hu": "A szinkropauza a különböző hormonok, köztük a melatonin és a GH időbeli diszregulációját takarja."
    },
    {
        "id": "tk10_921",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "The inheritance of APECED (APS Type I) follows an autosomal recessive pattern.",
        "question_text_hu": "Az APECED (APS I-es típus) öröklődése autoszómális recesszív mintázatot követ.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "It is caused by homozygous or compound heterozygous mutations in the AIRE gene.",
        "explanation_hu": "Az AIRE gén homozigóta vagy összetett heterozigóta mutációi okozzák."
    },
    {
        "id": "tk10_922",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Parathyroid failure is a hallmark finding in Schmidt syndrome (APS Type II).",
        "question_text_hu": "A mellékpajzsmirigy-elégtelenség a Schmidt-szindróma (APS II-es típus) egyik jellegzetes lelete.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Parathyroid involvement is critical for Type I but is characteristically absent in Type II.",
        "explanation_hu": "A mellékpajzsmirigy-érintettség az I-es típusra jellemző, a II-es típusból viszont karakteresen hiányzik."
    },
    {
        "id": "tk10_923",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Hormone replacement therapy remains the most effective clinical intervention for menopausal hot flushes.",
        "question_text_hu": "A hormonpótló terápia továbbra is a menopauzás hőhullámok leghatékonyabb klinikai beavatkozása.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "By restoring estrogen levels, HRT addresses the root cause of the thermoregulatory shifts.",
        "explanation_hu": "Az ösztrogénszint helyreállításával a HRT a hőszabályozási eltolódások gyökerét kezeli."
    },
    {
        "id": "tk10_924",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "The term 'andropause' describes a hormonal decline that is as sudden and discrete as the female menopause.",
        "question_text_hu": "Az 'andropauza' kifejezés olyan hormonális hanyatlást ír le, amely ugyanolyan hirtelen és diszkrét, mint a női menopauza.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Male gonadal decline is typically gradual and varies significantly between individuals.",
        "explanation_hu": "A férfi ivarmirigy-működés hanyatlása jellemzően fokozatos, és egyénenként jelentősen eltér."
    },
    {
        "id": "tk10_925",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Sarcopenia in the elderly is defined by the loss of lean muscle mass even if total body fat increases.",
        "question_text_hu": "Az időskori szarkopéniát a sovány izomtömeg elvesztése határozza meg, még akkor is, ha a teljes testzsír nő.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Sarcopenic obesity is a common geriatric presentation where muscle quality and quantity decline.",
        "explanation_hu": "A szarkopéniás elhízás gyakori geriátriai kórkép, ahol az izmok minősége és mennyisége is csökken."
    },
    {
        "id": "tk10_926",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Phytoestrogens exert significantly stronger estrogenic activity than endogenous steroid hormones.",
        "question_text_hu": "A fitoösztrogének jelentősen erősebb ösztrogén aktivitást fejtenek ki, mint az endogén szteroidhormonok.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Phytoestrogens are weak agonists and generally less effective than standard estradiol therapy.",
        "explanation_hu": "A fitoösztrogének gyenge agonisták, és általában kevésbé hatékonyak, mint a standard ösztradiol-terápia."
    },
    {
        "id": "tk10_927",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Hyperinsulinemia in obesity is suspected to promote oncogenesis by activating tissue IGF-1 receptors.",
        "question_text_hu": "Feltételezik, hogy az elhízásban tapasztalható hiperinzulinémia a szöveti IGF-1 receptorok aktiválásával elősegíti az onkogenezist.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Insulin's structural similarity to IGF-1 allows it to trigger mitogenic pathways at high concentrations.",
        "explanation_hu": "Az inzulin IGF-1-hez való szerkezeti hasonlósága lehetővé teszi, hogy magas koncentrációban mitogén útvonalakat váltson ki."
    },
    {
        "id": "tk10_928",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the Autoimmune Polyglandular Syndrome (APS) type with its defining features.",
        "question_text_hu": "Párosítsa az autoimmun poli-glanduláris szindróma (APS) típusát a meghatározó jellemzőivel.",
        "options": {
            "en": [
                "A) Type I (APECED)",
                "B) Type II (Schmidt)",
                "C) Type III",
                "D) APS - general"
            ],
            "hu": [
                "A) I-es típus (APECED)",
                "B) II-es típus (Schmidt)",
                "C) III-as típus",
                "D) APS - általános"
            ]
        },
        "items": {
            "en": [
                "1) AIRE defect; Hypoparathyroidism; Candidiasis",
                "2) Dominant; Addison's; T1DM; Myasthenia",
                "3) No adrenal failure; T1DM; Thyroiditis",
                "4) Complex multi-organ autoimmune endocrine failure"
            ],
            "hu": [
                "1) AIRE hiba; Hipoparateireózis; Candidiasis",
                "2) Domináns; Addison-kór; T1DM; Myasthenia",
                "3) Nincs mellékvese elégtelen.; T1DM; Pajzsmirigygyulladás",
                "4) Összetett, több szervet érintő autoimmun endokrin elégtelenség"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Distinguishing APS types requires recognizing specific clusters of glandular and non-glandular failures.",
        "explanation_hu": "Az APS típusok megkülönböztetéséhez a mirigyes és nem-mirigyes elégtelenségek specifikus csoportjait kell felismerni."
    },
    {
        "id": "tk10_929",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the geriatric hormonal 'pause' with its primary clinical consequence.",
        "question_text_hu": "Párosítsa az időskori hormonális 'szünetet' annak elsődleges klinikai következményével.",
        "options": {
            "en": [
                "A) Somatopause",
                "B) Adrenopause",
                "C) Synchropause",
                "D) Menopause"
            ],
            "hu": [
                "A) Szomatopauza",
                "B) Adrenopauza",
                "C) Szinkropauza",
                "D) Menopauza"
            ]
        },
        "items": {
            "en": [
                "1) Sarcopenia and reduced anabolic support",
                "2) Decline in DHEA/DHEAS levels",
                "3) Disruption of temporal hormonal coordination (melatonin, GH)",
                "4) Hot flushes and cardiovascular risk increase"
            ],
            "hu": [
                "1) Szarkopénia és csökkent anabolikus támogatás",
                "2) A DHEA/DHEAS szintek csökkenése",
                "3) Időbeli hormonális koordináció zavara (melatonin, GH)",
                "4) Hőhullámok és a kardiovaszkuláris kockázat növekedése"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Aging is characterized by functional decline across multiple distinct endocrine axes.",
        "explanation_hu": "Az öregedés több különböző endokrin tengely funkcionális hanyatlása jellemzi."
    },
    {
        "id": "tk10_930",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the menopausal thermoregulatory phenomenon with its description.",
        "question_text_hu": "Párosítsa a menopauzás hőszabályozási jelenséget a leírásával.",
        "options": {
            "en": [
                "A) Anapyrexia",
                "B) Chill period",
                "C) Hot flush",
                "D) Resetting"
            ],
            "hu": [
                "A) Anapirexia",
                "B) Hidegrázási szakasz",
                "C) Hőhullám",
                "D) Visszaállás"
            ]
        },
        "items": {
            "en": [
                "1) Fall in set-point triggering heat dissipation",
                "2) Shivering as body temperature is below restored set-point",
                "3) Sensation of intense heat, flushing, and sweating",
                "4) Return of hypothalamic set-point to baseline"
            ],
            "hu": [
                "1) Set-point zuhanás, ami hőleadást vált ki",
                "2) Borzongás, mert a testhő a visszaállt alapjel alatt van",
                "3) Intenzív forróságérzet, kipirulás és izzadás",
                "4) A hipotalamikus alapjel visszatérése a bázisra"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "These phases describe the cyclic instability of thermoregulation triggered by estrogen withdrawal.",
        "explanation_hu": "Ezek a fázisok az ösztrogén-megvonás által kiváltott hőszabályozási instabilitás ciklusát írják le."
    }
]