[
    {
        "id": "tk10_571",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Phytoestrogens (flavonoids) from fruits and black tea are considered effective alternatives for osteoporosis prevention because they can inhibit bone loss progression similarly to synthetic estrogens.",
        "question_text_hu": "A gyümölcsökből és fekete teából származó fitoösztrogének (flavonoidok) hatékony alternatívát jelentenek az oszteoporózis megelőzésében, mert a szintetikus ösztrogénekhez hasonlóan gátolhatják a csontvesztés előrehaladását.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Flavonoids exert weak estrogenic effects and provide a safer alternative with lower thrombosis risk compared to high-dose HRT.",
        "explanation_hu": "A flavonoidok gyenge ösztrogén hatást fejtenek ki, és a nagy dózisú HRT-hez képest biztonságosabb alternatívát jelentenek alacsonyabb trombóziskockázattal."
    },
    {
        "id": "tk10_572",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Physical loading through axial forces (e.g., weight bearing exercise) remains advisable even in extreme old age because it effectively decreases bone resorption and helps maintain existing bone mass.",
        "question_text_hu": "Az axiális erőkkel járó fizikai terhelés (pl. gravitációs terhelés alatti mozgás) még idős korban is tanácsos, mert hatékonyan csökkenti a csontreszorpciót és segít megőrizni a meglévő csonttömeget.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Mechanical stress is a primary stimulator for osteoblast activity through piezoelectric effects and cellular signaling.",
        "explanation_hu": "A mechanikai stressz az oszteoblaszt-aktivitás elsődleges stimulátora piezoelektromos és celluláris szignálmechanizmusokon keresztül."
    },
    {
        "id": "tk10_573",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Osteomalacia is fundamentally different from osteoporosis because the organic bone matrix remains intact or may even be hypertrophic while mineral deposition is defective.",
        "question_text_hu": "Az oszteomalácia alapvetően különbözik az oszteoporózistól, mert a szerves csontmátrix ép marad vagy akár hipertrófiás is lehet, miközben az ásványianyag-lerakódás szenved zavart.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Osteomalacia is a qualitative mineralisation defect, whereas osteoporosis is a quantitative loss of both matrix and mineral.",
        "explanation_hu": "Az oszteomalácia minőségi mineralizációs hiba, míg az oszteoporózis a mátrix és az ásványi anyag együttes mennyiségi vesztése."
    },
    {
        "id": "tk10_574",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Defective alkaline phosphatase function (hypophosphatasia) leads to osteomalacia because accumulated pyrophosphates inhibit the precipitation of hydroxyapatite onto collagen fibers.",
        "question_text_hu": "Az alkalikus foszfatáz hibás működése (hipofoszfatázia) oszteomaláciához vezet, mert a felhalmozódott pirofoszfátok gátolják a hidroxi-apatit kicsapódását a kollagénrostokon.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Alkaline phosphatase (ALP) is required to hydrolyze mineralization inhibitors and provide local inorganic phosphate.",
        "explanation_hu": "Az alkalikus foszfatáz (ALP) szükséges a mineralizációt gátló anyagok hidrolizálásához és a helyi szervetlen foszfát biztosításához."
    },
    {
        "id": "tk10_575",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Chronic uremic metabolic acidosis is a significant cause of osteomalacia because it interferes with active hydroxyapatite formation within the bone microenvironment.",
        "question_text_hu": "A krónikus urémiás metabolikus acidózis az oszteomalácia egyik jelentős oka, mert zavarja az aktív hidroxi-apatit képződését a csont mikrokörnyezetében.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Acidity increases the solubility of bone minerals and prevents their proper deposition onto the organic matrix.",
        "explanation_hu": "A savasság növeli a csont ásványi anyagainak oldékonyságát és megakadályozza azok megfelelő lerakódását a szerves mátrixra."
    },
    {
        "id": "tk10_576",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Vitamin D deficiency in children leads to 'rachitic rosary' because the osteoid at the costochondral junctions becomes abnormally thickened.",
        "question_text_hu": "Gyermekeknél a D-vitamin-hiány 'rachitises olvasóhoz' vezet, mert a bordák csont-porc átmeneténél az oszteoid rendellenesen megvastagszik.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Beading of the ribs results from the accumulation of excessive, unmineralized organic matrix at growth plates.",
        "explanation_hu": "A bordák gyöngyszerű megnagyobbodása a túlzott mennyiségű, mineralizálatlan szerves mátrix felhalmozódásának eredménye a növekedési zónákban."
    },
    {
        "id": "tk10_577",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Adrenal medullary hypofunction in childhood can cause severe hypoglycemia because the gland fails to release epinephrine (adrenaline) in response to low blood glucose.",
        "question_text_hu": "A mellékvesevelő gyermekkori hypofunkciója súlyos hypoglykaemiát okozhat, mert a mirigy alacsony vércukorszint esetén nem tud adrenalint felszabadítani.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Epinephrine is a crucial counter-regulatory hormone that triggers immediate hepatic glucose mobilization.",
        "explanation_hu": "Az adrenalin kulcsfontosságú ellenregulációs hormon, amely kiváltja a máj azonnali glükóz-mobilizációját."
    },
    {
        "id": "tk10_578",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Idiopathic orthostatic hypotension can lead to syncope upon standing because it involves a progressive fall in blood pressure due to autonomic failure.",
        "question_text_hu": "Az idiopátiás orthostaticus hypotensio felálláskor syncopéhoz vezethet, mert a vérnyomás progresszív esésével jár a vegetatív idegrendszer elégtelensége miatt.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Failure of the baroreceptor reflex prevents compensatory vasoconstriction and heart rate adjustments when upright.",
        "explanation_hu": "A baroreceptor-reflex elégtelensége megakadályozza a kompenzatórikus érszűkületet és a pulzus beállítását álló helyzetben."
    },
    {
        "id": "tk10_579",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which clinical findings are characteristic of osteomalacia? Select all that apply.",
        "question_text_hu": "Mely klinikai leletek jellemzőek az oszteomaláciára? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Deformable and flexible bones (e.g., bow-legs)",
                "Diffuse bone pain and proximal muscle weakness",
                "Hypodense Looser zones (pseudofractures) on X-rays",
                "Enamel defects and poor dental health",
                "Pathological thickening of the long bone shafts"
            ],
            "hu": [
                "Deformálható és hajlékony csontok (pl. O-láb)",
                "Diffúz csontfájdalom és proximális izomgyengeség",
                "Hipodenz Looser-zónák (ál-törések) a röntgenfelvételen",
                "Zománchibák és rossz fogállapot",
                "A hosszú csontok szárának kóros megvastagodása"
            ]
        },
        "correct_answer": "Deformálható és hajlékony csontok (pl. O-láb), Diffúz csontfájdalom és proximális izomgyengeség, Hipodenz Looser-zónák (ál-törések) a röntgenfelvételen, Zománchibák és rossz fogállapot",
        "explanation_en": "The lack of mineral makes bones soft and susceptible to bending, whereas thickening is not a typical feature.",
        "explanation_hu": "Az ásványi anyag hiánya a csontokat puhává és hajlékonnyá teszi, míg a vastagodás nem jellemző vonás."
    },
    {
        "id": "tk10_580",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which factors can cause a chronic phosphate deficit leading to osteomalacia? Select all that apply.",
        "question_text_hu": "Mely tényezők okozhatnak krónikus foszfát-deficitet, ami oszteomaláciához vezet? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Congenital renal phosphate wasting (e.g., Fanconi syndrome)",
                "Inadequate dietary phosphate intake",
                "Low calcium intake inducing secondary hyperparathyroidism",
                "Excessive consumption of hard cheeses",
                "Untreated hyperthyroidism"
            ],
            "hu": [
                "Veleszületett renális foszfátürítés (pl. Fanconi-szindróma)",
                "Elégtelen étrendi foszfátbevitel",
                "Alacsony kalciumbevitel miatti szekunder hyperparathyreosis",
                "Kemény sajtok túlzott fogyasztása",
                "Kezeletlen hyperthyreosis"
            ]
        },
        "correct_answer": "Veleszületett renális foszfátürítés (pl. Fanconi-szindróma), Elégtelen étrendi foszfátbevitel, Alacsony kalciumbevitel miatti szekunder hyperparathyreosis",
        "explanation_en": "Fanconi syndrome and secondary hyperparathyroidism increase renal phosphate loss, depleting the phosphorus required for mineralization.",
        "explanation_hu": "A Fanconi-szindróma és a szekunder hyperparathyreosis fokozza a renális foszfátvesztést, kimerítve a mineralizációhoz szükséges foszforkészletet."
    },
    {
        "id": "tk10_581",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What are the common clinical signs of rickets (childhood Vitamin D deficiency)? Select all that apply.",
        "question_text_hu": "Melyek a rachitis (gyermekkori D-vitamin-hiány) gyakori klinikai jelei? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Craniotabes (soft, deformable skull bones)",
                "Rachitic rosary (thickened costochondral junctions)",
                "Genu varum (bow-legs)",
                "Pelvic deformities that may complicate future labor",
                "Brittle, hypermineralized long bones"
            ],
            "hu": [
                "Craniotabes (puha, deformálható koponyacsontok)",
                "Rachitises olvasó (megvastagodott csont-porc átmenetek)",
                "Genu varum (O-láb)",
                "A jövőbeli szülést nehezítő medence-deformitások",
                "Törékeny, hipermineralizált hosszú csontok"
            ]
        },
        "correct_answer": "Craniotabes (puha, deformálható koponyacsontok), Rachitises olvasó (megvastagodott csont-porc átmenetek), Genu varum (O-láb), A jövőbeli szülést nehezítő medence-deformitások",
        "explanation_en": "Rickets is characterized by soft, demineralized bones due to impaired calcium and phosphate deposition.",
        "explanation_hu": "A rachitist a kalcium- és foszfát-lerakódás zavara miatti puha, demineralizált csontok jellemzik."
    },
    {
        "id": "tk10_582",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which dietary components are recommended to mitigate the risks of estrogen-based hormone replacement therapy (HRT)? Select all that apply.",
        "question_text_hu": "Mely étrendi összetevők javasoltak az ösztrogén-alapú hormonpótló terápia (HRT) kockázatainak mérséklésére? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Phytoestrogens (flavonoids) found in various fruits",
                "Soy products and black tea",
                "Black grapes or sour cherry concentrates",
                "A completely calcium-free diet",
                "High intake of processed soft drinks"
            ],
            "hu": [
                "Különféle gyümölcsökben található fitoösztrogének (flavonoidok)",
                "Szójatermékek és fekete tea",
                "Fekete szőlő vagy meggykoncentrátumok",
                "Teljesen kalciummentes étrend",
                "Feldolgozott üdítőitalok nagyfokú fogyasztása"
            ]
        },
        "correct_answer": "Különféle gyümölcsökben található fitoösztrogének (flavonoidok), Szójatermékek és fekete tea, Fekete szőlő vagy meggykoncentrátumok",
        "explanation_en": "Dietary flavonoids provide estrogen-like benefits with lower risks of thrombosis and malignancy compared to pharmacological HRT.",
        "explanation_hu": "Az étrendi flavonoidok ösztrogénszerű előnyöket biztosítanak, jelentősen alacsonyabb trombózis- és daganatkockázat mellett a gyógyszeres HRT-hez képest."
    },
    {
        "id": "tk10_583",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Why are obese postmenopausal women generally at lower risk for developing osteoporosis? Select all that apply.",
        "question_text_hu": "Miért alacsonyabb általában a túlsúlyos posztmenopauzális nők oszteoporózis-kockázata? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Aromatization of adrenal androgens in adipose tissue (higher estrone)",
                "Increased mechanical load on bones due to higher body mass",
                "Inherent resistance of adipocytes to parathyroid hormone",
                "Higher baseline production of calcitonin by fat cells",
                "Lower dietary intake of acidic carbonated beverages"
            ],
            "hu": [
                "A mellékvese-androgének aromatizációja a zsírszövetben (magasabb ösztron)",
                "A nagyobb testtömeg miatti fokozott mechanikai terhelés a csontokon",
                "A zsírsejtek veleszületett ellenállása a parathormonnal szemben",
                "A zsírsejtek magasabb alap kalcitonin-termelése",
                "Savas szénsavas üdítőitalok alacsonyabb étrendi bevitele"
            ]
        },
        "correct_answer": "A mellékvese-androgének aromatizációja a zsírszövetben (magasabb ösztron), A nagyobb testtömeg miatti fokozott mechanikai terhelés a csontokon",
        "explanation_en": "Both estrogenic protection and mechanical stimulation contribute to maintaining bone density in heavier individuals.",
        "explanation_hu": "Mind az ösztrogén-védelem, mind a mechanikai stimuláció hozzájárul a csontsűrűség megőrzéséhez a nagyobb súlyú egyéneknél."
    },
    {
        "id": "tk10_584",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the estimated one-year mortality rate for elderly patients following a femoral neck fracture in Hungary?",
        "question_text_hu": "Mennyi a becsült egyéves mortalitás az idős combnyaktörött betegek körében Magyarországon?",
        "options": {
            "en": [
                "15-20%",
                "Greater than 80%",
                "Approximately 5%",
                "Nearly 100%"
            ],
            "hu": [
                "15-20%",
                "Nagyobb, mint 80%",
                "Körülbelül 5%",
                "Közel 100%"
            ]
        },
        "correct_answer": "15-20%",
        "explanation_en": "The high mortality rate underscores the severity of hip fractures and the complexity of postoperative care in the elderly.",
        "explanation_hu": "A magas mortalitási arány hangsúlyozza a csípőtáji törések súlyosságát és az időskori posztoperatív ellátás összetettségét."
    },
    {
        "id": "tk10_585",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What are the leading causes of mortality in patients with osteoporosis-related fractures who do not undergo surgical stabilization?",
        "question_text_hu": "Melyek a mortalitás vezető okai az oszteoporózissal összefüggő törést szenvedett betegeknél, akik nem esnek át sebészeti stabilizáláson?",
        "options": {
            "en": [
                "Thromboembolism and pneumonia",
                "Osteosarcoma development",
                "Acute pancreatitis",
                "Severe mineral toxemia"
            ],
            "hu": [
                "Thromboembolia és pneumonia",
                "Oszteoszarkóma kialakulása",
                "Akut pancreatitis",
                "Súlyos ásványi toxémia"
            ]
        },
        "correct_answer": "Thromboembolia és pneumonia",
        "explanation_en": "Prolonged immobilization without surgical fixation leads to high risks of fatal venous thromboembolism and respiratory infections.",
        "explanation_hu": "A sebészeti rögzítés nélküli elhúzódó immobilizáció a halálos vénás thromboembolia és a légúti fertőzések magas kockázatához vezet."
    },
    {
        "id": "tk10_586",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "In senile (type-2) osteoporosis, which skeletal regions are specifically weakened, unlike in postmenopausal (type-1) osteoporosis?",
        "question_text_hu": "Szenilis (2-es típusú) oszteoporózisban mely csontrendszeri régiók gyengülnek meg kifejezetten, ellentétben az 1-es típussal?",
        "options": {
            "en": [
                "Cortical regions of long bones",
                "Exclusively the trabecular structures",
                "Primary dental enamel",
                "Growth plate cartilage"
            ],
            "hu": [
                "A hosszú csontok kortikális régiója",
                "Kizárólag a trabekuláris struktúrák",
                "Elsődleges fogzománc",
                "A növekedési zónák porca"
            ]
        },
        "correct_answer": "A hosszú csontok kortikális régiója",
        "explanation_en": "Senile osteoporosis is a more global disease, affecting both the outer cortex and the inner spongy (trabecular) bone.",
        "explanation_hu": "A szenilis oszteoporózis globálisabb betegség, amely érinti a külső kérget és a belső szivacsos (trabekuláris) csontot is."
    },
    {
        "id": "tk10_587",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Why is physical loading with axial forces (e.g., walking or weights) recommended for preventing bone loss?",
        "question_text_hu": "Miért javasolt az axiális erőkkel járó fizikai terhelés (pl. séta vagy súlyok) alkalmazása a csontvesztés megelőzésére?",
        "options": {
            "en": [
                "They activate osteoblasts through mechanical stress signaling",
                "They directly bind circulating phosphorus to the skull",
                "They increase the renal filtration of calcitonin",
                "They prevent the inhalation of metabolic acidic gases"
            ],
            "hu": [
                "Mechanikai stressz-szignalizáción keresztül aktiválják az oszteoblasztokat",
                "Közvetlenül a koponyához kötik a keringő foszfort",
                "Növelik a kalcitonin renális filtrációját",
                "Megakadályozzák a metabolikus savas gázok belélegzését"
            ]
        },
        "correct_answer": "Mechanikai stressz-szignalizáción keresztül aktiválják az oszteoblasztokat",
        "explanation_en": "Dynamic mechanical load is interpreted by osteocytes as a potent signal for bone formation.",
        "explanation_hu": "A dinamikus mechanikai terhelést az oszteociták a csontképzés erőteljes jeleként értelmezik."
    },
    {
        "id": "tk10_588",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the key laboratory and histological distinction between osteoporosis and osteomalacia?",
        "question_text_hu": "Mi a kulcsfontosságú laboratóriumi és hisztológiai különbség az oszteoporózis és az oszteomalácia között?",
        "options": {
            "en": [
                "Osteomalacia has intact or hypertrophic organic matrix with deficient mineral",
                "Osteoporosis has increased mineral content with damaged matrix",
                "Both are identical in terms of mineral-to-matrix ratio",
                "Osteomalacia affects only the dental enamel in adults"
            ],
            "hu": [
                "Oszteomaláciában ép vagy hipertrófiás a szerves mátrix, de hiányos a mineralizáció",
                "Oszteoporózisban fokozott az ásványi tartalom károsodott mátrix mellett",
                "Mindkettő azonos az ásványi anyag / mátrix arány szempontjából",
                "Az oszteomalácia felnőtteknél csak a fogzománcot érinti"
            ]
        },
        "correct_answer": "Oszteomaláciában ép vagy hipertrófiás a szerves mátrix, de hiányos a mineralizáció",
        "explanation_en": "The presence of a wide seam of unmineralized osteoid is a definitive histological sign of osteomalacia.",
        "explanation_hu": "A mineralizálatlan oszteoid széles rétegének jelenléte az oszteomalácia meghatározó hisztológiai jele."
    },
    {
        "id": "tk10_589",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why are carbonated soft drinks identified as a risk factor for bone health?",
        "question_text_hu": "Miért azonosítják a szénsavas üdítőitalokat a csontok egészségére nézve kockázati tényezőként?",
        "options": {
            "en": [
                "They contribute to metabolic acidosis which promotes resorption",
                "They directly block the intestinal absorption of water",
                "The bubbles physically erode the periosteum of the long bones",
                "They trigger excessive parathyroid hormone secretion via tongue receptors"
            ],
            "hu": [
                "Hozzájárulnak a metabolikus acidózishoz, ami fokozza a reszorpciót",
                "Közvetlenül blokkolják a víz intestinális felszívódását",
                "A buborékok fizikailag erodálják a hosszú csontok periosteumát",
                "Túlzott parathormon-szekréciót váltak ki a nyelv receptoraikon keresztül"
            ]
        },
        "correct_answer": "Hozzájárulnak a metabolikus acidózishoz, ami fokozza a reszorpciót",
        "explanation_en": "Chronic acidity inhibits mineralization and stimulates osteoclast-mediated bone breakdown.",
        "explanation_hu": "A krónikus savasság gátolja a mineralizációt és stimulálja az oszteoklasztok által közvetített csontbontást."
    },
    {
        "id": "tk10_590",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Childhood hypofunction of the adrenal medulla primarily compromises the body's ability to respond to:",
        "question_text_hu": "A mellékvesevelő gyermekkori hypofunkciója elsősorban a szervezet alábbiakra adott válaszképességét veszélyezteti:",
        "options": {
            "en": [
                "Hypoglycemia",
                "Severe secondary hypertension",
                "Excessive calcium consumption",
                "Sudden hyperventilation"
            ],
            "hu": [
                "Hypoglykaemia",
                "Súlyos szekunder hipertónia",
                "Túlzott kalciumfogyasztás",
                "Hirtelen hyperventiláció"
            ]
        },
        "correct_answer": "Hypoglykaemia",
        "explanation_en": "Insufficient epinephrine release results in a failure to rapidly mobilize hepatic glucose during blood sugar drops.",
        "explanation_hu": "Az elégtelen adrenalin-felszabadulás a máj glükóz-mobilizációjának hiányához vezet a vércukorszint leesésekor."
    },
    {
        "id": "tk10_591",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is the hallmark of orthostatic hypotension caused by autonomic failure?",
        "question_text_hu": "Mi a vegetatív elégtelenség okozta orthostaticus hypotensio legfontosabb jellemzője?",
        "options": {
            "en": [
                "Progressive fall in blood pressure upon standing up",
                "Paradoxical increase in blood pressure when upright",
                "Focal bone pain in the femora when recumbent",
                "Intermittent cardiac arrest during deep sleep"
            ],
            "hu": [
                "A vérnyomás progresszív esése felálláskor",
                "Paradox vérnyomás-emelkedés álló helyzetben",
                "Lokális csontfájdalom a combcsontban fekvő helyzetben",
                "Időszakos szívmegállás mélyalvás során"
            ]
        },
        "correct_answer": "A vérnyomás progresszív esése felálláskor",
        "explanation_en": "The autonomic system fails to orchestrate the required vasoconstriction to counter gravity.",
        "explanation_hu": "A vegetatív rendszer nem képes összehangolni a gravitáció ellensúlyozásához szükséges érszűkületet."
    },
    {
        "id": "tk10_592",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "The sympathoadrenal system plays a fundamental role in maintaining:",
        "question_text_hu": "A szimpato-adrenális rendszer alapvető szerepet játszik az alábbiak fenntartásában:",
        "options": {
            "en": [
                "Cardiovascular, metabolic, and thermoregulatory homeostasis",
                "Exclusively the mineral density of the axial skeleton",
                "Solely the production rate of erythroid progenitors",
                "Structural regeneration of the parathyroid chief cells"
            ],
            "hu": [
                "Kardiovaszkuláris, anyagcsere- és hőszabályozási homeosztázis",
                "Kizárólag az axiális vázrendszer ásványi sűrűsége",
                "Kizárólag az eritroid progenitorok termelési rátája",
                "A mellékpajzsmirigy fősejtjeinek strukturális regenerációja"
            ]
        },
        "correct_answer": "Kardiovaszkuláris, anyagcsere- és hőszabályozási homeosztázis",
        "explanation_en": "Catecholamines are essential for coordinating systemic responses to acute and chronic physiological stressors.",
        "explanation_hu": "A katecholaminok elengedhetetlenek az akut és krónikus élettani stresszorokra adott szisztémás válaszok összehangolásához."
    },
    {
        "id": "tk10_593",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "In calcium deficiency, how does secondary hyperparathyroidism contribute to the development of osteomalacia?",
        "question_text_hu": "Kalciumhiányban hogyan járul hozzá a szekunder hyperparathyreosis az oszteomalácia kialakulásához?",
        "options": {
            "en": [
                "By inducing excessive renal phosphate wasting",
                "By directly stimulating the production of excessive collagen",
                "By inhibiting the hepatic synthesis of bile salts",
                "By causing a sudden, insulin-independent drop in glucose"
            ],
            "hu": [
                "Túlzott renális foszfátürítés kiváltásával",
                "Túlzott kollagéntermelés közvetlen stimulálásával",
                "Az epesavak hepatikus szintézisének gátlásával",
                "Hirtelen, inzulinfüggetlen vércukorszint-esés okozásával"
            ]
        },
        "correct_answer": "Túlzott renális foszfátürítés kiváltásával",
        "explanation_en": "Elevated PTH levels lead to phosphaturia, resulting in hypophosphatemia which precludes proper bone mineralization.",
        "explanation_hu": "A megemelkedett PTH-szint phosphaturiához vezet, ami hypophosphataemiát eredményez, megakadályozva a megfelelő csontmineralizációt."
    },
    {
        "id": "tk10_594",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the clinical finding known as 'rachitic rosary'?",
        "question_text_hu": "Mi a 'rachitises olvasó'-ként ismert klinikai lelet?",
        "options": {
            "en": [
                "Bead-like thickening at the costochondral junctions of the ribs",
                "A chain of small neurofibromas along the spine",
                "Ectopic calcification of the vocal ligaments",
                "Hypertrophy of the follicles within the thyroid gland"
            ],
            "hu": [
                "Gyöngyszerű megvastagodás a bordák csont-porc átmeneteinél",
                "Apró neurofibrómák láncolata a gerinc mentén",
                "A hangszalagok ektópiás meszesedése",
                "A pajzsmirigy tüszőinek hipertrófiája"
            ]
        },
        "correct_answer": "Gyöngyszerű megvastagodás a bordák csont-porc átmeneteinél",
        "explanation_en": "It is a characteristic physical sign of pediatric Vitamin D deficiency (rickets).",
        "explanation_hu": "Ez a gyermekkori D-vitamin-hiány (rachitis) jellegzetes fizikai jele."
    },
    {
        "id": "tk10_595",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which term describes the adult manifestation of impaired bone mineralization due to Vitamin D deficiency?",
        "question_text_hu": "Melyik kifejezés írja le a D-vitamin-hiány miatti károsodott csontmineralizáció felnőttkori megjelenési formáját?",
        "options": {
            "en": [
                "Osteomalacia",
                "Rickets",
                "Pellagra",
                "Scurvy"
            ],
            "hu": [
                "Oszteomalácia",
                "Rachitis",
                "Pellagra",
                "Skorbut"
            ]
        },
        "correct_answer": "Oszteomalácia",
        "explanation_en": "Rickets occurs before epiphyseal closure; once growth plates are fused, the condition is termed osteomalacia.",
        "explanation_hu": "A rachitis az epifízisfúzió előtt fordul elő; a növekedési zónák lezárulása után az állapotot oszteomaláciának nevezzük."
    },
    {
        "id": "tk10_596",
        "type": "true_false",
        "bloom_level": 3,
        "question_text_en": "Elderly patients over the age of 85 who undergo surgery for a femoral neck fracture in Hungary face an extremely high postoperative mortality rate.",
        "question_text_hu": "Magyarországon a 85 év feletti betegek körében a combnyaktörés miatt végzett műtétet követően rendkívül magas a mortalitás.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Surgical risk and the burden of immobilization contribute to very poor survival rates in this frail demographic.",
        "explanation_hu": "A sebészeti kockázat és az immobilizáció terhe hozzájárul a nagyon rossz túlélési arányokhoz ebben a sérülékeny korcsoportban."
    },
    {
        "id": "tk10_597",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Bisphosphonates are pharmacological agents used to manage bone resorption and support bone density.",
        "question_text_hu": "A biszfoszfonátok a csontreszorpció kezelésére és a csontsűrűség támogatására használt gyógyszerek.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "They are first-line treatments for osteoporosis that inhibit osteoclast activity.",
        "explanation_hu": "Ezek az oszteoporózis elsővonalbeli kezelései, amelyek gátolják az oszteoklasztok aktivitását."
    },
    {
        "id": "tk10_598",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Osteopetrosis and senile osteoporosis are synonymous terms for age-related bone thinning.",
        "question_text_hu": "Az oszteopetrózis és a szenilis oszteoporózis szinonim kifejezések az időskori csontritkulásra.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Osteopetrosis is a disease of pathologically thickened bone, whereas osteoporosis involves bone thinning.",
        "explanation_hu": "Az oszteopetrózis a kórosan megvastagodott csont betegsége, míg az oszteoporózis csontritkulással jár."
    },
    {
        "id": "tk10_599",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the bone metabolic condition with its defining characteristic.",
        "question_text_hu": "Párosítsa a csontanyagcsere-állapotot annak meghatározó jellemzőjével.",
        "options": {
            "en": [
                "A: Osteoporosis -> 1: Combined quantitative loss of organic matrix and mineral",
                "B: Osteomalacia -> 2: Qualitative mineral deficit with intact or hypertrophic matrix",
                "C: Rickets -> 3: Childhood Vitamin D deficiency with craniotabes and bone deformities",
                "D: Senile Porosis -> 4: Global weakening of both cortical and trabecular bone in the elderly"
            ],
            "hu": [
                "A: Oszteoporózis -> 1: A szerves mátrix és az ásványi anyag együttes kvantitatív vesztése",
                "B: Oszteomalácia -> 2: Kvalitatív ásványianyag-defektus ép vagy hipertrófiás mátrix mellett",
                "C: Rachitis -> 3: Gyermekkori D-vitamin-hiány craniotabesszel és csontdeformitásokkal",
                "D: Szenilis porózis -> 4: A kortikális és trabekuláris csont globális meggyengülése időseknél"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Distinguishing between quantity and quality defects is essential for accurate diagnosis.",
        "explanation_hu": "A mennyiségi és minőségi hibák megkülönböztetése alapvető a pontos diagnózishoz."
    },
    {
        "id": "tk10_600",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the factor or intervention with its physiological effect on bone.",
        "question_text_hu": "Párosítsa a tényezőt vagy beavatkozást annak csontrendszeri élettani hatásával.",
        "options": {
            "en": [
                "A: Estrogen presence -> 1: Protects bone density by modulating OPG/RANKL ratio",
                "B: Axial loading -> 2: Stimulates osteoblasts through mechanotransduction",
                "C: ALP deficiency -> 3: Leads to accumulation of pyrophosphate (mineralization inhibitor)",
                "D: Adiposity -> 4: Provides protective estrogen through peripheral aromatization"
            ],
            "hu": [
                "A: Ösztrogén jelenléte -> 1: Védi a csontsűrűséget az OPG/RANKL arány modulálásával",
                "B: Axiális terhelés -> 2: Az oszteoblasztok stimulálása mehanotranszdukción keresztül",
                "C: ALP-hiány -> 3: Pirofoszfát (mineralizáció-gátló) felhalmozódásához vezet",
                "D: Adipozitás -> 4: Védő ösztrogént biztosít perifériás aromatizáció révén"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Multiple factors, including hormones and mechanical stress, interact to maintain bone health.",
        "explanation_hu": "Számos tényező, köztük hormonok és mechanikai stressz kölcsönhatása tartja fenn a csontok egészségét."
    }
]