[
    {
        "id": "tk10_721",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "There is no 'aldosterone escape mechanism' in secondary hyperaldosteronism associated with edema because the salt and water retained by the kidney continuously leaves the vascular bed to accumulate in the interstitium.",
        "question_text_hu": "Az ödémával járó szekunder hiperaldoszteronizmusban nincs 'aldoszteron-escape mechanizmus', mert a vese által visszatartott só és víz folyamatosan elhagyja az érrendszert, hogy az interstitiumban halmozódjon fel.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Since fluid doesn't remain in the vascular bed, atrial stretch is insufficient to trigger enough ANP to stop sodium reabsorption.",
        "explanation_hu": "Mivel a folyadék nem marad az érrendszerben, a pitvari feszülés nem elegendő ahhoz, hogy annyi ANP-t váltson ki, ami leállítaná a nátrium visszaszívását."
    },
    {
        "id": "tk10_722",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Secondary hyperaldosteronism develops in patients with chronic congestive heart failure despite normal or low effective circulating volume because decreased cardiac output and renal blood flow activate the renin-angiotensin-aldosterone system (RAAS).",
        "question_text_hu": "Krónikus pangásos szívelégtelenségben szekunder hiperaldoszteronizmus alakul ki a normális vagy alacsony effektív keringő térfogat ellenére, mert a csökkent perctérfogat és vesevéráramlás aktiválja a renin-angiotenzin-aldoszteron-rendszert (RAAS).",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "The body perceives the low effective circulating volume (even if total volume is high) as a signal to retain more salt and water.",
        "explanation_hu": "A szervezet az alacsony effektív keringő térfogatot (még ha az össztérfogat magas is) jelként értékeli a több só és víz visszatartására."
    },
    {
        "id": "tk10_723",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Renovascular hypertension is a form of secondary hyperaldosteronism with hypertension, because renal artery narrowing induces local hypoperfusion and activates the juxtaglomerular apparatus to secrete renin.",
        "question_text_hu": "A renovaszkuláris hipertónia a szekunder hiperaldoszteronizmus hipertóniával járó formája, mert a veseartéria-szűkület helyi hipoperfúziót vált ki, és aktiválja a juxtaglomeruláris apparátust renin szekretálására.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "The kidney 'misinterprets' the local stenosis as systemic hypotension and triggers a systemic pressure rise via RAAS.",
        "explanation_hu": "A vese a helyi szűkületet 'félreértelmezi' szisztémás hipotenzióként, és a RAAS-on keresztül szisztémás vérnyomás-emelkedést vált ki."
    },
    {
        "id": "tk10_724",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Hypoproteinemia in nephrotic syndrome leads to massive edema and secondary hyperaldosteronism, because decreased plasma oncotic pressure allows fluid to shift into the interstitium, resulting in intravascular hypovolemia.",
        "question_text_hu": "A nephrosis-szindrómában fellépő hipoproteinémia masszív ödémához és szekunder hiperaldoszteronizmushoz vezet, mert a csökkent plazma onkotikus nyomás miatt a folyadék az interstitiumba áramlik, ami intravaszkuláris hipovolemiát eredményez.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "True + explanation",
        "explanation_en": "The loss of proteins lowers the force keeping fluid in the vessels (Starling principle), sparking a compensatory but futile RAAS activation.",
        "explanation_hu": "A fehérjevesztés csökkenti a folyadékot az erekben tartó erőt (Starling-elv), ami kompenzáló, de hiábavaló RAAS-aktivációt vált ki."
    },
    {
        "id": "tk10_725",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following conditions cause secondary hyperaldosteronism WITH hypertension (non-compensating forms)? Select all that apply.",
        "question_text_hu": "Az alábbi állapotok közül melyek okoznak szekunder hiperaldoszteronizmust hipertóniával (nem kompenzáló formák)? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Renin-secreting tumor (e.g. Wilms tumor)",
                "Renal artery stenosis (atherosclerotic plaque)",
                "Fibromuscular dysplasia of the renal artery",
                "Bartter syndrome",
                "Hypoalbuminemia due to liver failure"
            ],
            "hu": [
                "Renin-szekretáló tumor (pl. Wilms-tumor)",
                "Veseartéria-szűkület (ateroszklerotikus plakk)",
                "A veseartéria fibromuszkuláris diszpláziája",
                "Bartter-szindróma",
                "Májelégtelenség miatti hipalbuminémia"
            ]
        },
        "correct_answer": "Renin-szekretáló tumor (pl. Wilms-tumor), Veseartéria-szűkület (ateroszklerotikus plakk), A veseartéria fibromuszkuláris diszpláziája",
        "explanation_en": "Bartter syndrome and liver failure typically present with normal or low blood pressure due to salt wasting or fluid shifts.",
        "explanation_hu": "A Bartter-szindróma és a májelégtelenség jellemzően normális vagy alacsony vérnyomással jár a sóvesztés vagy a folyadékeltolódás miatt."
    },
    {
        "id": "tk10_726",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which clinical scenarios trigger 'compensating' secondary hyperaldosteronism (typically without hypertension)? Select all that apply.",
        "question_text_hu": "Mely klinikai forgatókönyvek váltanak ki 'kompenzáló' szekunder hiperaldoszteronizmust (jellemzően hipertónia nélkül)? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Exsiccosis due to prolonged vomiting or diarrhea",
                "Massive sweating in a tropical climate",
                "Osmotic diuresis in uncontrolled diabetes mellitus",
                "Autonomous aldosterone production in Conn's syndrome",
                "Renovascular hypertension due to renal artery stenosis"
            ],
            "hu": [
                "Hosszabb hányás vagy hasmenés miatti exsiccosis",
                "Masszív izzadás trópusi éghajlaton",
                "Ozmotikus diurézis kezeletlen diabetes mellitusban",
                "Autonóm aldoszterontermelés Conn-szindrómában",
                "Veseartéria-szűkület miatti renovaszkuláris hipertónia"
            ]
        },
        "correct_answer": "Hosszabb hányás vagy hasmenés miatti exsiccosis, Masszív izzadás trópusi éghajlaton, Ozmotikus diurézis kezeletlen diabetes mellitusban",
        "explanation_en": "In compensating forms, RAAS activation helps restore baseline volume without causing pathological hypertension.",
        "explanation_hu": "Kompenzáló formákban a RAAS-aktiváció segít az alapvolumen helyreállításában anélkül, hogy patológiás hipertóniát okozna."
    },
    {
        "id": "tk10_727",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which clinical findings typically accompany secondary hyperaldosteronism in portal hypertension (liver cirrhosis)? Select all that apply.",
        "question_text_hu": "Mely klinikai leletek kísérik tipikusan a szekunder hiperaldoszteronizmust portális hipertóniában (májcirrózis)? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Ascites",
                "Anasarca (generalized edema)",
                "Central hypotension",
                "Hypokalemia and alkalosis",
                "Severe systemic hypertension (>180 mmHg)"
            ],
            "hu": [
                "Ascites",
                "Anasarca (generalizált ödéma)",
                "Központi hipotenzió",
                "Hipokalémia és alkalózis",
                "Súlyos szisztémás hipertónia (>180 Hgmm)"
            ]
        },
        "correct_answer": "Ascites, Anasarca (generalizált ödéma), Központi hipotenzió, Hipokalémia és alkalózis",
        "explanation_en": "Systemic blood pressure is usually low or normal because the retained fluid is sequestered in the portal system or interstitium.",
        "explanation_hu": "A szisztémás vérnyomás általában alacsony vagy normális, mert a visszatartott folyadék a portális rendszerben vagy az interstitiumban szekvesztrálódik."
    },
    {
        "id": "tk10_728",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "In which conditions is the Starling principle directly involved in shifting fluid to the interstitium, driving RAAS activation? Select all that apply.",
        "question_text_hu": "Mely állapotokban vesz részt közvetlenül a Starling-elv a folyadék interstitiumba történő eltolódásában, a RAAS-aktivációt hajtva? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Chronic congestive heart failure",
                "Nephrotic syndrome (hypoproteinemia)",
                "Liver failure (hypoproteinaemia and portal hypertension)",
                "Acute pheochromocytoma attack",
                "Renal salt-wasting in Bartter syndrome"
            ],
            "hu": [
                "Krónikus pangásos szívelégtelenség",
                "Nephrosis-szindróma (hipoproteinémia)",
                "Májelégtelenség (hipoproteinémia és portális hipertónia)",
                "Akut phaeochromocytoma-roham",
                "Renális sóvesztés Bartter-szindrómában"
            ]
        },
        "correct_answer": "Krónikus pangásos szívelégtelenség, Nephrosis-szindróma (hipoproteinémia), Májelégtelenség (hipoproteinémia és portális hipertónia)",
        "explanation_en": "High capillary hydrostatic pressure (CHF) or low oncotic pressure (Nephrosis) shifts fluid balance according to Starling's forces.",
        "explanation_hu": "A magas kapilláris hidrosztatikai nyomás (CHF) vagy az alacsony onkotikus nyomás (Nephrosis) eltolja a folyadékegyensúlyt a Starling-erőknek megfelelően."
    },
    {
        "id": "tk10_729",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Which of the following can manifest with features of glucocorticoid-induced mineralocorticoid excess? Select all that apply.",
        "question_text_hu": "Az alábbiak közül melyek nyilvánulhatnak meg glükokortikoid-indukált mineralokortikoid-túlsúlya utaló jelekkel? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Cushing's disease (pituitary etiology)",
                "Ectopic ACTH-producing syndrome",
                "Ectopic CRH-producing syndrome",
                "Primary adrenal cortisol-secreting tumor",
                "True hyperaldosteronism (Conn's syndrome)"
            ],
            "hu": [
                "Cushing-kór (hipofizer etiológia)",
                "Ektopiás ACTH-termelő szindróma",
                "Ektopiás CRH-termelő szindróma",
                "Primer mellékvese kortizolszekretáló tumor",
                "Valódi hiperaldoszteronizmus (Conn-szindróma)"
            ]
        },
        "correct_answer": "Cushing-kór (hipofizer etiológia), Ektopiás ACTH-termelő szindróma, Ektopiás CRH-termelő szindróma, Primer mellékvese kortizolszekretáló tumor",
        "explanation_en": "These forms of hypercortisolism involve mineralocorticoid receptor activation by high cortisol levels, unlike Conn's which is pure aldosteronism.",
        "explanation_hu": "A hiperkortizolizmus ezen formái a mineralokortikoid receptorok magas kortizolszint miatti aktivációjával járnak, ellentétben a Conn-szindrómával, ami tiszta aldoszteronizmus."
    },
    {
        "id": "tk10_730",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "Why does metabolic alkalosis in hyperaldosteronism impair tissue oxygenation?",
        "question_text_hu": "Miért gátolja a szövetek oxigénellátását a hiperaldoszteronizmusban fellépő metabolikus alkalózis?",
        "options": {
            "en": [
                "It causes a leftward shift of the hemoglobin-oxygen dissociation curve",
                "It causes a rightward shift of the hemoglobin-oxygen dissociation curve",
                "It causes direct denaturation of the heme cofactor",
                "It increases blood viscosity by promoting erythrocyte aggregation"
            ],
            "hu": [
                "A hemoglobin-oxigén disszociációs görbe balra tolódását okozza",
                "A hemoglobin-oxigén disszociációs görbe jobbra tolódását okozza",
                "A hem kofaktor közvetlen denaturációját okozza",
                "A vörösvértest-aggregáció elősegítésével növeli a vér viszkozitását"
            ]
        },
        "correct_answer": "A hemoglobin-oxigén disszociációs görbe balra tolódását okozza",
        "explanation_en": "A leftward shift (reverse Bohr effect) means hemoglobin binds oxygen more tightly, reducing its release to the tissues.",
        "explanation_hu": "A balra tolódás (fordított Bohr-effektus) azt jelenti, hogy a hemoglobin szorosabban köti az oxigént, csökkentve annak szövetek felé történő leadását."
    },
    {
        "id": "tk10_731",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the primary hemodynamic trigger in 'compensating forms' of secondary hyperaldosteronism?",
        "question_text_hu": "Mi az elsődleges hemodinamikai kiváltó tényező a szekunder hiperaldoszteronizmus 'kompenzáló formáiban'?",
        "options": {
            "en": [
                "A decrease in effective intravascular volume",
                "A massive rise in systemic systolic blood pressure",
                "Atrophy of the pituitary gland's acidophilic cells",
                "Excessive production of cortisol-binding globulin (CBG)"
            ],
            "hu": [
                "Az effektív intravaszkuláris térfogat csökkenése",
                "A szisztémás szisztolés vérnyomás masszív emelkedése",
                "A hipofízis acidofil sejtjeinek atrófiája",
                "A kortizolkötő globulin (CBG) túltermelése"
            ]
        },
        "correct_answer": "Az effektív intravaszkuláris térfogat csökkenése",
        "explanation_en": "Volume loss triggers RAAS to restore homeostasis rather than to drive a pathological hypertensive state.",
        "explanation_hu": "A térfogatvesztés aktiválja a RAAS-t a homeosztázis helyreállítása érdekében, nem pedig patológiás hipertóniás állapot fenntartására."
    },
    {
        "id": "tk10_732",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which enzyme converts Angiotensin I into Angiotensin II, and where is it primarily expressed?",
        "question_text_hu": "Melyik enzim alakítja át az angiotenzin I-et angiotenzin II-vé, és hol expresszálódik elsősorban?",
        "options": {
            "en": [
                "ACE, pulmonary vascular endothelial cells",
                "Renin, juxtaglomerular cells of the kidney",
                "Aromatase, subcutaneous adipose tissue",
                "Pepsin, gastric chief cells"
            ],
            "hu": [
                "ACE, tüdő vaszkuláris endothelsejtjei",
                "Renin, a vese juxtaglomeruláris sejtjei",
                "Aromatáz, szubkután zsírszövet",
                "Pepszin, a gyomor fősejtjei"
            ]
        },
        "correct_answer": "ACE, tüdő vaszkuláris endothelsejtjei",
        "explanation_en": "Angiotensin Converting Enzyme (ACE) is highly expressed on the surface of pulmonary capillary endothelial cells.",
        "explanation_hu": "Az angiotenzin-konvertáló enzim (ACE) magas szinten expresszálódik a tüdő kapilláris endothelsejtjeinek felszínén."
    },
    {
        "id": "tk10_733",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "What is a characteristic clinical feature of primary hyperreninism caused by a renin-secreting tumor?",
        "question_text_hu": "Mi a jellemző klinikai tulajdonsága a renin-szekretáló tumor okozta primer hiperreninizmusnak?",
        "options": {
            "en": [
                "Systemic hypertension and hypokalemia without significant edema",
                "Hypotension and hyperkalemic metabolic acidosis",
                "Generalized anasarca and acute renal failure",
                "Diffuse hyposmolarity and hyperpigmentation of mucous membranes"
            ],
            "hu": [
                "Szisztémás hipertónia és hipokalémia jelentős ödéma nélkül",
                "Hipotenzió és hiperkalémiás metabolikus acidózis",
                "Generalizált anasarca és akut veseelégtelenség",
                "Diffúz hipoozmolaritás és a nyálkahártyák hiperpigmentációja"
            ]
        },
        "correct_answer": "Szisztémás hipertónia és hipokalémia jelentős ödéma nélkül",
        "explanation_en": "Unlike secondary forms where fluid escapes the vessels, primary renin excess expands the intravascular volume, triggering the aldosterone escape mechanism.",
        "explanation_hu": "A szekunder formákkal ellentétben, ahol a folyadék elhagyja az ereket, a primer reninfelesleg tágítja az intravaszkuláris térfogatot, kiváltva az aldoszteron-escape mechanizmust."
    },
    {
        "id": "tk10_734",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Why does arterial hypertension often persist in renovascular stenosis even after the initial hyperreninemia subsides?",
        "question_text_hu": "Miért marad fenn gyakran az artériás hipertónia renovaszkuláris szűkületben még a kezdeti hiperreninémia enyhülése után is?",
        "options": {
            "en": [
                "Due to permanent structural changes like fibromuscular dysplasia in the renal vessels",
                "Because the kidney develops ectopic cortisol-producing tissue",
                "Due to the failure of the medullary vasomotor center to reset",
                "Because atrial natriuretic peptide (ANP) receptors are irreversibly inhibited"
            ],
            "hu": [
                "A veseerek maradandó szerkezeti változásai, például fibromuszkuláris diszplázia miatt",
                "Mert a vese ektopiás kortizoltermelő szövetet fejleszt",
                "A nyúltvelői vazomotor központ átállítódásának kudarca miatt",
                "Mert a pitvari nátriuretikus peptid (ANP) receptorok irreverzibilisen gátlódnak"
            ]
        },
        "correct_answer": "A veseerek maradandó szerkezeti változásai, például fibromuszkuláris diszplázia miatt",
        "explanation_en": "Chronic resistance leads to structural remodeling of the vessel walls, maintaining high pressure independently of renin.",
        "explanation_hu": "A krónikus ellenállás az érfalak szerkezeti átépüléséhez vezet, fenntartva a magas nyomást a renintől függetlenül."
    },
    {
        "id": "tk10_735",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What happens to the effective cardiac output in chronic congestive heart failure despite compensatory salt and water retention?",
        "question_text_hu": "Mi történik az effektív perctérfogattal krónikus pangásos szívelégtelenségben a kompenzatórikus só- és vízvisszatartás ellenére?",
        "options": {
            "en": [
                "It remains low because of poor myocardial pump function",
                "It increases dramatically to super-physiological levels",
                "It causes a sudden increase in intracranial pressure and hemorrhage",
                "It is completely replaced by retrograde portal flow"
            ],
            "hu": [
                "Alacsony marad a gyenge miokardiális pumpafunkció miatt",
                "Drámaian megemelkedik szuper-fiziológiás szintekre",
                "Az intrakraniális nyomás hirtelen emelkedését és vérzést okoz",
                "Teljesen felváltja a retrográd portális áramlás"
            ]
        },
        "correct_answer": "Alacsony marad a gyenge miokardiális pumpafunkció miatt",
        "explanation_en": "The retained fluid increases venous congestion and edema rather than effectively improving the stroke volume of a failing heart.",
        "explanation_hu": "A visszatartott folyadék fokozza a vénás pangást és az ödémát, ahelyett, hogy hatékonyan javítaná a beteg szív lökettérfogatát."
    },
    {
        "id": "tk10_736",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which condition is characterized by a 'salt-losing kidney' and secondary hyperaldosteronism due to increased renin and atriopeptin levels?",
        "question_text_hu": "Melyik állapotra jellemző a 'sóvesztő vese' és a megnövekedett renin- és atriopeptinszint miatti szekunder hiperaldoszteronizmus?",
        "options": {
            "en": [
                "Bartter's syndrome",
                "Conn's syndrome",
                "Addison's disease",
                "Cushing's syndrome"
            ],
            "hu": [
                "Bartter-szindróma",
                "Conn-szindróma",
                "Addison-kór",
                "Cushing-szindróma"
            ]
        },
        "correct_answer": "Bartter-szindróma",
        "explanation_en": "Bartter's involves primary renal salt loss which creates a state of chronic hypovolemia and RAAS activation.",
        "explanation_hu": "A Bartter-szindróma primer renális sóvesztéssel jár, ami krónikus hipovolemiát és RAAS-aktivációt eredményez."
    },
    {
        "id": "tk10_737",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is a common side effect of non-potassium-sparing diuretic treatments on the endocrine system?",
        "question_text_hu": "Mi a nem kálium-megtakarító vizelethajtó kezelések gyakori mellékhatása az endokrin rendszerre?",
        "options": {
            "en": [
                "Compensatory RAAS activation causing hypokalemia and metabolic alkalosis",
                "Complete suppression of aldosterone biosynthesis",
                "Hypertrophy of the pituitary somatotropic cells",
                "Immediate resolution of chronic hypernatremia"
            ],
            "hu": [
                "Kompenzáló RAAS-aktiváció, ami hipokalémiát és metabolikus alkalózist okoz",
                "Az aldoszteron-bioszintézis teljes szuppressziója",
                "A hipofízis szomatotróp sejtjeinek hipertrófiája",
                "A krónikus hipernatrémia azonnali megszűnése"
            ]
        },
        "correct_answer": "Kompenzáló RAAS-aktiváció, ami hipokalémiát és metabolikus alkalózist okoz",
        "explanation_en": "Diuretics (except spironolactone or eplerenone) cause salt loss which the body tries to counter via RAAS, leading to secondary potassium wasting.",
        "explanation_hu": "A vizelethajtók (kivéve a spironolaktont vagy eplerenont) sóvesztést okoznak, amit a szervezet a RAAS-on keresztül próbál ellensúlyozni, ami szekunder káliumvesztéshez vezet."
    },
    {
        "id": "tk10_738",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "In portal hypertension (liver cirrhosis), where does the retained fluid primarily sequester?",
        "question_text_hu": "Portális hipertóniában (májcirrózis) hol szekvesztrálódik elsősorban a visszatartott folyadék?",
        "options": {
            "en": [
                "In the portal venous system (ascites) and the interstitium",
                "Within the subarachnoid space (cerebral edema)",
                "In the dental pulp of primary molars",
                "In the anterior chamber of the eye"
            ],
            "hu": [
                "A portális vénás rendszerben (ascites) és az interstitiumban",
                "A szubarachnoideális térben (agyödéma)",
                "Az elsődleges őrlőfogak fogbelében",
                "A szem elülső csarnokában"
            ]
        },
        "correct_answer": "A portális vénás rendszerben (ascites) és az interstitiumban",
        "explanation_en": "Venous congestion in the portal system and low albumin levels drive fluid out of the circulation into the peritoneal cavity and tissues.",
        "explanation_hu": "A portális rendszer vénás pangása és az alacsony albuszint kivezeti a folyadékot a keringésből a hasüregbe és a szövetekbe."
    },
    {
        "id": "tk10_739",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which laboratory finding directly contributes to the decreased plasma oncotic pressure in nephrotic syndrome?",
        "question_text_hu": "Melyik laboratóriumi lelet járul hozzá közvetlenül a csökkent plazma onkotikus nyomáshoz nephrosis-szindrómában?",
        "options": {
            "en": [
                "Hypoalbuminemia",
                "Hyperglycemia",
                "Hypercalcemia",
                "Hypovitaminosis C"
            ],
            "hu": [
                "Hipalbuminémia",
                "Hiperglikémia",
                "Hiperkalcémia",
                "C-vitamin-hiány"
            ]
        },
        "correct_answer": "Hipalbuminémia",
        "explanation_en": "Albumin is the major serum protein responsible for maintaining the colloid osmotic (oncotic) pressure in the vascular compartment.",
        "explanation_hu": "Az albumin a szérum fő fehérjéje, amely a vaszkuláris kompartment kolloid ozmotikus (onkotikus) nyomásának fenntartásáért felelős."
    },
    {
        "id": "tk10_740",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "What is the clinical significance of dietary sodium restriction in patients with Conn's syndrome?",
        "question_text_hu": "Mi az étrendi nátrium-megszorítás klinikai jelentősége Conn-szindrómás betegeknél?",
        "options": {
            "en": [
                "It can effectively help in reducing arterial blood pressure",
                "It causes characteristic hypercarotenemia (orange skin)",
                "It induces rapid malignant transformation of the adrenal adenoma",
                "It leads to irreversible resistance to mineralocorticoid antagonists"
            ],
            "hu": [
                "Hatékonyan segíthet az artériás vérnyomás csökkentésében",
                "Jellemző hiperkarotinémiát (narancssárga bőr) okoz",
                "A mellékvese-adenoma gyors malignus transzformációját váltja ki",
                "A mineralokortikoid-antagonistákkal szembeni irreverzibilis rezisztenciához vezet"
            ]
        },
        "correct_answer": "Hatékonyan segíthet az artériás vérnyomás csökkentésében",
        "explanation_en": "Reducing sodium intake limits the substrate for aldosterone-driven volume expansion, helping to lower blood pressure.",
        "explanation_hu": "A nátriumbevitel csökkentése korlátozza az aldoszteron által hajtott térfogattágulás alapját, segítve a vérnyomás csökkentését."
    },
    {
        "id": "tk10_741",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Angiotensin II induces aldosterone secretion from the zona glomerulosa of the adrenal cortex.",
        "question_text_hu": "Az angiotenzin II aldoszteron-szekréciót vált ki a mellékvesekéreg zona glomerulosa részéből.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Angiotensin II is the primary hormonal stimulant for the cells of the zona glomerulosa.",
        "explanation_hu": "Az angiotenzin II a zona glomerulosa sejtjeinek elsődleges hormonális stimulánsa."
    },
    {
        "id": "tk10_742",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Secondary hyperaldosteronism with edema is always characterized by severe systemic hypertension.",
        "question_text_hu": "Az ödémával járó szekunder hiperaldoszteronizmust mindig súlyos szisztémás hipertónia jellemzi.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "False",
        "explanation_en": "Because fluid escapes the vascular bed into the interstitium, the effective blood pressure often remains normal or low (hypotension).",
        "explanation_hu": "Mivel a folyadék elhagyja az érrendszert az interstitium felé, az effektív vérnyomás gyakran normális vagy alacsony (hipotenzió) marad."
    },
    {
        "id": "tk10_743",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Renin is a proteolytic enzyme secreted by the kidney that cleaves angiotensinogen into angiotensin I.",
        "question_text_hu": "A renin a vese által elválasztott proteolitikus enzim, amely az angiotenzinogént angiotenzin I-gyé hasítja.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Renin catalyzes the first and rate-limiting step in the activation of the RAAS system.",
        "explanation_hu": "A renin katalizálja a RAAS-rendszer aktiválásának első és sebességkorlátozó lépését."
    },
    {
        "id": "tk10_744",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Atrial Natriuretic Peptide (ANP) inhibits aldosterone synthesis by elevating intracellular cGMP levels in the glomerulosa cells.",
        "question_text_hu": "A pitvari nátriuretikus peptid (ANP) a sejtosztódáson belüli cGMP-szint emelésével gátolja az aldoszteron-szintézist a glomerulosa-sejtekben.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "ANP has direct inhibitory effects on the adrenal gland as well as vasodilatory and natriuretic actions.",
        "explanation_hu": "Az ANP közvetlen gátló hatást fejt ki a mellékvesére, emellett vazodilatátor és nátriuretikus hatása is van."
    },
    {
        "id": "tk10_745",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "In Bartter's syndrome, primary renal salt-wasting leads to compensatory secondary hyperaldosteronism.",
        "question_text_hu": "Bartter-szindrómában a primer renális sóvesztés kompenzatórikus szekunder hiperaldoszteronizmushoz vezet.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "Chronic hypovolemia caused by salt loss activates the RAAS system to maintain baseline perfusion.",
        "explanation_hu": "A sóvesztés okozta krónikus hipovolemia aktiválja a RAAS-rendszert az alapvető perfúzió fenntartása érdekében."
    },
    {
        "id": "tk10_746",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Loop diuretics can worsen secondary hyperaldosteronism in patients with heart failure.",
        "question_text_hu": "A kacs-vizelethajtók súlyosbíthatják a szekunder hiperaldoszteronizmust szívelégtelenségben szenvedő betegeknél.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "By inducing further salt loss and hypovolemia, these drugs trigger even more intensive RAAS activation.",
        "explanation_hu": "További sóvesztés és hipovolemia előidézésével ezek a gyógyszerek még intenzívebb RAAS-aktivációt váltanak ki."
    },
    {
        "id": "tk10_747",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "Cushing's syndrome can present with symptoms of mineralocorticoid hyperfunction even without elevated aldosterone levels.",
        "question_text_hu": "A Cushing-szindróma mineralokortikoid hiperfunkciós tünetekkel jelentkezhet emelkedett aldoszteronszint nélkül is.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "True",
        "explanation_en": "High cortisol levels saturate the 11-beta-HSD2 enzyme and directly activate mineralocorticoid receptors, mimicking hyperaldosteronism.",
        "explanation_hu": "A magas kortizolszint telíti a 11-béta-HSD2 enzimet, és közvetlenül aktiválja a mineralokortikoid receptorokat, a hiperaldoszteronizmust imitálva."
    },
    {
        "id": "tk10_748",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical and laboratory profile with the corresponding type of hyperaldosteronism.",
        "question_text_hu": "Párosítsa a klinikai és laboratóriumi profilt a hiperaldoszteronizmus megfelelő típusával.",
        "options": {
            "en": [
                "A: Hypertension + low renin -> 1: Primary hyperaldosteronism (Conn's syndrome)",
                "B: Hypertension + high renin -> 2: Secondary hyperaldosteronism (Renal artery stenosis)",
                "C: Hypotension/Edema + high renin -> 3: Secondary hyperaldosteronism (Heart failure)",
                "D: Hypotension + high renin (no edema) -> 4: Secondary hyperaldosteronism (Salt wasting/Exsiccosis)"
            ],
            "hu": [
                "A: Hipertónia + alacsony renin -> 1: Primer hiperaldoszteronizmus (Conn-szindróma)",
                "B: Hipertónia + magas renin -> 2: Szekunder hiperaldoszteronizmus (Veseartéria-szűkület)",
                "C: Hipotenzió/Ödéma + magas renin -> 3: Szekunder hiperaldoszteronizmus (Szívelégtelenség)",
                "D: Hipotenzió + magas renin (nincs ödéma) -> 4: Szekunder hiperaldoszteronizmus (Sóvesztés/Exsiccosis)"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "These profiles allow clinicians to differentiate between adrenal-autonomous and extra-adrenal reactive causes.",
        "explanation_hu": "Ezek a profilok lehetővé teszik a klinikusok számára a mellékvese-autonóm és a mellékvesén kívüli reaktív okok megkülönböztetését."
    },
    {
        "id": "tk10_749",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the underlying pathology with the primary Starling force disruption leading to edema.",
        "question_text_hu": "Párosítsa a háttérben álló patológiát az ödémához vezető elsődleges Starling-erő zavarával.",
        "options": {
            "en": [
                "A) Congestive heart failure",
                "B) Nephrotic syndrome",
                "C) Liver cirrhosis",
                "D) Common end-pathway"
            ],
            "hu": [
                "A) Pangásos szívelégtelenség",
                "B) Nephrosis-szindróma",
                "C) Májcirrózis",
                "D) Közös végút"
            ]
        },
        "items": {
            "en": [
                "1) Increased capillary hydrostatic pressure",
                "2) Decreased plasma oncotic pressure",
                "3) Decreased oncotic pressure + portal hypertension",
                "4) Net fluid shift from intravascular to interstitial space"
            ],
            "hu": [
                "1) Megnövekedett kapilláris hidrosztatikai nyomás",
                "2) Csökkent plazma onkotikus nyomás",
                "3) Csökkent onkotikus nyomás + portális hipertónia",
                "4) Nettó folyadékeltolódás az intravaszkulárisból az interstitialis térbe"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Starling forces govern the fundamental pathophysiology of fluid distribution in edematous diseases.",
        "explanation_hu": "A Starling-erők irányítják a folyadékeloszlás alapvető patofiziológiáját az ödémás betegségekben."
    },
    {
        "id": "tk10_750",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical syndrome with its typical diagnostic presentation regarding hypertension and edema.",
        "question_text_hu": "Párosítsa a klinikai szindrómát a hipertóniára és ödémára vonatkozó tipikus diagnosztikai megjelenésével.",
        "options": {
            "en": [
                "A) Conn's syndrome",
                "B) Renin-secreting tumor",
                "C) Nephrotic syndrome",
                "D) Bartter's syndrome"
            ],
            "hu": [
                "A) Conn-szindróma",
                "B) Renin-szekretáló tumor",
                "C) Nephrosis-szindróma",
                "D) Bartter-szindróma"
            ]
        },
        "items": {
            "en": [
                "1) Hypertension: Yes; Edema: No",
                "2) Hypertension: Yes; Edema: No",
                "3) Hypertension: Variable/No; Edema: Yes",
                "4) Hypertension: No; Edema: No"
            ],
            "hu": [
                "1) Hipertónia: Igen; Ödéma: Nem",
                "2) Hipertónia: Igen; Ödéma: Nem",
                "3) Hipertónia: Változó/Nem; Ödéma: Igen",
                "4) Hipertónia: Nem; Ödéma: Nem"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "The combination of these physical signs narrowing down the differential diagnosis in mineralocorticoid disorders.",
        "explanation_hu": "Ezen fizikális jelek kombinációja leszűkíti a differenciáldiagnózist a mineralokortikoid-zavarokban."
    }
]