[
    {
        "id": "tk10_91",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Patients with Sheehan syndrome exhibit a clinical absence of lactation because ischemic necrosis of the anterior pituitary following postpartum shock primarily impairs prolactin production.",
        "question_text_hu": "A Sheehan-szindrómás betegeknél a laktáció klinikai hiánya tapasztalható, mert a szülés utáni sokkot követő hipofízis elülső lebenyének iszkémiás nekrózisa elsősorban a prolaktintermelést károsítja.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "PRL-producing cells are hyperplastic during pregnancy and highly sensitive to ischemia during postpartum shock.",
        "explanation_hu": "A PRL-termelő sejtek terhesség alatt hiperplasztikusak és rendkívül érzékenyek az iszkémiára a szülés utáni sokk során."
    },
    {
        "id": "tk10_92",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Central diabetes insipidus leads to primary polyuria and an inability to concentrate urine because the lack of ADH prevents the insertion of aquaporin channels into the renal collecting ducts.",
        "question_text_hu": "A centrális diabetes insipidus primer poliuriához és a vizeletkoncentrálás képtelenségéhez vezet, mert az ADH hiánya megakadályozza az akvaporin-csatornák beépülését a vese gyűjtőcsatornáiba.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "ADH (vasopressin) is essential for water reabsorption through aquaporins in the collecting duct.",
        "explanation_hu": "Az ADH (vazopresszin) elengedhetetlen a víz visszaszívásához a gyűjtőcsatornában lévő akvaporinokon keresztül."
    },
    {
        "id": "tk10_93",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Adipsic diabetes insipidus poses a higher risk of hyperosmolar coma than the classic central form because the patient's thirst mechanism does not trigger proportional to their water loss.",
        "question_text_hu": "Az adipsziás diabetes insipidus nagyobb kockázatot jelent a hiperozmoláris kómára, mint a klasszikus centrális forma, mert a beteg szomjúságérzete nem a vízveszteségével arányosan váltódik ki.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Failure to drink in response to polyuria leads to rapid hypertonic dehydration and neurological complications.",
        "explanation_hu": "A poliuriára válaszul fellépő ivás elmaradása gyors hipertoniás dehidratációhoz és neurológiai szövődményekhez vezet."
    },
    {
        "id": "tk10_94",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "SIADH typically results in systemic water-intoxication even at normal osmotic pressures because the syndrome involves inappropriate ADH secretion induced by non-osmotic stimuli like stress or paraneoplastic production.",
        "question_text_hu": "A SIADH jellemzően szisztémás vízmérgezést eredményez normál ozmotikus nyomás mellett is, mert a szindróma nem ozmotikus ingerek, például stressz vagy paraneopláziás termelés által kiváltott nem megfelelő ADH-szekrécióval jár.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "In SIADH, ADH is released regardless of plasma osmolality, causing excessive water retention and hyponatremia.",
        "explanation_hu": "SIADH-ban az ADH a plazma ozmolalitásától függetlenül szabadul fel, ami túlzott vízvisszatartást és hiponátriémiát okoz."
    },
    {
        "id": "tk10_95",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Pituitary dwarfism becomes clinically manifest only after the first year of life because factors other than growth hormone (GH) regulate growth during the in utero period.",
        "question_text_hu": "A hipofízeális törpenövés csak az élet első éve után válik klinikailag manifesztté, mert az in utero időszakban a növekedési hormonon (GH) kívüli egyéb tényezők szabályozzák a növekedést.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Fetal growth is dependent on insulin, IGF-II, and maternal factors rather than pituitary GH.",
        "explanation_hu": "A magzati növekedés az inzulintól, az IGF-II-től és anyai tényezőktől függ, nem pedig a hipofízeális GH-tól."
    },
    {
        "id": "tk10_96",
        "type": "relational_analysis",
        "bloom_level": 3,
        "question_text_en": "Oxytocin release is essential for successful lactation in breastfeeding mothers because it directly stimulates the mammary glands to produce milk following suckling reflex excitation.",
        "question_text_hu": "Az oxitocin felszabadulása elengedhetetlen a szoptató anyák sikeres laktációjához, mert a szopási reflex kiváltását követően közvetlenül serkenti az emlőmirigyeket a tejtermelésre.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Az I. igaz, a II. hamis",
        "explanation_en": "Statement I is true, but statement II is false because Prolactin (not Oxytocin) stimulates milk *production*, while Oxytocin stimulates milk *ejection*.",
        "explanation_hu": "Az I. állítás igaz, de a II. állítás hamis, mert a prolaktin (nem az oxitocin) serkenti a tejtermelést, míg az oxitocin a tejürülést segíti."
    },
    {
        "id": "tk10_97",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which symptoms are characteristic of Sheehan syndrome according to the text? Select all that apply.",
        "question_text_hu": "Mely tünetek jellemzőek a Sheehan-szindrómára a szöveg szerint? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Absence of lactation",
                "Absence of menstrual cycle",
                "Sparse hair",
                "Severe body weight decrease",
                "Apathetic-pale appearance"
            ],
            "hu": [
                "Laktáció hiánya",
                "Menstruációs ciklus hiánya",
                "Ritka szőrzet",
                "Súlyos testsúlycsökkenés",
                "Apatikus-sápadt megjelenés"
            ]
        },
        "correct_answer": "Laktáció hiánya, Menstruációs ciklus hiánya, Ritka szőrzet, Apatikus-sápadt megjelenés",
        "explanation_en": "The text explicitly states that body weight does NOT decrease in Sheehan syndrome, distinguishing it from Simmonds-disease.",
        "explanation_hu": "A szöveg kifejezetten kijelenti, hogy Sheehan-szindrómában a testsúly NEM csökken, megkülönböztetve azt a Simmonds-betegségtől."
    },
    {
        "id": "tk10_98",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which features distinguish Simmonds-disease from Sheehan syndrome in humans? Select all that apply.",
        "question_text_hu": "Mely jellemzők különböztetik meg a Simmonds-betegséget a Sheehan-szindrómától embereknél? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Pronounced cachexia",
                "Hypothalamic damage",
                "Bradycardia",
                "Absence of lactation",
                "Anemia"
            ],
            "hu": [
                "Kifejezett kachexia",
                "Hipotalamusz-károsodás",
                "Bradikardia",
                "Laktáció hiánya",
                "Anémia"
            ]
        },
        "correct_answer": "Kifejezett kachexia, Hipotalamusz-károsodás, Bradikardia",
        "explanation_en": "While both involve pituitary injury, Simmonds includes cachexia and hypothalamic damage.",
        "explanation_hu": "Bár mindkettő hipofízis-sérüléssel jár, a Simmonds kachexiát és hipotalamusz-károsodást is magában foglal."
    },
    {
        "id": "tk10_99",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What neurological symptoms might accompany a large pituitary tumor? Select all that apply.",
        "question_text_hu": "Milyen neurológiai tünetek kísérhetnek egy nagy hipofízis-tumort? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Headache",
                "Bilateral hemianopsia",
                "Decreased visus (vision loss)",
                "Polyuria",
                "Cachexia"
            ],
            "hu": [
                "Fejfájás",
                "Bilateralis hemianopsia",
                "Csökkent vízus (látásromlás)",
                "Poliuria",
                "Kachexia"
            ]
        },
        "correct_answer": "Fejfájás, Bilateralis hemianopsia, Csökkent vízus (látásromlás)",
        "explanation_en": "Neurological symptoms are caused by local compression of the optic chiasm and intracranial pressure.",
        "explanation_hu": "A neurológiai tüneteket az optikai kiazma lokális kompressziója és az intrakraniális nyomás okozza."
    },
    {
        "id": "tk10_100",
        "type": "multiple_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following are recognized symptoms of hypothalamic insufficiency? Select all that apply.",
        "question_text_hu": "Melyek az alábbiak közül a hipotalamusz-elégtelenség elismert tünetei? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Disorders of appetite and body weight",
                "Thermoregulation disorders",
                "Sleep disorders",
                "Short-term memory disorders",
                "Diabetes insipidus",
                "Dwarfism"
            ],
            "hu": [
                "Étvágy- és testsúlyszabályozási zavarok",
                "Hőszabályozási zavarok",
                "Alvászavarok",
                "Rövid távú memóriazavarok",
                "Diabetes insipidus",
                "Törpenövés"
            ]
        },
        "correct_answer": "Étvágy- és testsúlyszabályozási zavarok, Hőszabályozási zavarok, Alvászavarok, Rövid távú memóriazavarok, Diabetes insipidus",
        "explanation_en": "Dwarfism is dynamic and relates to GH (pituitary), though GH release is hypothalamic-controlled, it's categorized under pituitary dwarfism.",
        "explanation_hu": "A törpenövés a GH-hoz (hipofízis) kapcsolódik, és bár a GH-felszabadulás hipotalamusz-szabályozott, a hipofízeális törpenövéshez sorolják."
    },
    {
        "id": "tk10_101",
        "type": "multiple_choice",
        "bloom_level": 4,
        "question_text_en": "What are the common clinical findings in SIADH (Syndrome of Inappropriate ADH Secretion)? Select all that apply.",
        "question_text_hu": "Melyek a SIADH (Syndrome of Inappropriate ADH Secretion) gyakori klinikai leletei? Válassza ki az összes megfelelőt.",
        "options": {
            "en": [
                "Decreased plasma osmotic pressure",
                "Water intoxication",
                "Hyponatremia",
                "Polyuria",
                "Increased thirst"
            ],
            "hu": [
                "Csökkent plazmaozmotikus nyomás",
                "Vízmérgezés",
                "Hiponátriémia",
                "Poliuria",
                "Fokozott szomjúság"
            ]
        },
        "correct_answer": "Csökkent plazmaozmotikus nyomás, Vízmérgezés, Hiponátriémia",
        "explanation_en": "SIADH causes water retention (opposite of polyuria) and dilution of plasma components.",
        "explanation_hu": "A SIADH vízvisszatartást (a poliuria ellentéte) és a plazmaösszetevők hígulását okozza."
    },
    {
        "id": "tk10_102",
        "type": "single_choice",
        "bloom_level": 1,
        "question_text_en": "What is the primary meaning of 'insipidus' in the context of Diabetes Insipidus?",
        "question_text_hu": "Mit jelent elsősorban az 'insipidus' szó a Diabetes Insipidus összefüggésében?",
        "options": {
            "en": [
                "Tasteless",
                "Sweet",
                "Heavy",
                "Frequent"
            ],
            "hu": [
                "Ízetlen",
                "Édes",
                "Nehéz",
                "Gyakori"
            ]
        },
        "correct_answer": "Ízetlen",
        "explanation_en": "Ancient physicians distinguished it from Diabetes Mellitus (honey-sweet) by the taste of the urine.",
        "explanation_hu": "Az ókori orvosok a vizelet íze alapján különböztették meg a Diabetes Mellitustól (mézédes)."
    },
    {
        "id": "tk10_103",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Which diagnostic test fails to provoke GH elevation in patients with pituitary dwarfism?",
        "question_text_hu": "Melyik diagnosztikai teszt nem vált ki GH-emelkedést hipofízeális törpenövésben szenvedő betegeknél?",
        "options": {
            "en": [
                "Insulin-hypoglycemia provocation",
                "Oral glucose tolerance test",
                "Water deprivation test",
                "TRH stimulation"
            ],
            "hu": [
                "Inzulin-hipoglikémiás provokáció",
                "Orális glükóztolerancia teszt",
                "Vízmegvonási teszt",
                "TRH-stimuláció"
            ]
        },
        "correct_answer": "Inzulin-hipoglikémiás provokáció",
        "explanation_en": "In health, hypoglycemia should stimulate GH release; lack of response indicates pituitary GH deficiency.",
        "explanation_hu": "Egészségeseknél a hipoglikémiának serkentenie kellene a GH-felszabadulást; a válasz hiánya hipofízeális GH-hiányt jelez."
    },
    {
        "id": "tk10_104",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which hormone is stored in the posterior pituitary and helps milk ejection in lactating females?",
        "question_text_hu": "Melyik hormon tárolódik a hátulsó hipofízisben és segíti a tejürülést laktáló nőknél?",
        "options": {
            "en": [
                "Oxytocin",
                "Prolactin",
                "ADH",
                "TSH"
            ],
            "hu": [
                "Oxitocin",
                "Prolaktin",
                "ADH",
                "TSH"
            ]
        },
        "correct_answer": "Oxitocin",
        "explanation_en": "Oxytocin is synthesized in the hypothalamus and stored in the posterior lobe.",
        "explanation_hu": "Az oxitocin a hipotalamuszban szintetizálódik és a hátulsó lebenyben tárolódik."
    },
    {
        "id": "tk10_105",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Renal diabetes insipidus is characterized by which of the following mechanisms?",
        "question_text_hu": "A renális diabetes insipidust az alábbi mechanizmusok közül melyik jellemzi?",
        "options": {
            "en": [
                "Defective ADH receptors leading to inability to insert aquaporins",
                "Lack of hypothalamic ADH synthesis",
                "Excessive breakdown of ADH in the liver",
                "Antibodies against aquaporin channels"
            ],
            "hu": [
                "Hibás ADH-receptorok, ami az akvaporinok beépülésének képtelenségéhez vezet",
                "A hipotalamusz ADH-szintézisének hiánya",
                "Az ADH túlzott lebomlása a májban",
                "Az akvaporin-csatornák elleni antitestek"
            ]
        },
        "correct_answer": "Hibás ADH-receptorok, ami az akvaporinok beépülésének képtelenségéhez vezet",
        "explanation_en": "In the renal form, ADH levels are normal or high, but the kidneys are insensitive.",
        "explanation_hu": "A renális formában az ADH-szint normális vagy magas, de a vesék érzéketlenek."
    },
    {
        "id": "tk10_106",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which hormone has a pulsatile secretion pattern that starts rising 1-2 hours after sleep onset?",
        "question_text_hu": "Melyik hormonnak van pulzáló szekréciós mintázata, amely 1-2 órával az elalvás után kezd emelkedni?",
        "options": {
            "en": [
                "Growth Hormone (GH)",
                "Cortisol",
                "Thyroid hormone",
                "Insulin"
            ],
            "hu": [
                "Növekedési hormon (GH)",
                "Kortizol",
                "Pajzsmirigyhormon",
                "Inzulin"
            ]
        },
        "correct_answer": "Növekedési hormon (GH)",
        "explanation_en": "GH shows significant circadian rhythm with peaks during deep sleep.",
        "explanation_hu": "A GH jelentős cirkadián ritmust mutat, csúcsokkal a mélyalvás során."
    },
    {
        "id": "tk10_107",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "The hypothalamic GHRH (Growth Hormone Releasing Hormone) exerts which effect on GH secretion?",
        "question_text_hu": "A hipotalamusz GHRH (Growth Hormone Releasing Hormone) milyen hatást fejt ki a GH-szekrécióra?",
        "options": {
            "en": [
                "Stimulation",
                "Inhibition",
                "Pulsatility suppression",
                "No effect"
            ],
            "hu": [
                "Stimuláció",
                "Gátlás",
                "A pulzativitás elnyomása",
                "Nincs hatása"
            ]
        },
        "correct_answer": "Stimuláció",
        "explanation_en": "GHRH stimulates, while somatostatin inhibits, GH release.",
        "explanation_hu": "A GHRH serkenti, míg a szomatosztatin gátolja a GH-felszabadulást."
    },
    {
        "id": "tk10_108",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "According to the text, what is the optimal protein intake recommended for healthy growth in children?",
        "question_text_hu": "A szöveg szerint mi a gyermekek egészséges növekedéséhez ajánlott optimális fehérjebevitel?",
        "options": {
            "en": [
                "1g protein / kg / day",
                "0.5g protein / kg / day",
                "2g protein / kg / day",
                "5g protein / kg / day"
            ],
            "hu": [
                "1 g fehérje / ttkg / nap",
                "0,5 g fehérje / ttkg / nap",
                "2 g fehérje / ttkg / nap",
                "5 g fehérje / ttkg / nap"
            ]
        },
        "correct_answer": "1 g fehérje / ttkg / nap",
        "explanation_en": "50% of this intake should ideally be biologically complete protein.",
        "explanation_hu": "Ideális esetben ennek a bevitelnek az 50%-a biológiailag teljes értékű fehérje kell, hogy legyen."
    },
    {
        "id": "tk10_109",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Vasoconstriction induced by vasopressin (ADH) typically occurs at which concentration?",
        "question_text_hu": "A vazopresszin (ADH) által kiváltott vazokonstrikció jellemzően milyen koncentrációban következik be?",
        "options": {
            "en": [
                "Only in higher (supra-physiological) concentrations",
                "At physiological concentrations",
                "Only during hyperosmolar coma",
                "Only during the neonatal period"
            ],
            "hu": [
                "Csak magasabb (szupra-fiziológiás) koncentrációban",
                "Fiziológiás koncentrációban",
                "Csak hiperozmoláris kóma alatt",
                "Csak az újszülöttkorban"
            ]
        },
        "correct_answer": "Csak magasabb (szupra-fiziológiás) koncentrációban",
        "explanation_en": "At physiological levels, its main role is osmoregulation and antidiuresis in the kidney.",
        "explanation_hu": "Fiziológiás szinteken fő szerepe az ozmoreguláció és az antidiarézis a vesében."
    },
    {
        "id": "tk10_110",
        "type": "single_choice",
        "bloom_level": 4,
        "question_text_en": "Which condition can manifest as a paraneoplastic syndrome involving high ADH levels?",
        "question_text_hu": "Melyik állapot nyilvánulhat meg magas ADH-szinttel járó paraneopláziás szindrómaként?",
        "options": {
            "en": [
                "SIADH (Syndrome of Inappropriate ADH Secretion)",
                "Central Diabetes Insipidus",
                "Renal Diabetes Insipidus",
                "Panhypopituitarism"
            ],
            "hu": [
                "SIADH (Syndrome of Inappropriate ADH Secretion)",
                "Centrális Diabetes Insipidus",
                "Renális Diabetes Insipidus",
                "Panhypopituitarismus"
            ]
        },
        "correct_answer": "SIADH (Syndrome of Inappropriate ADH Secretion)",
        "explanation_en": "Certain tumors (e.g. lung cancer) can produce ADH ectopically, leading to SIADH.",
        "explanation_hu": "Bizonyos tumorok (pl. tüdőrák) ektopiásan termelhetnek ADH-t, ami SIADH-hoz vezet."
    },
    {
        "id": "tk10_111",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "The posterior lobe of the pituitary gland synthesizes oxytocin and vasopressin.",
        "question_text_hu": "A hipofízis hátulsó lebenye szintetizálja az oxitocint és a vazopresszint.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "They are synthesized in the hypothalamus and only stored/released in the posterior lobe.",
        "explanation_hu": "A hipotalamuszban szintetizálódnak, és csak tárolódnak/ürülnek a hátulsó lebenyben."
    },
    {
        "id": "tk10_112",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Isolated GH-deficiency dwarfism is typically proportional in terms of body morphology.",
        "question_text_hu": "Az izolált GH-hiányos törpenövés jellemzően arányos a testmorfológia szempontjából.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Unlike some other types of dwarfism, proportional growth delay is characteristic for GH deficiency.",
        "explanation_hu": "Néhány más típusú törpenövéssel ellentétben az arányos növekedési elmaradás jellemző a GH-hiányra."
    },
    {
        "id": "tk10_113",
        "type": "true_false",
        "bloom_level": 2,
        "question_text_en": "Pituitary tumors always cause generalized overproduction of all anterior hormones.",
        "question_text_hu": "A hipofízis-tumorok mindig az összes elülső hormon általános túlsúlyát okozzák.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Hamis",
        "explanation_en": "Generalized overproduction is unknown; tumors usually cause isolated overproduction or hypofunction through compression.",
        "explanation_hu": "Az általános túltermelés ismeretlen; a tumorok általában izolált túltermelést vagy kompresszió révén hipofunkciót okoznak."
    },
    {
        "id": "tk10_114",
        "type": "true_false",
        "bloom_level": 1,
        "question_text_en": "In hypopituitarism, the order of hormone impairment can occur sequentially or simultaneously.",
        "question_text_hu": "Hipopituitarizmusban a hormonkárosodás sorrendje történhet egymás után vagy egyidejűleg.",
        "options": {
            "en": [
                "True",
                "False"
            ],
            "hu": [
                "Igaz",
                "Hamis"
            ]
        },
        "correct_answer": "Igaz",
        "explanation_en": "Destruction can be gradual (tumor) or instant (surgery).",
        "explanation_hu": "A destrukció lehet fokozatos (tumor) vagy azonnali (műtét)."
    },
    {
        "id": "tk10_115",
        "type": "matching",
        "bloom_level": 2,
        "question_text_en": "Match the specific diabetes insipidus form with its primary mechanism.",
        "question_text_hu": "Párosítsa a konkrét diabetes insipidus formát az elsődleges mechanizmusával.",
        "options": {
            "en": [
                "A) Central DI",
                "B) Renal DI",
                "C) Adipsic DI",
                "D) SIADH"
            ],
            "hu": [
                "A) Centrális DI",
                "B) Renális DI",
                "C) Adipsziás DI",
                "D) SIADH"
            ]
        },
        "items": {
            "en": [
                "1) Deficiency of ADH production",
                "2) Defective ADH receptors (insensitivity)",
                "3) Lack of thirst proportional to lost water",
                "4) Inappropriate ADH excess"
            ],
            "hu": [
                "1) Az ADH-termelés hiánya",
                "2) Hibás ADH-receptorok (érzéketlenség)",
                "3) A szomjúságérzet hiánya az elvesztett vízzel arányosan",
                "4) Nem megfelelő ADH-túlsúly"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Each form represents a different point of failure in the osmoregulatory axis.",
        "explanation_hu": "Minden forma az ozmoregulációs tengely más-más hibahelyét képviseli."
    },
    {
        "id": "tk10_116",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the clinical manifestation with the associated pituitary/hypothalamic condition.",
        "question_text_hu": "Párosítsa a klinikai megnyilvánulást a társuló hipofízis/hipotalamusz állapottal.",
        "options": {
            "en": [
                "A) Absence of lactation",
                "B) Proportional dwarfism",
                "C) Cachexia and bradycardia",
                "D) Bilateral hemianopsia"
            ],
            "hu": [
                "A) Laktáció hiánya",
                "B) Arányos törpenövés",
                "C) Kachexia és bradikardia",
                "D) Bilateralis hemianopsia"
            ]
        },
        "items": {
            "en": [
                "1) Sheehan syndrome",
                "2) Isolated GH deficiency",
                "3) Simmonds-disease",
                "4) Large pituitary adenoma"
            ],
            "hu": [
                "1) Sheehan-szindróma",
                "2) Izolált GH-hiány",
                "3) Simmonds-betegség",
                "4) Nagy hipofízis adenóma"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Diagnostic patterns help distinguish between various forms of pituitary failure.",
        "explanation_hu": "A diagnosztikai mintázatok segítenek megkülönböztetni a hipofízis-elégtelenség különféle formáit."
    },
    {
        "id": "tk10_117",
        "type": "matching",
        "bloom_level": 3,
        "question_text_en": "Match the growth factor or nutrient with its significance in physiological growth.",
        "question_text_hu": "Párosítsa a növekedési faktort vagy tápanyagot az élettani növekedésben betöltött jelentőségével.",
        "options": {
            "en": [
                "A) GH (pulsatile)",
                "B) Protein (1g/kg)",
                "C) Calcium / Mg",
                "D) Vitamin D"
            ],
            "hu": [
                "A) GH (pulzáló)",
                "B) Fehérje (1g/ttkg)",
                "C) Kalcium / Mg",
                "D) D-vitamin"
            ]
        },
        "items": {
            "en": [
                "1) Primary hormonal driver of post-natal growth",
                "2) Essential substrate for tissue building",
                "3) Mineral components of bone/healthy growth",
                "4) Required for proper mineralization"
            ],
            "hu": [
                "1) A születés utáni növekedés elsődleges hormonális mozgatórugója",
                "2) A szövetépítés elengedhetetlen szubsztrátja",
                "3) A csont/egészséges növekedés ásványi összetevői",
                "4) A megfelelő mineralizációhoz szükséges"
            ]
        },
        "correct_answer": "A-1, B-2, C-3, D-4",
        "explanation_en": "Normal growth requires a synergy of adequate nutrition and hormonal signaling.",
        "explanation_hu": "A normális növekedéshez a megfelelő táplálkozás és a hormonális szignálok szinergiájára van szükség."
    },
    {
        "id": "tk10_118",
        "type": "single_choice",
        "bloom_level": 3,
        "question_text_en": "Which of the following describes the mechanism of ADH action on the renal collecting ducts?",
        "question_text_hu": "Az alábbiak közül melyik írja le az ADH hatásmechanizmusát a vese gyűjtőcsatornáira?",
        "options": {
            "en": [
                "Insertion of aquaporin channels on the luminal membrane",
                "Inhibition of the RAAS system",
                "Direct active transport of water through ATP-ases",
                "Relaxation of the renal pelvic smooth muscle"
            ],
            "hu": [
                "Akvaporin-csatornák beépülése a luminális membránba",
                "A RAAS-rendszer gátlása",
                "Közvetlen aktív víztranszport ATP-ázokon keresztül",
                "A vesemedence simaizomzatának ellazulása"
            ]
        },
        "correct_answer": "Akvaporin-csatornák beépülése a luminális membránba",
        "explanation_en": "Aquaporins facilitate passive water reabsorption along the osmotic gradient.",
        "explanation_hu": "Az akvaporinok megkönnyítik a passzív vízvisszaszívást az ozmotikus gradiens mentén."
    },
    {
        "id": "tk10_119",
        "type": "single_choice",
        "bloom_level": 2,
        "question_text_en": "Sheehan syndrome is Adrenal-survivable primarily because which part of the adrenal cortex is RAAS-dependent?",
        "question_text_hu": "A Sheehan-szindróma elsősorban azért élhető túl mellékvese szempontból, mert a mellékvesekéreg melyik része RAAS-függő?",
        "options": {
            "en": [
                "Zona glomerulosa (mineralocorticoids)",
                "Zona fasciculata (glucocorticoids)",
                "Zona reticularis (androgens)",
                "Adrenal medulla (catecholamines)"
            ],
            "hu": [
                "Zona glomerulosa (mineralokortikoidok)",
                "Zona fasciculata (glükokortikoidok)",
                "Zona reticularis (androgének)",
                "Mellékvesevelő (katekolaminok)"
            ]
        },
        "correct_answer": "Zona glomerulosa (mineralokortikoidok)",
        "explanation_en": "Mineralocorticoids are essential for life and their regulation is preserved in panhypopituitarism.",
        "explanation_hu": "A mineralokortikoidok elengedhetetlenek az élethez, és szabályozásuk megmarad panhypopituitarizmusban."
    },
    {
        "id": "tk10_120",
        "type": "relational_analysis",
        "bloom_level": 4,
        "question_text_en": "Diagnosis of GH deficiency in suspected pituitary dwarfism cannot rely on a single random GH measurement because the physiological secretion of growth hormone is highly pulsatile and circadian.",
        "question_text_hu": "A GH-hiány diagnózisa feltételezett hipofízeális törpenövésben nem alapozható egyetlen véletlenszerű GH-mérésre, mert a növekedési hormon élettani szekréciója erősen pulzáló és cirkadián ritmust mutat.",
        "options": {
            "en": [
                "True + explanation",
                "True + no explanation",
                "I true, II false",
                "I false"
            ],
            "hu": [
                "Igaz + magyarázat",
                "Igaz + nem magyarázat",
                "Az I. igaz, a II. hamis",
                "Az I. hamis"
            ]
        },
        "correct_answer": "Igaz + magyarázat",
        "explanation_en": "Provocation tests (like insulin-hypoglycemia) are needed because a single low value could be part of a normal pulse cycle.",
        "explanation_hu": "Provokációs tesztekre (például inzulin-hipoglikémiára) van szükség, mert egyetlen alacsony érték a normális pulzus-ciklus része is lehet."
    }
]