Repository: shubailo/ArborMed
Catalog: mobile/lib/l10n/app_*.arb
Languages: hu

# adminChooseFile
source: Choose File & Upload
hu: Fájl kiválasztása és feltöltés

# adminErrorReadBytes
source: Could not read file bytes.
hu: Nem sikerült beolvasni a fájlt.

# adminProcessingUpload
source: Processing Upload
hu: Feltöltés feldolgozása

# adminUploadFailed
source: Upload Failed
hu: Feltöltés sikertelen

# adminUploadComplete
source: Upload Complete
hu: Feltöltés kész

# adminParsing
source: Parsing
hu: Feldolgozás:

# adminUploadSuccess
source: Successfully uploaded {count} questions.
hu: {count} kérdés sikeresen feltöltve.

# adminItemsSelected
source: {count} items selected
hu: {count} elem kiválasztva

# adminClearSelection
source: Clear Selection
hu: Kiválasztás törlése

# adminMoveTo
source: Move To
hu: Áthelyezés

# adminDeleteBatch
source: Delete Batch
hu: Köteg törlése

# adminConfirmBatchDelete
source: Confirm Batch Delete
hu: Törlés megerősítése

# adminConfirmBatchDeleteSubtitle
source: Are you sure you want to delete {count} questions? This cannot be undone if they have no responses.
hu: Biztosan törölni szeretnél {count} kérdést? Ez nem vonható vissza, ha még nincsenek rájuk válaszok.

# adminDeleteAll
source: Delete All
hu: Összes törlése

# adminSuccessDeletedCount
source: Deleted {count} questions
hu: {count} kérdés törölve

# adminErrorDeleteBulk
source: Delete failed (some questions might have responses)
hu: Törlés sikertelen (néhány kérdésnek lehetnek válaszai)

# adminMoveQuestionsTitle
source: Move Questions to Topic
hu: Kérdések áthelyezése témakörbe

# adminMoveQuestionsSubtitle
source: Select target topic for {count} questions:
hu: Válassz cél témakört {count} kérdéshez:

# adminTargetTopic
source: Target Topic
hu: Cél témakör

# adminMoveNow
source: Move Now
hu: Áthelyezés most

# adminErrorSectionNameEmpty
source: English Section name cannot be empty
hu: Az angol szekció neve nem lehet üres

# adminSuccessSectionCreated
source: Section created successfully
hu: Szekció sikeresen létrehozva

# adminErrorSectionCreateFailed
source: Failed to create section
hu: Szekció létrehozása sikertelen

# adminDeleteSectionTitle
source: Delete Section
hu: Szekció törlése

# adminConfirmDeleteSection
source: Are you sure you want to delete '{name}'?
hu: Biztosan törölni szeretnéd a(z) '{name}' szekciót?

# adminConfirmDataLossTitle
source: Confirm Data Loss
hu: Adatvesztés megerősítése

# adminDeleteSectionWarning
source: Deleting this section will PERMANENTLY delete all questions within it. This action cannot be undone.
hu: A szekció törlése VÉGLEGESEN törli a benne lévő összes kérdést. Ez a művelet nem vonható vissza.

# adminConfirmAction
source: Are you absolutely sure?
hu: Teljesen biztos vagy benne?

# adminSuccessSectionDeleted
source: Section deleted successfully
hu: Szekció sikeresen törölve

# adminManageSectionsTitle
source: Manage Sections
hu: Szekciók kezelése

# adminSectionNameEnLabel
source: Section Name (EN)
hu: Szekció neve (EN)

# adminSectionNameHuLabel
source: Section Name (HU)
hu: Szekció neve (HU)

# adminAddSection
source: Add Section
hu: Szekció hozzáadása

# adminExistingSections
source: Existing Sections
hu: Létező szekciók

# adminNoSectionsYet
source: No sections yet. Create one above!
hu: Még nincsenek szekciók. Hozz létre egyet fent!

# adminRenameSectionLabel
source: Rename Section ({lang})
hu: Szekció átnevezése ({lang})

# adminQuotesSubtitle
source: Manage motivational quotes and gallery images
hu: Motivációs idézetek és galéria kezelése

# adminManageIcons
source: Manage Icons
hu: Ikonok kezelése

# adminEcgSelectDiagnosis
source: Please select a primary diagnosis
hu: Kérjük, válassz egy elsődleges diagnózist

# adminEcgUploadImage
source: Please upload an ECG strip
hu: Kérjük, tölts fel egy EKG csíkot

# adminEcgUploadFailed
source: Image upload failed
hu: A kép feltöltése sikertelen

# adminEcgNewCase
source: New 7+2 ECG Case
hu: Új 7+2 EKG eset

# adminEcgEditCase
source: Edit 7+2 Case
hu: 7+2 eset szerkesztése

# adminRequired
source: Field is required
hu: A mező kitöltése kötelező

# quizTypeSingleChoice
source: Single Choice
hu: Egyszeri választás

# quizTypeMultipleChoice
source: Multiple Choice
hu: Többszörös választás

# quizTypeTrueFalse
source: True/False
hu: Igaz/Hamis

# quizTypeMatching
source: Matching
hu: Párosítás

# quizTypeRelational
source: Relational Analysis
hu: Relációs analízis

source: Done
hu: Kész

source: Close
hu: Bezárás
