Repository: shubailo/ArborMed
Catalog: mobile/lib/l10n/app_*.arb
Languages: hu

# quizStart
source: Start Quiz
hu: Kvíz indítása

# quizContinue
source: Continue
hu: Folytatás

# quizSubmit
source: Submit Answer
hu: Válasz beküldése

# quizNext
source: Next Question
hu: Következő kérdés

# quizFinish
source: Finish Quiz
hu: Kvíz befejezése

# quizCorrect
source: Correct!
hu: Helyes!

# quizIncorrect
source: Incorrect
hu: Helytelen

# quizScore
source: Score
hu: Pontszám

source: Quiz Results
hu: Kvíz eredményei

# quizStudyBreak
source: Study Break
hu: Tanuló szünet

# quizStartSession
source: Start Session
hu: Munkamenet indítása

# quizSelectSubject
source: Select Subject
hu: Válassz tantárgyat

# quizComingSoon
source: Coming Soon...
hu: Hamarosan...

# quizSubjectPathophysiology
source: Pathophysiology
hu: Kórélettan

# quizSubjectPathology
source: Pathology
hu: Pathológia

# quizSubjectMicrobiology
source: Microbiology
hu: Mikrobiológia

# quizSubjectPharmacology
source: Pharmacology
hu: Gyógyszertan

# quizLastStudied
source: LAST STUDIED
hu: UTOLJÁRA TANULVA

# quizQuoteTopic
source: Choose your focus for today.
hu: Válaszd ki a mai fókuszt.

# quizSubjects
source: Subjects
hu: Tárgyak

# quizECG
source: ECG
hu: EKG

source: Settings
hu: Beállítások

source: Language
hu: Nyelv

# languageEnglish
source: English
hu: Angol

# languageHungarian
source: Hungarian
hu: Magyar

source: Audio
hu: Hang

source: Music
hu: Zene

source: Sound Effects
hu: Hangeffektusok

source: About
hu: Névjegy

source: Shop
hu: Bolt

source: Inventory
hu: Készlet

source: Profile
hu: Profil

source: Friends
hu: Barátok

# stats
source: Statistics
hu: Statisztikák

source: Logout
hu: Kijelentkezés

source: Save
hu: Mentés

source: Cancel
hu: Mégse

source: Delete
hu: Törlés

source: Edit
hu: Szerkesztés

source: Add
hu: Hozzáadás

source: Search
hu: Keresés

source: Filter
hu: Szűrés

source: Sort
hu: Rendezés

source: Coins
hu: Érmék

source: Level
hu: Szint

source: Loading...
hu: Betöltés...

source: Error
hu: Hiba

source: Success
hu: Sikeres

source: Retry
hu: Újra

source: Auto-translate
hu: Automatikus fordítás

source: Review Translation
hu: Fordítás ellenőrzése

source: Translating...
hu: Fordítás folyamatban...

source: Translation failed
hu: Fordítás sikertelen

# questionText
source: Question
hu: Kérdés

source: Explanation
hu: Magyarázat

source: Options
hu: Opciók

source: Correct Answer
hu: Helyes válasz

source: Difficulty
hu: Nehézség

source: Topic
hu: Témakör

source: Questions
hu: Kérdések

source: Create Question
hu: Kérdés létrehozása

source: Edit Question
hu: Kérdés szerkesztése

source: Delete Question
hu: Kérdés törlése

# settingsTitle
source: SETTINGS
hu: BEÁLLÍTÁSOK

source: ABOUT APP
hu: RÓLUNK

source: Music Volume
hu: Zene hangereje

source: Select Track
hu: Zene kiválasztása

# themeMode
source: Appearance
hu: Megjelenés

source: Notifications
hu: Értesítések

source: Sign Out
hu: Kijelentkezés

# appVersion
source: v0.1.0 Beta
hu: v0.1.0 Béta

# appDescription
source: ArborMed is an educational companion designed for medical students to master theory through gamification.
hu: Az ArborMed egy tanulási segéd, amit orvostanhallgatók számára terveztünk az elméleti anyag játékos elsajátításához.

# appMission
source: By blending evidence-based learning with a cozy, stress-free environment, we help students tackle complex core medical subjects effectively.
hu: A bizonyítékokon alapuló tanulás és egy kellemes, stresszmentes környezet ötvözésével segítünk a hallgatóknak hatékonyan megbirkózni a nehéz orvosi tárgyakkal.

source: CREATED BY
hu: KÉSZÍTETTE

source: VISION
hu: VÍZIÓ

# visionStatement
source: Transforming medical education into a delightful, rewarding daily habit.
hu: Az orvosképzés átalakítása örömteli, jutalmazó mindennapi szokássá.

# copyright
source: Â© 2026 ArborMed Team
hu: © 2026 ArborMed Csapat

source: ACCOUNT SETTINGS
hu: FIÓK BEÁLLÍTÁSOK

source: Change Password
hu: Jelszó megváltoztatása

source: Current Password
hu: Jelenlegi jelszó

source: New Password
hu: Új jelszó

# confirmPassword
source: Confirm New Password
hu: Új jelszó megerősítése

source: UPDATE
hu: FRISSÍTÉS

# passwordsDoNotMatch
source: New passwords do not match
hu: Az új jelszavak nem egyeznek

# passwordChanged
source: Password changed successfully
hu: Jelszó sikeresen megváltoztatva

source: Change Nickname
hu: Becenév megváltoztatása

# nicknameHint
source: This name will be visible to other doctors in the Medical Network.
hu: Ez a név lesz látható más orvosok számára az Orvosi Hálózatban.

# enterNickname
source: Enter your nickname...
hu: Írd be a beceneved...

source: Nickname updated!
hu: Becenév frissítve!

source: MEDICAL ID
hu: ORVOSI AZONOSÍTÓ

source: STREAK
hu: SOROZAT

source: PAGER
hu: CSIPOGÓ

source: NETWORK
hu: HÁLÓZAT

source: Search colleagues...
hu: Kollégák keresése...

source: No doctors found
hu: Nem található orvos

source: CONSULT REQUESTS
hu: KONZULTÁCIÓS KÉRÉSEK

source: COLLEAGUES
hu: KOLLÉGÁK

# noColleaguesYet
source: No colleagues yet. Search for your peers!
hu: Még nincsenek kollégák. Keress rá társaidra!

source: Remove Colleague?
hu: Kolléga eltávolítása?

# areYouSureRemove
source: Are you sure you want to remove {username} from your network?
hu: Biztosan el szeretnéd távolítani {username} felhasználót a hálózatodból?

source: REMOVE
hu: ELTÁVOLÍTÁS

source: SENT
hu: KÜLDVE

source: ADMIN ALERT
hu: ADMIN RIASZTÁS

source: PEER NOTE
hu: Kolléga üzenete

source: From
hu: Feladó

source: Delete Message?
hu: Üzenet törlése?

# deleteMessageConfirm
source: This record will be permanently removed from your pager.
hu: Ez a bejegyzés véglegesen törlődik a csipogódról.

source: Your pager is silent.
hu: A csipogód néma.

source: ACTIVITY TREND
hu: AKTIVITÁS TREND

source: DAILY PRESCRIPTION
hu: NAPI RECEPT

source: GOAL ACHIEVED!
hu: CÉL ELÉRVE!

source: Daily dose complete.
hu: Napi adag teljesítve.

# needMoreToday
source: Need {count} more today.
hu: Még {count} szükséges ma.

source: MISTAKE REVIEW
hu: HIBÁK ÁTTEKINTÉSE

# reviewMistakes
source: Review {count} failed questions.
hu: Tekintsd át a {count} hibás válaszokat.

source: START
hu: INDÍTÁS

source: CONSISTENCY
hu: KÖVETKEZETESSÉG

source: DAY
hu: NAP

source: WEEK
hu: HÉT

source: MONTH
hu: HÓNAP

# noMistakes
source: No mistakes found to review in this period!
hu: Nincs áttekintendő hiba ebben az időszakban!

source: days
hu: nap

# logoutOfflineWarningTitle
source: OFFLINE LOGOUT
hu: KIJELENTKEZÉS OFFLINE

# logoutOfflineWarningMessage
source: You are offline and have unsynced data. Logging out now will permanently clear these local changes. Continue?
hu: Offline módban vagy és szinkronizálatlan adataid vannak. A kijelentkezés véglegesen törli ezeket a helyi módosításokat. Folytatod?

# confirmLogoutLabel
source: LOGOUT ANYWAY
hu: KIJELENTKEZÉS MINDENKÉPP

# adminDashboard
source: Dashboard
hu: Vezérlőpult

# adminUsers
source: Users
hu: Felhasználók

# adminQuotes
source: Quotes
hu: Idézetek

# adminQuestions
source: Questions
hu: Kérdések

# adminSettings
source: Settings
hu: Beállítások

# adminSemester
source: Autumn Semester 2026
hu: 2026 Őszi Szemeszter

# adminTotalUsers
source: TOTAL USERS
hu: ÖSSZES FELHASZNÁLÓ

# adminRegisteredStudents
source: Registered students
hu: Regisztrált hallgatók

# adminClassAvg
source: CLASS AVG
hu: OSZTÁLYÁTLAG

# adminOverallCorrectness
source: Overall correctness
hu: Általános eredményesség

# adminAvgBloom
source: AVG BLOOM LEVEL
hu: ÁTLAGOS BLOOM SZINT

# adminPedagogicalDepth
source: Pedagogical depth
hu: Pedagógiai mélység

# adminTopicProficiency
source: Topic Proficiency
hu: Témakörönkénti jártasság

# adminDetails
source: DETAILS
hu: RÉSZLETEK

# adminNoDataSubject
source: No data available for this subject
hu: Nincs adat ehhez a tantárgyhoz

# adminSuccessRate
source: Success Rate
hu: Sikerességi arány

# adminAvgTime
source: Avg Time
hu: Átlagos idő

# adminSuccessRatePercent
source: Success Rate (%)
hu: Sikerességi arány (%)

# adminAvgTimeSec
source: Avg Time Spent (sec)
hu: Átlagos idő (mp)

# adminQuickActions
source: Quick Actions
hu: Gyorsműveletek

# adminImport
source: Import
hu: Importálás

# adminReport
source: Report
hu: Jelentés

# adminNotification
source: Notification
hu: Értesítés

# adminStudents
source: Students
hu: Hallgatók

# adminAdministrators
source: Administrators
hu: Adminisztrátorok

# adminMedicalRegistry
source: Medical Student Registry & Performance
hu: Orvostanhallgatói regiszter és teljesítmény

# adminQuestionsUploaded
source: Questions Uploaded
hu: Feltöltött kérdések

# adminByAdmins
source: by {count} Admins
hu: {count} admin által

# adminActiveUsers
source: Active Users
hu: Aktív felhasználók

# adminNoUsersFound
source: No users found
hu: Nem található felhasználó

# adminSearchById
source: Search by ID
hu: Keresés azonosító alapján

# adminStudentAccount
source: Student Account
hu: Hallgatói fiók

# adminNoSubjectAssigned
source: No Subject Assigned
hu: Nincs hozzárendelt tantárgy

# adminViewPerformance
source: View Performance History
hu: Teljesítménytörténet megtekintése

# adminTableActivity
source: ACTIVITY
hu: AKTIVITÁS

# adminTableActions
source: Actions
hu: Műveletek

# adminSendPager
source: Send Pager Message
hu: Üzenet küldése

# adminPromoteAdmin
source: Promote to Admin
hu: Előléptetés adminná

# adminDemoteStudent
source: Demote to Student
hu: Lefokozás hallgatóvá

# adminDeleteUser
source: Delete User
hu: Felhasználó törlése

# adminPagerTitle
source: PAGER: {identifier}
hu: CSIPOGÓ: {identifier}

# adminTypePagerMessage
source: Type your message to the student...
hu: Írd meg az üzeneted a hallgatónak...

# adminMessageDispatched
source: Message dispatched!
hu: Üzenet elküldve!

# adminChangeRole
source: Change Role?
hu: Szerepkör módosítása?

# adminConfirmRoleChange
source: Are you sure you want to change {identifier}'s role to {role}?
hu: Biztosan módosítani szeretnéd {identifier} szerepkörét erre: {role}?

# adminUserRoleUpdated
source: User role updated!
hu: Felhasználói szerepkör frissítve!

# adminDeleteUserTitle
source: Permanently Delete User?
hu: Felhasználó végleges törlése?

# adminDeleteUserConfirm
source: This will erase ALL progress for {identifier}. This action cannot be undone.
hu: Ez törölni fog minden haladást {identifier} számára. Ez a művelet nem vonható vissza.

# adminDoctorRemoved
source: Doctor removed from registry.
hu: Orvos eltávolítva a regiszterből.

# adminClickHistory
source: Click for history
hu: Kattints az előzményekért

# adminNever
source: Never
hu: Soha

# adminPageOf
source: Page {current} of {total}
hu: {current} / {total} oldal

# adminAddQuote
source: Add New Quote
hu: Új idézet hozzáadása

# adminEditQuote
source: Edit Quote
hu: Idézet szerkesztése

# adminDeleteQuote
source: Delete Quote?
hu: Idézet törlése?

# adminQuoteGallery
source: Gallery
hu: Galéria

# adminQuoteRandom
source: Random
hu: Véletlenszerű

# adminQuoteTitleLabel
source: Title (e.g. Study Break)
hu: Cím (pl. Tanulási szünet)

# adminQuoteTextLabel
source: Quote Text
hu: Idézet szövege

# adminAuthorOptional
source: Author (Optional)
hu: Szerző (opcionális)

# adminQuoteUpdated
source: Quote updated successfully
hu: Idézet sikeresen frissítve

# adminNoQuotesFound
source: No quotes found. Add some to start the rotation!
hu: Nem található idézet. Adj hozzá párat a kezdéshez!

# adminMotivationalLibrary
source: Motivational Content & Library
hu: Motivációs tartalom és könyvtár

# adminQuestionBank
source: Question Bank Management
hu: Kérdésbank kezelése

# adminSearchQuestions
source: Search questions or topics...
hu: Keresés a kérdések vagy témák között...

# adminAllTypes
source: All Types
hu: Összes típus

# adminSingleChoice
source: Single choice
hu: Egyszeri választás

# adminMultipleChoice
source: Multiple choice
hu: Többszörös választás

# adminTrueFalse
source: True/False
hu: Igaz/Hamis

# adminMatching
source: Matching
hu: Párosítás

# adminRelational
source: Relational
hu: Relációs analízis

# adminLevel
source: Level
hu: Szint

# adminAllLevels
source: All Levels
hu: Összes szint

# adminAllSections
source: All Sections
hu: Összes szakasz

# adminUnnamedSection
source: Unnamed Section
hu: Névtelen szakasz

# adminManageSections
source: Manage Sections
hu: Szakaszok kezelése

# adminBatchUpload
source: Batch Upload
hu: Kötegelt feltöltés

# adminNewEcg
source: New ECG
hu: Új EKG

# adminNewQuestion
source: New Question
hu: Új kérdés

# adminTableQuestionText
source: Question Text
hu: Kérdés szövege

# adminTableBloom
source: Bloom
hu: Bloom-szint

# adminTableAttempts
source: Attempts
hu: Próbálkozások

# adminTableAccuracy
source: Accuracy
hu: Pontosság

# adminTableImage
source: Image
hu: Kép

# adminTableDiagnosis
source: Diagnosis
hu: Diagnózis

# adminTableDifficulty
source: Difficulty
hu: Nehézség

# adminQuestionDetails
source: Question Details
hu: Kérdés részletei

# adminUnknown
source: Unknown
hu: Ismeretlen

# adminUntitled
source: Untitled
hu: Névtelen

# adminSubjectFallback
source: Subject
hu: Tantárgy

# adminSectionFallback
source: Section
hu: Szekció

# adminExit
source: Exit
hu: Kilépés

# adminGoToGame
source: GO TO GAME
hu: VISSZA A JÁTÉKHOZ

# themeLight
source: Light
hu: Világos

# themeDark
source: Dark
hu: Sötét

# adminEcgTemplateApplied
source: Template Applied! Autofilled fields are highlighted.
hu: Sablon alkalmazva! Az automatikusan kitöltött mezők kiemelve.

# adminEcgDifficulty
source: Difficulty
hu: Nehézség

# adminEcgPrimaryDiagnosis
source: Primary Diagnosis
hu: Elsődleges diagnózis

# adminEcgSecondaryDiagnoses
source: Secondary Diagnoses
hu: Másodlagos diagnózisok

# adminEcgPatientHistory
source: 0. Patient History (Optional)
hu: 0. Betegkórtörténet (Opcionális)

# adminEcgSignalmentHistory
source: Patient Signalment / History
hu: Beteg adatai / Kórtörténet

# adminEcgHistoryHint
source: e.g. 55M, chest pain for 2 hours...
hu: pl. 55 ffi, mellkasi fájdalom 2 órája...

# adminEcgRhythm
source: 1. Rhythm
hu: 1. Ritmus

# adminEcgRegularity
source: Regularity
hu: Regularitás

# adminEcgRatio
source: Ratio
hu: Arány

# adminEcgSinusRhythm
source: Sinus Rhythm?
hu: Sinus ritmus?

# adminEcgSinusHint
source: P before QRS, positive in II
hu: P a QRS előtt, pozitív a II-ben

# adminEcgHeartRate
source: 2. Heart Rate
hu: 2. Szívfrekvencia

# adminEcgBpm
source: Heart Rate (BPM)
hu: Szívfrekvencia (BPM)

# adminEcgRateHint
source: Students get +/- 5 BPM grace zone
hu: A hallgatók +/- 5 BPM tűréshatárt kapnak

# adminEcgConduction
source: 3. Conduction
hu: 3. Vezetés

# adminEcgPrInterval
source: PR Interval
hu: PR intervallum

# adminEcgQrsWidth
source: QRS Width
hu: QRS szélesség

# adminEcgQtInterval
source: QT Interval
hu: QT intervallum

# adminEcgAvBlock
source: AV Block
hu: AV-blokk

# adminEcgSaBlock
source: SA Block
hu: SA-blokk

# adminEcgBbb
source: Bundle Branch Block
hu: Tawara-szár-blokk

# adminEcgAxis
source: 4. Axis
hu: 4. Tengelyállás

# adminEcgHeartAxis
source: Heart Axis
hu: Szívtengely

# adminEcgPwaveMorph
source: 5. P-Wave Morphology
hu: 5. P-hullám morfológia

# adminEcgMorphology
source: Morphology
hu: Morfológia

# adminEcgAtrialEnlargement
source: Atrial Enlargement
hu: Pitvari megnagyobbodás

# adminEcgQrsMorph
source: 6. QRS Morphology
hu: 6. QRS morfológia

# adminEcgHypertrophy
source: Hypertrophy
hu: Hipertrófia

# adminEcgPathQWaves
source: Pathological Q Waves
hu: Patológiás Q-hullámok

# adminEcgStTMorph
source: 7. ST-T Morphology
hu: 7. ST-T morfológia

# adminEcgIschemia
source: Ischemia/Infarction
hu: Iszkémia/Infarktus

# adminEcgTWave
source: T-Wave
hu: T-hullám

# adminEcgIncludeManagement
source: Include Step +2: Management & Urgency?
hu: Tartalmazza a +2. lépést: Kezelés és Sürgősség?

# adminEcgIntermediateAdvancedOnly
source: Only for intermediate/advanced cases
hu: Csak középhaladó/haladó eseteknél

# adminEcgUrgencyLevel
source: Urgency Level
hu: Sürgősségi szint

# adminEcgNotesNextSteps
source: Notes / Next Steps
hu: Megjegyzések / Következő lépések

# adminEcgManagementHint
source: E.g., Refer to Cardiology, Start Beta Blocker
hu: pl. Kardiológiai konzílium, Béta-blokkoló indítása

# adminEcgClickToUpload
source: Click to upload ECG Strip
hu: Kattints az EKG csík feltöltéséhez

# adminEcgAddSecondaryDiagnosis
source: Add Secondary Diagnosis
hu: Másodlagos diagnózis hozzáadása

# adminEcgSaveCase
source: Save 7+2 Case
hu: 7+2 eset mentése

# adminEcgNoneTapToAdd
source: None (Tap to add)
hu: Nincs (Kattints a hozzáadáshoz)

# adminEcgRegular
source: Regular
hu: Reguláris

# adminEcgIrregular
source: Irregular
hu: Irreguláris

# adminEcgIrregularlyIrregular
source: Irregularly Irregular
hu: Abszolút irreguláris

# adminEcgNormal
source: Normal
hu: Normál

# adminEcgProlonged
source: Prolonged
hu: Megnyúlt

# adminEcgShort
source: Short
hu: Rövid

# adminEcgNone
source: None
hu: Nincs

# adminEcgDifficultyBeginner
source: Beginner
hu: Kezdő

# adminEcgDifficultyIntermediate
source: Intermediate
hu: Középhaladó

# adminEcgDifficultyAdvanced
source: Advanced
hu: Haladó

# adminExplanationLabel
source: Explanation
hu: Magyarázat

# adminOptionsSelectCorrect
source: Options (Select all correct ones)
hu: Opciók (Válaszd ki az összes helyeset)

# adminOptionIndex
source: Option {index}
hu: {index}. opció

# adminAddOption
source: Add Option
hu: Opció hozzáadása

# adminSetCorrectLogic
source: Set Correct Logic
hu: Helyes logika beállítása

# adminCommonKnowledgeGap
source: Common Knowledge Gap
hu: Gyakori tudáshiány

# adminHighFailureRateWarning
source: High failure rate detected. Consider reviewing wording.
hu: Magas hibaarány észlelhető. Érdemes lehet felülvizsgálni a megfogalmazást.

# adminCommonlyConfusedWith
source: COMMONLY CONFUSED WITH:
hu: GYAKRAN ÖSSZETÉVESZTVE:

# adminConfirmDeleteQuestion
source: Are you sure you want to delete question #{id}? This cannot be undone if students have already answered it.
hu: Biztosan törölni szeretnéd a(z) #{id}. kérdést? Ez nem vonható vissza, ha a hallgatók már válaszoltak rá.

# adminErrorQuestionDeleteLinked
source: Cannot delete: Question has linked responses.
hu: Nem törölhető: A kérdéshez már tartoznak válaszok.

# adminConfirmDeleteECG
source: Are you sure you want to delete ECG #{id}?
hu: Biztosan törölni szeretnéd a(z) #{id}. EKG esetet?

# adminErrorDeleteFailed
source: Delete failed
hu: Törlés sikertelen

# adminStatement1True
source: Statement 1 is TRUE
hu: 1. állítás IGAZ

# adminStatement2True
source: Statement 2 is TRUE
hu: 2. állítás IGAZ

# adminConnectionExists
source: Connection / Link Exists (Because...)
hu: Kapcsolat / Összefüggés létezik (Mert...)

# adminMatchingPairs
source: 1-to-1 Matching Pairs
hu: 1-az-1-hez párosítás

# adminAddPair
source: Add Pair
hu: Pár hozzáadása

# adminLeftLabel
source: Left {index}
hu: Bal {index}

# adminRightLabel
source: Right {index}
hu: Jobb {index}

# adminRenameSection
source: Rename Section
hu: Szekció átnevezése

# adminTrue
source: TRUE
hu: IGAZ

# adminFalse
source: FALSE
hu: HAMIS

# adminTranslationFailed
source: Translation failed: {error}
hu: Fordítás sikertelen: {error}

# adminSourceFieldEmpty
source: Source field is empty!
hu: A forrásmező üres!

# adminSaveQuestion
source: Save Question
hu: Kérdés mentése

# adminErrorQuestionSaveFailed
source: Failed to save question
hu: Kérdés mentése sikertelen

# adminSearchCommandsHint
source: Search commands (@user, #question)...
hu: Keresés a parancsok között (@user, #kérdés)...

# adminKeyboardShortcuts
source: Keyboard Shortcuts
hu: Gyorsbillentyűk

# adminNavigate
source: Navigate
hu: Navigáció

# adminSelect
source: Select
hu: Kiválasztás

# adminClose
source: Close
hu: Bezárás

# adminNoMatchingCommands
source: No matching commands or data found
hu: Nincs találat

# adminCommandGoToDashboard
source: Go to Dashboard
hu: Irány a vezérlőpult

# adminCommandGoToQuestions
source: Go to Questions
hu: Irány a kérdések

# adminCommandGoToUsers
source: Go to Users
hu: Irány a felhasználók

# adminCommandGoToQuotes
source: Go to Quotes
hu: Irány az idézetek

# adminCommandExitAdmin
source: Exit Admin
hu: Kilépés az adminból

# adminJumpToUser
source: JUMP TO USER
hu: UGRÁS A FELHASZNÁLÓHOZ

# adminJumpToQuestion
source: JUMP TO Q
hu: UGRÁS A KÉRDÉSHEZ

# adminF10Help
source: F10 for help
hu: F10 segítség

# adminBackToCommands
source: Back to commands
hu: Vissza a parancsokhoz

# adminShowing
source: Showing
hu: Megjelenítve:

# adminVersion
source: version
hu: verzió

# adminQuestionType
source: Question Type
hu: Kérdés típusa

# adminBloomCriteria
source: Bloom Criteria
hu: Bloom kritérium

# adminSubject
source: Subject
hu: Tárgy

# adminSection
source: Section
hu: Szekció

# adminErrorSelectSubject
source: Please select a Subject
hu: Kérjük, válassz egy tárgyat

# adminErrorSelectSection
source: Please select a Section
hu: Kérjük, válassz egy szekciót

# adminAutoFill
source: Auto Fill
hu: Automatikus kitöltés

# adminEnglish
source: English
hu: Angol

# adminHungarian
source: Hungarian
hu: Magyar

# adminSelectQuestion
source: Select question
hu: Válassz kérdést

# adminDifficultyShort
source: Diff
hu: Neh.

# adminAddQuestion
source: Add Question
hu: Kérdés hozzáadása

# adminEditQuestion
source: Edit Question
hu: Kérdés szerkesztése

# adminQuestionBankTitle
source: Question Bank Management
hu: Kérdésbank kezelése

# adminQuestionsSmall
source: Questions
hu: Kérdések

# adminManageSectionsTooltip
source: Manage Sections
hu: Szekciók kezelése

# adminBatchUploadTooltip
source: Batch Upload
hu: Tömeges feltöltés

# adminNewECG
source: New ECG
hu: Új EKG

# adminNotificationBroadcastTitle
source: Send Broadcast Notification
hu: Közlemény küldése

# adminNotificationBroadcastDesc
source: This will send a push notification and in-app message to all students.
hu: Ez a funkció minden hallgatónak push értesítést és alkalmazáson belüli üzenetet küld.

# adminNotificationLabelTitle
source: Notification Title
hu: Értesítés címe

# adminNotificationLabelMessage
source: Message Body
hu: Üzenet szövege

# adminNotificationHintTitle
source: e.g. New pathology quiz live!
hu: pl. Új patológia kvíz érhető el!

# adminNotificationHintMessage
source: Enter the notification content here...
hu: Írd be az értesítés tartalmát...

# adminNoEcgCasesFound
source: No ECG cases found.
hu: Nem található EKG eset.

# adminNoDataAvailable
source: No data available.
hu: Nincs elérhető adat.

# adminItems
source: items
hu: elem

# adminSuccessQuestionsMoved
source: Questions moved successfully
hu: A kérdések sikeresen áthelyezve

# adminErrorMoveQuestions
source: Failed to move questions
hu: A kérdések áthelyezése sikertelen

# adminYesDeleteEverything
source: YES, DELETE EVERYTHING
hu: IGEN, TÖRÖLJ MINDENT

# adminNoAnalyticsAvailable
source: No analytics available
hu: Nincs elérhető analitika

# adminNeedsAttention
source: Needs Attention:
hu: Figyelmet igényel:

# adminLivePreview
source: LIVE PREVIEW
hu: ÉLŐ ELŐNÉZET

# adminSendNow
source: Send Now
hu: Küldés most

# adminErrorFillAllFields
source: Please fill all fields
hu: Kérjük, tölts ki minden mezőt

# adminSuccessNotificationSent
source: Notification sent successfully!
hu: Az értesítés sikeresen elküldve!

# adminSelectAnItem
source: Select an item
hu: Válassz egy elemet

# adminTableType
source: Type
hu: Típus

# adminTableSection
source: Section
hu: Szekció

# adminBatchUploadTitle
source: Batch Upload Questions
hu: Kérdések tömeges feltöltése

# adminBatchUploadSubtitle
source: Upload an Excel (.xlsx) or CSV file to add multiple questions at once.
hu: Tölts fel Excel (.xlsx) vagy CSV fájlt több kérdés egyszerre történő hozzáadásához.

# adminPreparationLabel
source: Preparation:
hu: Előkészület:

# adminPreparationSubtitle
source: Use our template to ensure correct formatting and dropdowns.
hu: Használd a sablonunkat a helyes formázás és legördülő menük biztosításához.

# adminDownloadTemplate
source: Download Excel Template
hu: Excel sablon letöltése
